{
  "id": 997767,
  "type": "game",
  "title": "Metal Eden",
  "releaseDate": "2025-09-02",
  "posterImage": "https://media.rawg.io/media/games/cc2/cc214573e315a7383e44d2e60329fc7a.jpg",
  "backdropImage": "https://media.rawg.io/media/games/cc2/cc214573e315a7383e44d2e60329fc7a.jpg",
  "overview": "METAL EDEN is an adrenaline-rush sci-fi FPS.\nAn advanced HYPER UNIT ASKA is sent on a suicide mission to rescue the citizens’ COREs from the vast monolithic city MOEBIUS once a hopeful new home for humanity now turned into a deadly trap.\nBlast your way through the INTERNAL DEFENCE CORPS in cybernetic warfare, confront the ENGINEERS and uncover the mysteries of the project EDEN.\nDive into cybernetic warfare against the machine forces that protect the secrets of an artificial world. Fight a diverse roster of tough, agile mecha troops and elemental forces.  Extract energy cores and destroy the INTERNAL DEFENCE CORPS shields to gain a battle zone advantage. Develop your arsenal and combat capabilities to become an unstoppable HYPER UNIT.You are a HYPER UNIT - an advanced battle android.\nBuilt to protect. Specialized in recon missions. Powered by a PHANTOM CORE.  Dash, grapple and wall-run through the INTERNAL DEFENCE CORPS using enhanced parkour skills. Harness your superior agility and acrobatic combat prowess in pulse-pounding encounters. Transform into an ARMORED RAMBALL to charge into action and take on new and deadly machine foes. Control the air and dominate the battle with your gravity hooks and jetpack.MOEBIUS  – a vast monolithic city high above the planet’s surface protecting the mysterious HIVE TOWER.  Run by mysterious ENGINEERS, once a hopeful new  home for humanity has turned into a deadly trap. Explore the brutalist and monolithic environments of the derelict orbital city and the mysterious world below, VULCAN. As HYPER UNIT ASKA, engage in the ongoing conflict over the consciousness of a lost human colony stored within reinforced storage units.",
  "score": null,
  "genres": [
    "Shooter",
    "Adventure",
    "Action"
  ],
  "screenshots": [
    "https://media.rawg.io/media/games/cc2/cc214573e315a7383e44d2e60329fc7a.jpg",
    "https://media.rawg.io/media/screenshots/d2e/d2ed3e387b4c308c82431823c68c9f36.jpg",
    "https://media.rawg.io/media/screenshots/81c/81cc6df3f4b150f73642cae76ef3f4c8.jpg",
    "https://media.rawg.io/media/screenshots/99f/99f29183986a39fd8078b513bcd5fe3d.jpg"
  ],
  "systemRequirements": null
}