{
  "id": 1009818,
  "type": "game",
  "title": "Moros Protocol",
  "releaseDate": "2025-09-17",
  "posterImage": "https://media.rawg.io/media/screenshots/2c9/2c9d67cda0988dec4af04deaf7cfce7d.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/2c9/2c9d67cda0988dec4af04deaf7cfce7d.jpg",
  "overview": "You wake up aboard The Orpheus, a derelict warship lost in deep space and crawling with horrors. No memory. No allies. Only the instinct to fight and a voice urging you forward. The ship shifts around you, the enemies never stop, and survival means battling through blood-soaked corridors to uncover what lies ahead.\n\nSet in a haunting, low-poly world with crunchy pixel textures, Moros Protocol blends fast-paced combat of classic '90s and early 2000s FPS games, the unpredictability of genre-defining roguelites, and the challenge of Souls-like boss fights. Battle relentless enemies and towering nightmares in a brutal test of skill and willpower. With procedurally generated levels, evolving threats, and intense action, survival is never guaranteed.\n\nThe ship is a war zone. The enemy is endless. The odds are against you.\nYou may be outnumbered, but you are not outmatched.\n\n\n🔺TACTICAL FPS COMBAT\nMoros Protocol combines relentless action with adaptability and customization. Shape your loadout and let the augments and weapons you find dictate your fighting style. And yes, you can kick your enemies.\n\n\n🔺ROGUELIKE PROGRESSION\nDeath is only the beginning. Learn, upgrade, and push further into the unknown. Each run is shaped by a combination of handcrafted environments and procedural generation. New layouts. New challenges to face. No two runs will feel the same.\n\n\n🔺UNIQUE CUSTOM RENDERER\nA gritty, immersive world that blends retro aesthetics with modern rendering, creating a decayed sci-fi atmosphere.  Dynamic lighting and eerie sound design heighten the tension as you explore the abandoned warship.\n\n\n🔺DROP-IN CO-OP\nTeam up with a friend for backup. Adapt and survive together as you battle through the nightmare. Experience the full game side by side, sharing the fight against the enemy.\n\n\nMessage from Pixel Reign: Moros Protocol has been a passion project that started back in 2010 as a concept, which we have been working on for the last 5 years to bring it to life. We are really excited to finally be able to share our vision with you and hope you enjoy it as much as we've enjoyed making it.\nMoros Protocol is inspired by some amazing games: DOOM, Ultrakill, Half-Life and many other amazing retro-futuristic first-person shooters! Check them out too if you have not already!",
  "score": null,
  "genres": [],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/2c9/2c9d67cda0988dec4af04deaf7cfce7d.jpg",
    "https://media.rawg.io/media/screenshots/9a4/9a43b479fee9e902258a17e2968e1073.jpg",
    "https://media.rawg.io/media/screenshots/058/05848804f3f42cf3a36fcbfb4a1132ae.jpg",
    "https://media.rawg.io/media/screenshots/ba2/ba25cc86250dfe13767cfac1fb44f7e1.jpg"
  ],
  "systemRequirements": null
}