{
  "id": 1009982,
  "type": "game",
  "title": "Crossed Commands: Collision",
  "releaseDate": "2025-09-03",
  "posterImage": "https://media.rawg.io/media/screenshots/977/977b62e80695404d9d9b596aee4615a0.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/977/977b62e80695404d9d9b596aee4615a0.jpg",
  "overview": "In creating games, Into the Breach has become an indispensable source of inspiration for me due to its outstanding strategic depth and unique game mechanics. Here, I express my deepest respect and gratitude to the creators of Into the Breach.In this turn-based strategy game, you'll pilot versatile mechs in thrilling duels against formidable foes. With each victory, you'll earn precious parts that will be invaluable resources for crafting your own unique mech.Flexible and maneuverableWith exceptional mobility, the mech can launch surprise attacks or counter-offensives, ensuring you stay ahead on the battlefield.Seize the key pointPush enemies off the battlefield with clever maneuvers, or crush them with exceptional weaponry.Master strategyIn this battlefield, terrain and enemy intelligence are equally crucial. Analyze your opponent meticulously, and cleverly exploit the environment to craft the perfect tactics, turning the enemy's attacks into your own offensive! Your counterattack will be as fierce as a sudden storm!Assemble your own mechDefeat foes, collect parts, and craft your unique mech. Equip powerful weapons and tackle tougher challenges! Your mech will be unstoppable on the battlefield!",
  "score": null,
  "genres": [
    "Strategy",
    "Indie"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/977/977b62e80695404d9d9b596aee4615a0.jpg",
    "https://media.rawg.io/media/screenshots/9b9/9b902ac2c0505e4c5ce6d6c1cd5196f8.jpg",
    "https://media.rawg.io/media/screenshots/bb1/bb10a572f7f782255e7d8f75e540ce34.jpg",
    "https://media.rawg.io/media/screenshots/8c9/8c940fb21d18c04be79ae9e663bcc682.jpg"
  ],
  "systemRequirements": null
}