{
  "id": 1009988,
  "type": "game",
  "title": "Monster Manor",
  "releaseDate": "2025-09-03",
  "posterImage": "https://media.rawg.io/media/screenshots/dfc/dfc9b391b154e8ed3ee759a9a24616a1.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/dfc/dfc9b391b154e8ed3ee759a9a24616a1.jpg",
  "overview": "Manage a special manor that rests on the side of your screen. Battle invading monsters, then recruit them to become your diligent farmers. Develop your estate and challenge new levels during work and leisure, making your manor more prosperous and powerful than ever!\"From this day forward, say goodbye to war. Plant fields, harvest crops, with food and shelter provided. The monster farmers will now live a new life of peace and contentment.\"Non-Intrusive GameplayMonster Manor sits quietly on the side of your screen, never disturbing your daily work. You can freely adjust its position and size on the screen.Automated ProductionYour diligent monster farmers will automatically plant, water, and harvest, continuously generating gold for you. Hundreds of monsters will become your exclusive farmers, achieving full automation.Challenge LevelsTake on ever-escalating levels and tidal waves of enemies. Face more powerful bosses and bring them all under your command.Multiple Tower TypesBuild a wide variety of defensive towers, each with unique upgrade paths, to construct an impregnable line of defense.Powerful SkillsUnlock and upgrade powerful skills to maximize your damage output!Optimized PerformancePerformance has been meticulously optimized to run smoothly even with a large number of units on screen.(A frame rate option is available in the settings to adjust according to performance needs.)",
  "score": null,
  "genres": [
    "Casual",
    "Simulation"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/dfc/dfc9b391b154e8ed3ee759a9a24616a1.jpg",
    "https://media.rawg.io/media/screenshots/828/82890154df3a5d8df8b8fadf1f26a03d.jpg",
    "https://media.rawg.io/media/screenshots/427/427f14d3dbdd080850c4d75cfcf31592.jpg",
    "https://media.rawg.io/media/screenshots/f10/f100c5fba947decf161618a3383afdc4.jpg"
  ],
  "systemRequirements": null
}