{
  "id": 1009986,
  "type": "game",
  "title": "Cozy Crunch",
  "releaseDate": "2025-09-03",
  "posterImage": "https://media.rawg.io/media/screenshots/247/2473112b8806ed4c4e15004777f5563d.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/247/2473112b8806ed4c4e15004777f5563d.jpg",
  "overview": "A cozy, upgrade filled, adventure that goes from curious kitty to unstoppable leaf-crunching beast.  Stomp, explore, and uncover cozy forest secrets with your magical fairy guide.Time your triple stomps to the music for a special attackCollect hidden treasuresSurvive wild windsCustomize your character\nCozy Crunch is a gentle, whimsical adventure where you guide a curious cat through a crunchy leaf-filled forest using a magical fairy (your mouse cursor). Stomp leaves, uncover secrets, and explore hand-crafted areas filled with cozy atmosphere and charming surprises.Features:Simple point and click controls4 hand crafted areasA hidden rhythm mechanic - time your triple stomps to the music to unleash powerful wavesRelaxing original soundtrackCharacter customization (50+ variations)Multiple progression paths with quests, hidden items, and upgradesSteam achievementsGame Duration: ~3-4+ hoursWishlist Cozy Crunch and prepare to leaf your worries behindWhat Streamers are Saying“I’ve come to the conclusion this game is weirdly therapeutic!” -ImCadeAbout the gameHi! I’m Jo, a solo indie developer, and this is my first game. Cozy Crunch is inspired by the charm of classic online flash games. Simple, relaxing, and designed to be enjoyed in a single cozy evening. I hope it brings you a bit of calm and delight, just like it did for me while creating it.",
  "score": null,
  "genres": [
    "Casual",
    "Indie",
    "Adventure"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/247/2473112b8806ed4c4e15004777f5563d.jpg",
    "https://media.rawg.io/media/screenshots/6a1/6a11c17e73f1033d390d7d8d44eaf63b.jpg",
    "https://media.rawg.io/media/screenshots/835/83551a92446c3310074d8c2d2abc070b.jpg",
    "https://media.rawg.io/media/screenshots/d02/d0215382049a2c27541df9932886e5a2.jpg"
  ],
  "systemRequirements": null
}