{
  "id": 1009248,
  "type": "game",
  "title": "Daemon X Machina: Titanic Scion",
  "releaseDate": "2025-09-05",
  "posterImage": "https://media.rawg.io/media/screenshots/728/7283e97d44e76985cdf2af53dfe4d2cf.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/728/7283e97d44e76985cdf2af53dfe4d2cf.jpg",
  "overview": "Digital Deluxe EditionThe Digital Deluxe Edition and Super Digital Deluxe Edition of Daemon X Machina: Titanic Scion both include the base game and additional DLC that will release over several months. The Super Digital Deluxe Edition also includes a digital art book and soundtrack that deliver new depth and detail of the world of Daemon X Machina: Titanic Scion.Downloadable Contents Available at LaunchBase GameDigital Art Book & Soundtrack (Super Digital Deluxe Edition only)Special Weapon SFX SetArsenal Appearance SetDownloadable Contents Available after LaunchExpansion Pack \"Into the Abyss\"Reclaimers Outer Appearance SetSovereign Axiom Outfit Appearance Set\nDigital Purchase BonusSpecial Equipment - Variable Breadth (Longbow)Bonus Attachment Set 1Bonus Item Set\nAbout the GameBecome the ultimate high-tech warrior in an action-packed new entry in the Daemon X Machina series. Fly into battle in your customized Arsenal, unleashing a variety of attacks tailored to your playstyle. Feel the exhilaration of fast-paced combat as you freely explore a deadly and dangerous open world on land or in the air. After taking down your foes, collect their weapons and equipment, and upgrade your skills to expand your options on the battlefield. Suit up for a dark sci-fi story where you can face the titanic boss battles alone or with up to two other players online. New and veteran Daemon X Machina players alike will find a worthy adventure in the latest from Marvelous First Studio.A Titanic EvolutionDaemon X Machina’s high-octane armored action debuts on a new generation of platforms, bringing with it an epic sci-fi adventure, gameplay that’s accessible to newcomers, and an expanded scope sure to satisfy returning fans. Together You Can Make a DifferenceCooperative multiplayer means you never truly fight alone. Team up with friends online to tackle the epic story and boss battles together.Build a Better You Now a nimble suit of armor, your Arsenal can be fully customized both in design and in loadout, with the ability to craft or salvage new elements.  Beautiful and DeadlyExplore an alien planet in your Arsenal as you battle against mechanical and organic enemies. Trek through the vast open world on foot, fly through the skies, or when all else fails, gallop on horseback across plains, swamps, mountains, and more.",
  "score": null,
  "genres": [
    "Shooter",
    "Action"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/728/7283e97d44e76985cdf2af53dfe4d2cf.jpg",
    "https://media.rawg.io/media/screenshots/499/4997499cc34fed9832e1e6c25424f183.jpg",
    "https://media.rawg.io/media/screenshots/faf/faf794e3d439d54b63d374f256c57b36.jpg",
    "https://media.rawg.io/media/screenshots/1bc/1bcda4dcc82548482b14b48b92cbef50.jpg"
  ],
  "systemRequirements": null
}