{
  "id": 968616,
  "type": "game",
  "title": "Duet Night Abyss",
  "releaseDate": "2025-10-28",
  "posterImage": "https://media.rawg.io/media/screenshots/368/368d3bcfd29f8bd62ea0573f874b3a4d.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/368/368d3bcfd29f8bd62ea0573f874b3a4d.jpg",
  "overview": "Dual Narrative and Demons of All Kinds\n\nYou will step into a land where magic and machinery coexist, playing as two protagonists with vastly different backgrounds. Encounter a variety of demonic beings with their own perspectives as you engage in constant battles and exploration to uncover the truth behind a thorny fate, ultimately bringing an end to the spiral of suffering.\n\nMultiple Weapons and Arbitrary Loadouts\n\nIn battles, you can freely switch between melee and ranged weapons, allowing characters to break free from the limitations of a single weapon class. Choose from a variety of cool melee weapons such as whipblades, crossbows, and even heavy firepower like sniper rifles, grenade launchers, and high-tech hover guns to create your unique weapon loadouts.\n\n3D Combat and Various Skills\n\nEngage in fast-paced combat against waves of relentless enemies with the freedom to utilize both close and long-range attacks, as well as aerial assaults and ground takedowns. Bask in unexpected and thrilling battle experiences through diverse combat gameplay including tracking, reconnaissance, and rescue missions.\n\nParkour Abilities and Free Spirit\n\nUtilize various movement techniques like helix leap, sliding, and double jump to swiftly and freely traverse known and unknown environments. Soar to the skies, vault over walls, and perform feats no one else can as you explore and tackle challenges in your preferred style.",
  "score": null,
  "genres": [
    "Adventure",
    "Action",
    "RPG"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/368/368d3bcfd29f8bd62ea0573f874b3a4d.jpg",
    "https://media.rawg.io/media/screenshots/d6e/d6ecff875a7e6bf07d1d07f02ac68a16.jpg",
    "https://media.rawg.io/media/screenshots/c5d/c5d1526f3566f16714dace5465dca093.jpg",
    "https://media.rawg.io/media/screenshots/24e/24e457c5e03d7732ce16d2b313d30d10.jpg"
  ],
  "systemRequirements": null
}