{
  "id": 1005611,
  "type": "game",
  "title": "Shadows of Soldiers",
  "releaseDate": "2025-12-15",
  "posterImage": "https://media.rawg.io/media/screenshots/c5d/c5d4894d448472cee59fac6859252e94.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/c5d/c5d4894d448472cee59fac6859252e94.jpg",
  "overview": "About This Game\n\nImmerse yourself in the heart-pounding action of \"Shadows of Soldiers,\" an adrenaline-fuelled 8v8 third-person cover-based tactical multiplayer shooter! Prepare to embark on an epic battlefield adventure, where strategic choices and teamwork determine victory.\n\nSelect your role from three distinct classes:\n\nJuggernaut - Unleash raw power on the battlefield as the mighty Juggernaut. Armed with devastating weaponry and fortified armor, you're a force to be reckoned with. Crush\nyour enemies and lead your team to glory. \n\n\nShadow - Become the master of stealth and precision. As a Shadow, you can slip into the darkness, surprising foes with deadly efficiency. Employ your cunning and agility to\noutmaneuver enemies and strike from unexpected angles. \n\n\nCommander - Lead your squad to triumph with tactical brilliance and keen strategic insights. The Commander class empowers you with the ability to coordinate your team, call in powerful support, and seize the battlefield's critical points.\n\n   \nEach class offers a choice of two unique abilities, allowing you to tailor your play style to perfection. Strategically select one ability to equip and deploy in intense battles to turn the tide in your favor.\n\nConquest/Team Death Match\nJoin the battle in different game modes, each with unique maps with their lore behind it. There are currently 5 unique maps for conquest and 3 for TDM to explore. \n\nThe game's environment becomes your greatest ally. Utilize the intricately designed cover system to shield yourself from incoming fire, survey the battlefield, and launch calculated counterattacks. \n\n\nWeapon Customization\nCustomization knows no bounds in \"Shadows of Soldiers.\"\n\nAppearance Customization\nPersonalize your character with a plethora of armor, headgear, and outfits, making your warrior a true reflection of your style and personality. \n\nWe use Discord as our primary communication platform. Join to follow our progress, Be first to know our updates or find other like minded players to team up with. \nhttps://discord.gg/WhrnRG62zv\n\nJoin our YouTube to see the latest developments or watch our streams where the team have discussions and play the game!",
  "score": null,
  "genres": [
    "Shooter"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/c5d/c5d4894d448472cee59fac6859252e94.jpg",
    "https://media.rawg.io/media/screenshots/fe3/fe37b33ca288f1f22905d24765238ba2.jpg",
    "https://media.rawg.io/media/screenshots/5a1/5a1eca5e04dd7b81f9b736cbb442f5fd.jpg",
    "https://media.rawg.io/media/screenshots/610/61090cdbef67d0b4f54ed8cb8f58482a.jpg"
  ],
  "systemRequirements": null
}