{
  "id": 1007653,
  "type": "game",
  "title": "EA SPORTS FC 26",
  "releaseDate": "2025-09-25",
  "posterImage": "https://media.rawg.io/media/screenshots/70f/70fb740261ef152d0d3392a9a306c9ca.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/70f/70fb740261ef152d0d3392a9a306c9ca.jpg",
  "overview": "The Club is Yours in EA SPORTS FC™ 26.\n\nPlay your way with an overhauled gameplay experience powered by community feedback. The new Authentic Gameplay option delivers the most true-to-football experience ever in Career, while the Competitive Gameplay option — driven by refined fundamentals, added consistency, and enhanced responsiveness — is tailor-made for play in Football Ultimate Team™ and Clubs.\n\nPut your dream squad to the test in Football Ultimate Team™ with new Live Events and Tournament modes, as well as a refreshed Rivals and Champs experience.\n\nExperience Manager Career like never before with all-new Manager Live Challenges. Earn rewards throughout the new season by taking on a variety of real-world scenarios and alternative storylines — ranging from a few minutes of play to multiple seasons.\n\nArchetypes inspired by the greats of the game introduce new classes to Clubs and Player Career, bringing more individuality to your player. Develop your abilities by upgrading attributes and unlocking Archetype Perks to give your player a distinct feel on the pitch.\n\nExperience The World’s Game like never before in EA SPORTS FC™ 26, with match data from the world’s top leagues powering 20,000+ authentic players.\n\nThis game includes optional in-game purchases of virtual currency that can be used to acquire virtual in-game items, including a random selection of virtual in-game items.",
  "score": null,
  "genres": [
    "Simulation",
    "Sports"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/70f/70fb740261ef152d0d3392a9a306c9ca.jpg",
    "https://media.rawg.io/media/screenshots/5f3/5f3dfab4e123fc5ad4f334673b7b01da.jpg",
    "https://media.rawg.io/media/screenshots/d49/d490a830079d101a94e0e7f0cabf7229.jpg",
    "https://media.rawg.io/media/screenshots/290/2901d940fd9ad5b5ac5d08776225de6d.jpg"
  ],
  "systemRequirements": null
}