{
  "id": 704787,
  "type": "game",
  "title": "ARC Raiders",
  "releaseDate": "2025-10-30",
  "posterImage": "https://media.rawg.io/media/games/5af/5af62b2725a440cf6858ce66b30151e5.jpg",
  "backdropImage": "https://media.rawg.io/media/games/5af/5af62b2725a440cf6858ce66b30151e5.jpg",
  "overview": "ARC Raiders is a free-to-play, reimagined, cooperative action shooter that offers an intense struggle in every session: together with your squad, defend our home and resist the onslaught of ARC – a ruthless mechanized threat descending from space.\r\n\r\nYou play as one of the Raiders, a rogue group of resistance fighters. With the help of a patchwork early warning system, you fight to protect our home against enemies dropping from orbit. ARC is faceless and unfeeling, but no one could accuse ARC of being unresponsive. In fact, ARC responds to resistance with ever-increasing destruction.\r\n\r\n\r\nResist\r\nAs a Raider, you know that defeating ARC requires more than simply pointing and shooting a gun, and more than one person trying to be a hero. When ARC is around, lone wolves never make it very far.\r\n\r\nAs underdogs, we need to believe in something bigger than our own strength, in something unapologetically human. That’s why we come together. United amid the unlikelihood of success, what seemed implausible may just become the best course of action. So, by all means, come prepared and plan ahead, but sometimes you just have to wing it.\r\n\r\n\r\nJump right into the fray in a free-to-play world.\r\nScavenge the ruins of the past. Wield tools and gadgets to outsmart the enemy. Use on-the-fly tactics, your surroundings, and physics to your advantage. If you and your squad play well together, one day the stars may again become beacons of hope, instead of omens of oblivion.\r\n\r\nReimagine the third-person shooter – Go beyond simply matching ammo to a weapon. Experience action where combat demands unrehearsed creativity.\r\n\r\nReimagine cooperation – ARC pursues you relentlessly, but together you can overcome these faceless foes. Fight, flee, and fine-tune, shoulder to shoulder with your squad.",
  "score": null,
  "genres": [
    "Action"
  ],
  "screenshots": [
    "https://media.rawg.io/media/games/5af/5af62b2725a440cf6858ce66b30151e5.jpg",
    "https://media.rawg.io/media/screenshots/673/6739bd3566489a5b4a53aa268eaef97e.jpg",
    "https://media.rawg.io/media/screenshots/c39/c391abfa567677ed86d2c571a011dac8.jpg",
    "https://media.rawg.io/media/screenshots/d4a/d4aed73646a65924432280b65b4f8559.jpg"
  ],
  "systemRequirements": null
}