{
  "id": 1010031,
  "type": "game",
  "title": "Velvet Hearth",
  "releaseDate": "2025-09-04",
  "posterImage": "https://media.rawg.io/media/screenshots/6dc/6dcafe042c89d3aa9503f809d842e12c.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/6dc/6dcafe042c89d3aa9503f809d842e12c.jpg",
  "overview": "Explore your deepest desires in a cozy, provocative home full of surprises.\nIn Velvet Hearth, you play as a charming femboy living in a rustic, vintage-style house. While modest at first glance, each room hides visual delights, secret objects, and intimate pleasures.This house is your safe space. Move freely through every corner — from the living room to the bedroom — discovering a variety of erotic toys scattered around. Dildos of all shapes, sizes, and colors await your curiosity and boldness. Each one offers a unique sensual animation, carefully crafted to highlight the protagonist's body and movements.You decide how, where, and when to indulge: alone on the living room couch at sunset, or maybe on your knees on the cold bathroom floor. Who knows — perhaps later, with your teasing cousin at your side?🔞 Explicit adult content with erotic animations\n🏡 Intimate rustic house full of personality\n💋 Femboy protagonist free to explore and give in to pleasure\n🍆 Wide variety of interactive dildos with unique visuals and effectsVelvet Hearth is more than a game — it’s an invitation to relax, explore, and connect with desire.\nAfter all, between wooden walls, the hottest secrets are revealed.",
  "score": null,
  "genres": [
    "Casual",
    "Adventure",
    "Simulation"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/6dc/6dcafe042c89d3aa9503f809d842e12c.jpg",
    "https://media.rawg.io/media/screenshots/ebd/ebd4cab968cf7d4a9f199a31effea732.jpg",
    "https://media.rawg.io/media/screenshots/d9c/d9c966390f2e08a8c1f397f9cda51f0b.jpg",
    "https://media.rawg.io/media/screenshots/220/22093141fdf381d25b4a28a12e86d572.jpg"
  ],
  "systemRequirements": null
}