{
  "id": 1009845,
  "type": "game",
  "title": "JETRUNNER",
  "releaseDate": "2025-09-04",
  "posterImage": "https://media.rawg.io/media/screenshots/01a/01a4e2cbd2e3f5ee2cf0f106592ea4c5.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/01a/01a4e2cbd2e3f5ee2cf0f106592ea4c5.jpg",
  "overview": "“A wise man once described Jetrunning as the perfect combination of athleticism and engineering. It’s where the frontier of science meets the breaking point of human mettle… and highly monetizable video broadcasting!”— Mick Acaster, Jetrunning CommentatorWELCOME TO THE WORLD OF JETRUNNERIn a dazzling near-future where gravity is optional and style is mandatory, JETRUNNER is the planet’s most thrilling sport: a pulse-pounding fusion of first-person parkour, fluid controls and fast-paced FPS action, designed for only the boldest contenders. Run, jump, slide, and blast your way through hand crafted arenas as you climb the ranks and etch your name into the annals of Jetrunning history.  FEATURESFluid FPS Parkour Gameplay: Wall-run, vault, grapple, and blaze through courses in style. Built for speed runners, stunt fiends, and highlight reels. 60+ Unique Arenas: From the New York cityscapes to the bustling streets of Seoul - every arena is a new challenge to conquer.6 Futuristic Gadgets To Master: Jet-fueled tools that give you the edge – mobility and flair all included. Narrative Campaign: Join rookie sensation Nina White in a fully voiced story mode as she rises through the ranks and battles for legendary status.Challenge Mode: Precision meets planning. Master each level with speed, smarts, and a hint of obsession. Optimize. Execute. Repeat.Global Leaderboards: Beat the best. Then make sure everyone knows it.BUILD YOUR LEGENDJetrunning isn’t just a sport…it’s a test of nerve, style, and split-second decision-making...It’s a way of life. Whether you’re chasing the fastest times, showing off your flashiest moves, or climbing the leaderboards, the stadium is your stage, and the arena is your own personal parkour playground… but remember, speed can only take you so far.LEGENDS DON’T FOLLOW PATHS – THEY CREATE THEMTo become a true Jetrunning legend, you’ve got to elevate your game. Master your arsenal of gadgets, time your boosts, and bend the arena to your will. Whether it’s shaving milliseconds off your run with a perfectly placed grapple, or discovering shortcuts no one’s dared try before, the path to greatness is anything but linear. Every arena is a puzzle begging to be broken, and the best runners don’t just play by the rules…they rewrite them. Experiment. Adapt.EVERY RUN IS A NEW OPPORTUNITYIn JETRUNNER, the finish line is just the beginning. With dozens of arenas, infinite route potential, and time-saving tricks waiting to be uncovered, every replay is a chance to push yourself further. Race against ghost replays of your own runs, chase the perfect route, and climb the global leaderboards or just beat your friend’s smug personal best. From split-second adjustments to bold new strategies, there's always another way to go faster, go flashier, and go viral.So tighten your laces, charge your giga-coils, and run like the cameras are always rolling! It’s time to show the world what you’ve got!",
  "score": null,
  "genres": [
    "Racing",
    "Adventure",
    "Action",
    "Sports",
    "Indie"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/01a/01a4e2cbd2e3f5ee2cf0f106592ea4c5.jpg",
    "https://media.rawg.io/media/screenshots/0c2/0c21bb891507ae7a8e6685f4505461ad.jpg",
    "https://media.rawg.io/media/screenshots/15e/15ec9bcd74e8308f041a5f4cdcd18d0e.jpg",
    "https://media.rawg.io/media/screenshots/5d2/5d2d8d11732d78312f7916dac89231ce.jpg"
  ],
  "systemRequirements": null
}