{
  "id": 1009887,
  "type": "game",
  "title": "Civil Purgatory",
  "releaseDate": "2025-09-01",
  "posterImage": "https://media.rawg.io/media/screenshots/0fb/0fbf22390ae2d4e90973bbdbd0e68ce0.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/0fb/0fbf22390ae2d4e90973bbdbd0e68ce0.jpg",
  "overview": "JOIN US ON DISCORD!\nAbout the GameThis game is an AI-driven experience, it is evolving and may not represent the final product.Interrogate. Investigate. Judge.In Civil Purgatory, you are a state officer tasked with evaluating detained civilians under a totalitarian regime. Each day, you'll receive a new case file with photographs, documents, intelligence reports, and confiscated items — from personal belongings to weapons and valuables.Real-Time AI-Generated DialogueEvery interrogation is powered by artificial intelligence, generating unique, unscripted conversations for each case. Civilians respond differently depending on your tone, pressure, and strategy — offering a dynamic and immersive experience every time.Search, Analyze, and ReportYou can order a patrol unit to search the suspect’s home. Their findings — hidden items, incriminating objects, or personal clues — may become vital in your investigation. You must connect the dots, identify inconsistencies, and support your judgment with evidence.Confiscate. Appraise. Profit.Your inventory can include weapons, valuables, or personal effects. Some can be appraised and sold between shifts to cover your daily expenses. But every action has ethical weight — and you are being evaluated constantly.Your Report MattersAt the end of each case, write a formal justification for your decision. Was the civilian guilty or innocent? Your logic and clarity will be reviewed by an AI system. Promotions, salary, and progression depend on the strength of your conclusions.Time is LimitedA working digital clock tracks your shift. When the alarm sounds, your day ends — regardless of progress. Manage your time wisely: interrogate, investigate, write… or leave tasks unfinished.Endless JudgementThis game has no ending. Play indefinitely with randomized civilians, increasingly complex scenarios, and persistent evaluation of your actions.FeaturesAI-generated conversations with real-time responses\nPhotographs, ID documents, and intelligence reports\nPersonal, valuable, and illegal items to analyze\nHome searches conducted by patrol divisions\nAppraisal and item selling system between shifts\nWritten reports reviewed and scored by AI\nPromotion system and evolving salary\nShift time management with digital clock and alarm\nPixel art visuals and oppressive atmosphere\nEndless mode with unlimited replayabilityWill you follow orders… or your conscience?Every civilian has a story. Every object has meaning. Every judgment is yours alone.\nWelcome to Civil Purgatory.",
  "score": null,
  "genres": [
    "Casual",
    "Strategy",
    "Indie",
    "Simulation"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/0fb/0fbf22390ae2d4e90973bbdbd0e68ce0.jpg",
    "https://media.rawg.io/media/screenshots/41e/41e62d2446f8eb006eda0a6ee2fe01b3.jpg",
    "https://media.rawg.io/media/screenshots/b06/b0608c0be95268bf5a1efbfb0e0daf49.jpg",
    "https://media.rawg.io/media/screenshots/75b/75b47a8394c8a9cf37d29e846ade205d.jpg"
  ],
  "systemRequirements": null
}