{
  "id": 1009992,
  "type": "game",
  "title": "Temple of the Green Moon",
  "releaseDate": "2025-09-03",
  "posterImage": "https://media.rawg.io/media/screenshots/193/193becf4c9e6240a6a4e379c46176de2.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/193/193becf4c9e6240a6a4e379c46176de2.jpg",
  "overview": "The plot develops around a famous blogger, an inveterate skeptic, who decides to go to the Zhigulyov Mountains to debunk myths about anomalous zones. All he is interested in is to ridicule and refute all these rumors and fairy tales. But what if mysterious forces and mysterious circumstances plunge him into a reality he never dared to even contemplate? In the dark psychological thriller \"Temple of the Green Moon\" you will immerse yourself in an atmosphere of mystery and riddles. Make unusual discoveries, learn the secrets of ancient rituals, collect rare collections. What features are waiting for you in the Zhigulyov Mountains? The ability to photograph objects hidden from the gaze of ordinary people and individual keeping of the hero's diary. In this game each of your actions will lead to the formation of pages in the diary. You will write your own story depending on your actions and your attentiveness.What awaits you:⚈ Keeping a diary: unique diary entries are generated based on game experience and actions\n⚈ Photographing locations and identifying objects that are not visible to the casual eye\n⚈ Exploring mysterious and enigmatic locations from a first-person perspective\n⚈ Travel through different eras\n⚈ Parkour and survival elements\n⚈ Battles with mysterious entities\n⚈ Deep plot\n⚈ High quality and detailed visuals created with UE5\n⚈ Choices that influence the hero's fate Discover the unknown together with the hero of the game, go all the way, plunge into the anomalous zone, which is located in the Zhigulev Mountains of the Samara region and come face to face with the unknown.",
  "score": null,
  "genres": [
    "Adventure",
    "Action"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/193/193becf4c9e6240a6a4e379c46176de2.jpg",
    "https://media.rawg.io/media/screenshots/abc/abc650ddf37c95e181e1604f5bf93cf6.jpg",
    "https://media.rawg.io/media/screenshots/0d1/0d1040eec6337f45b1d43bbd2d490c79.jpg",
    "https://media.rawg.io/media/screenshots/e38/e3831754293d8a7e76fb30aaf2bee22c.jpg"
  ],
  "systemRequirements": null
}