{
  "id": 1009228,
  "type": "game",
  "title": "Outlaws + Handful of Missions: Remaster",
  "releaseDate": "2025-11-19",
  "posterImage": "https://media.rawg.io/media/screenshots/867/867ef9da28d51911b9e41ccacb5cd4c7.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/867/867ef9da28d51911b9e41ccacb5cd4c7.jpg",
  "overview": "From the team that brought you STAR WARS™: Dark Forces Remaster comes the return of the 1997 western FPS classic, Outlaws!\nSaddle up and ride back into the Wild West with the gunslinging ex-Marshal, James Anderson, and face off against the good, the bad, and the even worse this side of the Mississippi as you work to uncover a twisted plot of greed and corruption. With your trusty six-shooting .45 Revolver, Scoped .44 Rifle, 10-Gauge Shotgun, and good ol' Sawed-Off 12-Gauge Shotgun, you'll be packin' plenty of firepower to take out all manner of outlaw varmints.\nOutlaws   Handful of Missions features high-resolution, uncompressed cutscenes and updated visuals for weapons, characters, and enemies, all fully recreated from archived art and stylized to match the original look with full color palettes. Outlaws   Handful of Missions also offers Cross-Play Multiplayer with game modes including Deathmatch, Team Play, Capture the Flag, and Kill The Fool With The Chicken!\nIt's Payback Time.\nOutlaws   Handful of Missions Remastered Key Features:\n- Engaging first-person ground combat featuring five weapon types.\n- Up to 4K 120FPS visuals.\n- Modern gamepad support adds a new weapon wheel, rumble, and motion/gyro controls.\n- 26 Achievements to unlock!\n- A Vault filled with a treasure trove of behind-the-scenes gold nuggets.",
  "score": null,
  "genres": [],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/867/867ef9da28d51911b9e41ccacb5cd4c7.jpg",
    "https://media.rawg.io/media/screenshots/a5f/a5f7434ec6216999f6d9a82db95ef5f5.jpg",
    "https://media.rawg.io/media/screenshots/a6e/a6edf98b568334bcbc55a1792b4e8194.jpg",
    "https://media.rawg.io/media/screenshots/867/867ef9da28d51911b9e41ccacb5cd4c7.jpg"
  ],
  "systemRequirements": null
}