{
  "id": 1006333,
  "type": "game",
  "title": "Atelier Resleriana: The Red Alchemist & the White Guardian",
  "releaseDate": "2025-09-26",
  "posterImage": "https://media.rawg.io/media/screenshots/be8/be86f0185ed95b5e80ad32a51852819c.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/be8/be86f0185ed95b5e80ad32a51852819c.jpg",
  "overview": "This game can be enjoyed entirely offline, with no internet connection required. This title sticks to the traditional Atelier series experience while also building upon it. Atelier fans can enjoy an evolution of the familiar synthesis and battle systems, culminating in a heartwarming story for all to enjoy.\n\n\nGAMEPLAY FEATURES\nSynthesis:\nCreate your own unique items using the simple yet intricate “Gift Color Synthesis”!\nIn this simple system, items can be made by adding ingredients according to the recipes. By linking the Gift Colors of ingredients, their traits will be carried over to the finished product. Players can also unlock new recipes by adding specific ingredients to certain recipes. Additionally, each recipe has three arrangement slots where extra ingredients can be added, boosting the effects of the finished product. Players might even be able to discover new ways to synthesize by using the “Catalyst Ingredients” found within the dimensional paths! \n\nTurn-based Battles:\nEnjoy strategic timeline command battles!\nMake use of “Multi-Actions” where the action order of allies and enemies can be switched, and “Interrupt” to empower allies with panel effects that are linked to the timeline. Additionally, enjoy even more exhilarating battles by using features such as “Item Mix,” which mixes item elements and effects!\n\nField Exploration:\nFreely roam around the Lantarna mainland while enjoying battles and gathering materials! Players can enjoy their adventure while taking in scenery like never before, experiencing the passage of time from day to night and changes in weather.\n\nDimensional Paths Exploration:\nThere are multi-level dungeons known as “Dimensional Paths,” where the map and monsters change with each visit, and rarer ingredients can be obtained as the difficulty level increases. In addition, players might find rare accessories known as “Starpearls” by opening treasure chests or defeating mighty opponents. Explore the dimensional paths in search of higher-quality synthesis ingredients and Starpearls!\n\nTown Development and Shop Management:\nSell items created through synthesis or found while exploring! Help boost the town's restoration activities by selling a variety of items, and then invest the profits and resources earned from the shop to develop the town further. As the town starts to bustle once again, reference books containing new synthesis recipes will be made available, and the story will develop! \n\n\nSTORY\nTwo young adults return to their lost hometown in search of truth and to bring back what they hold dear.\n\nThe town of Hallfein was once situated at the border of three provinces, and thrived thanks to mining and trade. However, a mysterious disaster struck this peaceful town, causing most of its residents to disappear. The town became a restricted area, and only investigators dispatched from the capital were allowed to enter.\n\nAs time passed, restrictions on the town were lifted, and a plan to restore it was initiated. Seizing this opportunity, a young woman and a young man, having come of age after being driven from Hallfein long ago, now return to the land they once called home.\n\nThe former hopes to restore the shop left behind by her missing grandfather, and the latter seeks to investigate the mementos left to him by his father. While their reasons for returning differ, they share one common goal: uncovering the cause of the townspeople's mysterious disappearance.\n\nAfter meeting in their hometown, the two embark on a journey together to seek the truth, unaware of the encounters and revelations that await them...",
  "score": null,
  "genres": [
    "RPG"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/be8/be86f0185ed95b5e80ad32a51852819c.jpg",
    "https://media.rawg.io/media/screenshots/645/64575e4337e35694b27f8937cd7200b0.jpg",
    "https://media.rawg.io/media/screenshots/34d/34d365bbfec67d82445a9cf1756d44d5.jpg",
    "https://media.rawg.io/media/screenshots/d7d/d7d3e66f48778abf2e8d836a9aa02457.jpg"
  ],
  "systemRequirements": null
}