{
  "id": 1010047,
  "type": "game",
  "title": "I Hate This Place",
  "releaseDate": "2025-11-06",
  "posterImage": "https://media.rawg.io/media/screenshots/7b5/7b57c122f5b777d37438b5a467addc90.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/7b5/7b57c122f5b777d37438b5a467addc90.jpg",
  "overview": "I Hate This Place is an isometric craft-based survival horror game set in a cursed land filled with reality-bending nightmares and terrifying creatures that thrive in the dark. You’ll need to scavenge, build, sneak, and fight if you want to make it out alive.Scavenge every corner of Rutherford Ranch to stay alive. From haunted forests, a derelict town, to infested bunkers. Explore a world teeming with danger as you gather vital resources, craft essential gear, upgrade your campsite, and rebuild outposts to have somewhere to hide.A dynamic day-night cycle that changes the world. Use daylight wisely to explore, scavenge supplies, craft what you need, and prepare for what’s coming. When night falls, the real nightmares come out to play. More enemies appear, stronger and more aggressive than before. The landscape becomes harder to navigate with just your flashlight. Sometimes your best hope is to find shelter and hunker down till morning.Stealth and combat go hand-in-hand here as many of the twisted creatures in Rutherford Ranch hunt and stalk you by sound alone. Brute force will often just land you in an early grave. Use sound to your advantage, luring creatures away from your path or cleverly leading them straight into deadly traps you laid.Inspired by the award-nominated comic book series created by Kyle Starks and Artyom Topilin, I Hate This Place comes to life with bold colors, a punchy retro comic book style, and a heavy dose of '80s flair. A unique blend of horror, dark humor, and just the right touch of camp and gore where unsettling dread meets stylized charm.",
  "score": null,
  "genres": [],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/7b5/7b57c122f5b777d37438b5a467addc90.jpg",
    "https://media.rawg.io/media/screenshots/a0c/a0c06dc45d38a12dd8203df398a0e64e.jpg",
    "https://media.rawg.io/media/screenshots/5bc/5bc01cfb02a3ab3febb1dbe448bf545a.jpg",
    "https://media.rawg.io/media/screenshots/ce2/ce2892e6bcab1bf063db49fce6f682f3.jpg"
  ],
  "systemRequirements": null
}