{
  "id": 1009984,
  "type": "game",
  "title": "These Are Them",
  "releaseDate": "2025-09-03",
  "posterImage": "https://media.rawg.io/media/screenshots/e3a/e3a1f67607b72550f295d6eb81dbfb4f.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/e3a/e3a1f67607b72550f295d6eb81dbfb4f.jpg",
  "overview": "This game doesn't have a tutorial as it is a game that is meant to be beaten as the player learns more about each of its levels and characters that being said allow me to tell you a thing or two about this game and a little of what you can expect. The goal is simple protect the hearts known as \"these\" from the wave of enemies trying to attack the \"these\" . The forces you fight are known as the \"them\" and they take on many otherworldly and uncanny forms with the soul purpose of consuming what remains of the hopeless world. in this world a fraction of light still remains as those branded with a mark of \"forward\"  can prevent the spread of the corruption and resist it themselves. When collecting a mark of \"forward\" it will recharge a small amount of energy allowing for the host it bonds with to use more of their special abilities. Every survivor has their own unique special ability and can be used as much as they like so long as they have the stamina left to unleash them.(press the confirm key/button during a stage to unleash your special attack every survivor has limited special uses per stage and collecting a mark of forward will replenish some uses so use them wisely .)now before you purchase this game it features:5 playable characters 7 levels of playable content and a whole lot of challenge while the game can be beaten in 10 minutes for some it may take 10 hours or even 10 centuries to beat as it is meant to be challenge that you will need to solve in order to beat a test of sorts so the choice is yours flee now or face the challenge.This game contains loud sounds and flashing lights so avoid playing if you have epilepsy or other health issues when playing games that feature these elements. no additional content is planned for this game however if circumstances change then any additional content added to this game will be free of charge.",
  "score": null,
  "genres": [
    "Adventure",
    "Action",
    "Casual",
    "Strategy",
    "Indie"
  ],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/e3a/e3a1f67607b72550f295d6eb81dbfb4f.jpg",
    "https://media.rawg.io/media/screenshots/bb5/bb543b3fe0eed540983ac87b29b8a8ec.jpg",
    "https://media.rawg.io/media/screenshots/ec0/ec09f6357f558be950138f703a0926b4.jpg",
    "https://media.rawg.io/media/screenshots/1f7/1f78c4470f5d8cd6b105805a26a886dc.jpg"
  ],
  "systemRequirements": null
}