{
  "id": 1010048,
  "type": "game",
  "title": "Castle of Heart: Retold",
  "releaseDate": "2025-10-02",
  "posterImage": "https://media.rawg.io/media/screenshots/24b/24bce7cdb163bf99c10349bfab370f6b.jpg",
  "backdropImage": "https://media.rawg.io/media/screenshots/24b/24bce7cdb163bf99c10349bfab370f6b.jpg",
  "overview": "Castle of Heart: Retold is a massively upgraded and expanded version of the original release, featuring significant enhancements across gameplay, story, visuals, and much more.\n\n\nStand against the Sorcerer—a servant of the evil god Chernobog—to free the last priestess of goddess Mokosh and liberate the land from the Sorcerer’s tyrannical rule. As a Slavic warrior named Svaran, you must overcome not only magical creatures and lethal contraptions, but also a terrible curse that has turned your body to stone. You need to keep up your killing spree, otherwise your body will start to disintegrate, eventually losing limbs and the ability to wield weapons!\n\nCHALLENGE WORTHY OF A KNIGHT\nTravel across four distinct Slavic landscapes and prove your worth against the Sorcerer’s minions and blood-thirsty mythological creatures, such as chorts, ghouls, and vodniks. Master your swordsmanship and tip the chances in your favor with dozens of melee and ranged weapons: from torches and hatchets to javelins and crossbows. Put your skills and reflexes to the ultimate challenge in demanding boss battles against powerful and intimidating foes.\n\nREMADE. REFINED. RETOLD.\nExperience the definitive version of Castle of Heart, boasting a legendary number of improvements. Immerse yourself in the medieval world made more beautiful thanks to new animations and character models, improved lighting, remixed music, and more detailed environment. Enjoy the massively enhanced gameplay with rebalanced combat and platforming systems, vastly improved user interface, and more responsive controls. With any distractions out of the way, wow everything boils down to your skills and tactics!\n\nAN OLD SLAVIC LEGEND\nDiscover an untold legend of Svaran and Mira who dared defy the will of the powerful Sorcerer and found themselves amongst the battle of good and evil. In Castle of Heart: Retold, every line of dialogue has been rewritten and every cutscene has been remade. Challenge yourself to collect all the crystals of Mokosh and unlock fully reimagined endings to the story!",
  "score": null,
  "genres": [],
  "screenshots": [
    "https://media.rawg.io/media/screenshots/24b/24bce7cdb163bf99c10349bfab370f6b.jpg",
    "https://media.rawg.io/media/screenshots/f1a/f1a33a511580657a85bd2fb863b5a53b.jpg",
    "https://media.rawg.io/media/screenshots/17c/17ce5062e20879bdbc33dcf48479e4ba.jpg",
    "https://media.rawg.io/media/screenshots/456/456fd87bb2f099e6c23d08981797f29a.jpg"
  ],
  "systemRequirements": null
}