{
  "id": 25691,
  "type": "tv",
  "title": "Rãmâi cu mine",
  "releaseDate": "2013-12-01",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/100/250531.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/100/250531.jpg",
  "overview": "All 13 episodes of the HBO series are, actually, about the human nature: how we discover people the way they are, essentially, with their passions, illusions, fears, loneliness, uncertainty and their dreams. The series talks about human relationships, but first of all, about the relationship with themselves. The city is not just the background of all these stories, but also a character that lives intensely and vibrates with every action. Laura is a married woman who refuses to see the cracks in her relationship and she is looking for a way to feel loved again. Adrian, her husband, is always looking elsewhere, for something that she can't offer him, and he jumps in a relationship with a mysterious woman he meets in the dark, in hotel rooms. When this mysterious woman comes into his life everything changes. Eva, the former mistress of Adrian, who's trying to find her father, has an extremely tense relationship with her mother, Silvia; she falls in love with David, the man of her dreams. But meanwhile, Iasmina, a woman as interesting as she is manipulative, manages to \"catch\" him before Eva and wants to keep him for herself at any cost. Mona is Laura's friend. She is a shy accountant, not very attractive, but with a big heart, who is in constant search of impossible relationships with men she meets online. Her life gets complicated when she starts a relation with a man that she doesn't know. She is so consumed by this fantasy that she can't even notice Virgil, the marketing manager at her clinic, a shy man who is very much in love with her and who is always by her side.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}