{
  "id": 28494,
  "type": "tv",
  "title": "David Stratton's Stories of Australian Cinema",
  "releaseDate": "2017-06-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/113/283662.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/113/283662.jpg",
  "overview": "Running through the whole series is an acknowledgement that Australian cinema has made a priceless contribution to a greater understanding of the impact of white colonization on Indigenous Australia – and just how wrong the actions of some governments have been. The films document the ongoing challenges and frustrations of Indigenous people but also celebrate their spirit, camaraderie and deadly sense of humour. Featured films include Jedda and Walkabout, Rabbit Proof Fence and Bran Nue Dae.Some of Australia's movie greats help tell this story, including the actors Nicole Kidman, Russell Crowe, Geoffrey Rush, Judy Davis, Hugo Weaving, Sam Neill, Rachel Griffiths, Eric Bana and Jacki Weaver, and the directors Gillian Armstrong, George Miller, Fred Schepisi, Bruce Beresford, David Michôd, Rachel Perkins and Warwick Thornton.They tell of their intentions at the time they made the films that are now part of Australia's history and culture. They also reflect on each other's work and discuss how the national cinema slate is shaped by Australia and also plays a part in shaping Australia.David has played a pivotal role nurturing filmmakers and helping them find audiences for their films locally and internationally. Margaret Pomeranz was at his side for a lot of that time as his television co-host of 28 years, most recently on At The Movies on ABC.Lovers of Australian cinema will adore this documentary series with its glimpses of the most moving moments, the most unforgettable scenes and the ones that caused us pain. The series also revisits some of those times when a line of dialogue was so repeated that it eventually entered the lexicon. 'You're terrible Muriel'.Those who don't think of themselves as Australian film lovers will realise they absolutely are after watching David Stratton's Stories of Australian Cinema. Australian films matter because they tell Australia's stories.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}