{
  "id": 29904,
  "type": "tv",
  "title": "Mi adorable maldición",
  "releaseDate": "2017-01-23",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/118/296731.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/118/296731.jpg",
  "overview": "Mi adorable maldición is a Mexican telenovela produced by Ignacio Sada. It is an adaptation of the Colombian story written by Julio Jiménez titled Lola Calamidades, which most recent version, Bella Calamidades, starred Danna García. The series is adapted for television by Gabriela Ortigoz and directed by Sandra Schiffner, Eduardo Said and Martha Montufar. It premiered on January 23, 2017. A total of 120 episodes have been confirmed so far. The series is starring Renata Notni as Aurora Sánchez, Pablo Lyle as Rodrigo Villavicencio, Laura Carmine as Mónica Solana, Roberto Blandón as Severo Trujillo, José Carlos Ruiz as Ponciano Juárez, Patricia Navidad as Apolonia Ortega and Maya Mishalska as Elsa Solana. Mi adorable maldición tells the story of Aurora, a beautiful teenager who, when born, was stigmatized by Macrina the midwife, as a creature born of evil, a carrier of misfortune, pain, and death. This is because Macrina discovers in Aurora a lunar in the form of skull on her navel, and the mother of Aurora dies just after the delivery. Anselmo, father of Aurora, fails to overcome the loss of his wife, Carmen. He dumps all his love in Aurora and insists on protecting and keeping her away from the people of the town who point her as an evil creature. Aurora's curious spirit takes her one day to disobey her father and approach the village. At first, Aurora does not understand why her father has denied meeting these people who are so kind, but everything changes the moment she meets Macrina, who recognizes Aurora and the supposed curse that weighs on her. The people, when identifying her, attack Aurora. Rodrigo, a boy of 15 years, intervenes to defend her. From that moment Aurora and Rodrigo initiate a beautiful friendship that will eventually become the first and only love of both.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}