{
  "id": 28803,
  "type": "tv",
  "title": "Две легенды",
  "releaseDate": "2014-11-22",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/114/286971.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/114/286971.jpg",
  "overview": "If you thought teaching was boring, this will change your mind forever! He teaches mathematics, she teaches biology. He's an ostracized nerd, she's everybody's dream. However, they also have plenty in common: they speak several languages, know how to use the latest technology and have overwhelming fighting skills. To save lives, these unusual super spies will need to become a team… Together they will become Two Legends!Directed by Vyacheslav Kirillov, Two Legends is an action-filled crime drama about two Russian secret agents who pose as teachers in their day-to-day lives. When teaching classes, their lives seem unexciting, but as soon as they leave the classroom, a new personality possesses them, making this couple the best-ever Russian spies on TV!With outstanding performances by Artem Krylov and Ana Popova, the two spies of this four-part mini-series promise to thrill you to the end, as its plot develops to reveal one of the most tangled terrorist organizations in Russia. Considered by the Russian press as one of greatest television productions of 2014 in the country, Two Legends became an instant primetime success in Russia.In this production filmed in Moscow and Riga, the two protagonists dedicate their lives to facing down a complex organization that has been sowing fear in Russians' lives. As in any big spy action series, Two Legends not only presents the complex, tumultuous cases that keep these \"teachers\" working around the clock using cutting-edge anti-crime technology, but digs deeper, exploring the characters' relationships and psychology – all with a bit of Russian black humor.Enjoy a series that proves that teachers' lives aren't boring at all - come live all the excitement of your favorite mathematics and biology teachers!",
  "score": null,
  "genres": [
    "Drama",
    "Action",
    "Crime"
  ],
  "screenshots": [],
  "systemRequirements": null
}