{
  "id": 26080,
  "type": "tv",
  "title": "Золотая Орда",
  "releaseDate": "2018-03-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/148/370543.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/148/370543.jpg",
  "overview": "The end of the XIII-th century. Ancient Russia is under Tatar-Mongol yoke. Grand Prince Yaroslav dreams to unite the scattered Russian principalities and get rid of the hated Tataro-Mongols, but his own brother - the disgraced Prince Boris - and his eldest son Vladimir stand in the way. Tengri-Temir, an envoy of the Golden Horde, arrives in the capital of Russia - a handsome man and a true connoisseur of feminine beauty. He's come to take a thousand of Russian soldiers to the Horde but is ready to accept half of the deal, if only the Grand Prince will give him Ustinya, wife of Boris. Yaroslav is not ready to break the laws of faith and honor, but Boris himself agrees to go for it hoping this sacrifice will open a way to the throne for him. Ustinya leaves her homeland with a caravan...Tengri leaves a present for Yaroslav from the Great Khan - the young Nargiz who reanimates the Prince and puts him before a fatal choice. On the one hand there is love and passion, on the other hand - the throne and life of Nargiz herself who is not welcome neither by the people, nor by the wife of Yaroslav. Meanwhile, Berke, the Great Khan of the Horde, feels the presence of death and desperately dreams of a heir. In the steppe he meets the daughter of a whealty merchant, 16-year-old Ayzhan. The old man, being cruel and mentally ill, makes Ayzhan his third wife. It seems that beautiful Ayzhan's life ends with the very last moment of the wedding, but a young artist Nikolka, who's been brought to the Horde among with Tengri-Temir's caravan, is ready to give his life for freedom and a kiss from a beautiful outlander",
  "score": null,
  "genres": [
    "Drama",
    "Adventure",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}