{
  "id": 25732,
  "type": "tv",
  "title": "GLOW: Gorgeous Ladies of Wrestling",
  "releaseDate": "1986-09-13",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/100/251231.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/100/251231.jpg",
  "overview": "GLOW: Gorgeous Ladies of Wrestling, also known as GLOW or G.L.O.W., is a women's professional wrestling promotion begun in 1986 (the pilot was filmed in December 1985) and continued in various forms after it left television. Colorful characters, strong women, and over-the-top comedy sketches were integral to the series' success. Most of the performers were actresses, models, dancers, and/or stunt women hoping to get into show business through wrestling. GLOW was created by Matt Cimber as an evolution of a somewhat different original concept by David B. McLane. That began as an aftermath of Jackie Stallone's physical fitness gym for women only, Barbarella's. Mando Guerrero trained all of the women initially. After they moved the show to Las Vegas Ninotchka took control over training the new women. The syndicated GLOW TV show was produced for four seasons (1986–1990) from the Riviera Hotel on the Las Vegas Strip. Seasons 3 and 4 were in fact, filmed at a former warehouse building approximately three miles east of the Riviera hotel which is currently a Harley-Davidson outlet. During the casting for the pilot, not all of the women were taking it seriously, so Mando Guerrero put one woman in a submission hold and made her cry. They cast twelve women for the show and trained them for six weeks prior to the shoot. They wrestled approximately eight matches per show, which eventually was sold. Some of the women moved to Las Vegas to continue working with the promotion. The show itself differed from Vince McMahon's World Wrestling Federation in that they had actual seasons where some wrestlers were dropped, changed, or added before the new season began. Each season consisted of 26 episodes that were each rerun once to complete the year, with a total of 104 episodes produced.",
  "score": null,
  "genres": [
    "Comedy",
    "Action",
    "Sports"
  ],
  "screenshots": [],
  "systemRequirements": null
}