{
  "id": 29731,
  "type": "tv",
  "title": "The Daily Buzz",
  "releaseDate": "2002-09-16",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/118/295156.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/118/295156.jpg",
  "overview": "For many years, we wanted to create a syndicated television program that would smoothly integrate the content we produce for our clients into a show that people would actually watch, especially in top markets, including New York, Los Angeles, and Chicago. It turned out we didn't have to create one. The show already existed – or did – and we only had to bring it back to life. For 13 years, The Daily Buzz built a substantial television audience of youthful viewers by presenting intriguing news, celebrity gossip, and consumer news-you-can-use in a fast-paced, fun, entertaining one-hour format. The Daily Buzzwas always friendly to PR pros who wanted to integrate their clients' stories into the show. But unlike other programs, it was done with an eye on maintaining high quality production values. The result was attractive to the audience and also to PR pros. After encountering financial difficulties a couple of years ago, the Daily Buzz was cancelled. But the show was so good, we investigated how it might be re-launched. We were lucky. Not only have we brought back the Daily Buzz's creative team, the original anchors are on board and we'll be producing the show on its original Orlando, Florida set.The new now renamed Buzz will begin airing June 18 on POP-TV, formerly the TV Guide channel, in every major U.S. market between 6:00 and 7:00 AM. Owned by CBS Corporation and Lionsgate Media, POP is one of the fastest-growing networks in television. POP has expanded its distribution on traditional cable and over-the-top platforms and drove double digit growth in viewership among adults ages 18-49 (+21%) and women 25-54 (+13%), according to Nielsen. Initially, the show will be weekly, however, we will be posting daily news and updates on The Daily Buzz's social media platforms, including Facebook, Twitter, Instagram and Snapchat (thedailybuzztv). With an audience of more than 50,000 fans on Facebook and nearly 10,000 Twitter followers, the Buzz will rely on its online community for daily engagement. Portions of the show as well as full recordings of the episodes will get hosted on YouTube.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}