{
  "id": 28888,
  "type": "tv",
  "title": "Who Killed Tupac?",
  "releaseDate": "2017-11-21",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361322.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/544/1361322.jpg",
  "overview": "Who Killed Tupac? is a six-hour limited series focusing on the investigation of the death of prolific and influential rapper and actor, Tupac Shakur. Each installment of this investigative series will include aspects from the legendary artist's life as well as follow famed civil rights attorney Benjamin Crump as he conducts a full-scale, intensive investigation into key theories behind his murder.Crump has represented the families of Trayvon Martin, Michael Brown, Tamir Rice and other victims of gun violence who many believe were denied their due process of the law. When Tupac's mother, Afeni Shakur, who went to high school with Crump's mother, saw that he was fighting for truth and justice for the family of Trayvon Martin, she expressed to him how important that was and that this fight is not just for Tupac and Trayvon, but for all our young black men who didn't get justice. In exploring how Tupac didn't get his due process, Crump seeks to show how it is relevant to what is happening in the social justice movement in America today.Through Tupac's own words and exclusive new interviews with eyewitnesses, family, friends, and colleagues, viewers will come to understand every facet of Tupac Shakur's complex personality. Key interviews include Tupac's brother Mopreme Shakur, his childhood friend E.D.I. Mean as well as other members of his group Outlawz, Al Sharpton, radio personality Big Boy, Christopher Darden, his first manager Leila Steinberg, former MTV correspondent Tabitha Soren, executives at Death Row Records, former gang members of the Bloods and the Crips, Quincy \"QDIII\" Jones III and Digital Underground's Money-B.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}