{
  "id": 28109,
  "type": "tv",
  "title": "La Impostora",
  "releaseDate": "2014-01-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/111/278041.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/111/278041.jpg",
  "overview": "Blanca Guerrero (Lisette Morelos) is a cheerful and resourceful girl with a big heart, who works as a waitress dreaming of an acting career. At an early age, she began helping her father Memo as much as she could, due to her mother's early death. When Memo is unjustly fired by Raquel Altamira from his job at her family's company, where he worked for years, Blanca decides to go to the Altamira's end of the year costume party and notify Don Leonidas, the company's owner of the situation with her father, and hopefully convince him of rehiring him, and thanks to her amazing acting skills she is able to sneak her way in. At the party, Blanca meets Eduardo, the very shy yet romantic son of Raquel, with whom she shares a passionate kiss at midnight, all while hiding her identity. The party goes however awry when Adriano Ferrer (Manuel Landeta), a rich businessman, crashes the party to reveal a secret affair, and child that he had years prior with Valentina Altamira, Raquel's younger sister. Adriano also accuses the Altamira family for the death of his young love Valentina, not knowing that she is actually alive, but is being detained in a psychiatric hospital by orders of her older sister Raquel. A few days later, Adriano finds out that Memo, Blanca's father knows the truth about what happened to his and Valentina's child and goes to visit him at his home, but finds Blanca, the girl that had helped him while at the party days before, and she tells him that her father is in the hospital after being run over by a car. That same day, as Adriano goes to visit Memo at the hospital, he runs into Blanca disguised as a nurse and makes her an offer she can't refuse, promising her to help her pay her father's medical bills if she becomes \"the impostor\", helping him uncover the truth of what really happened to Valentina and his child. In the process, Blanca has to become Victoria San Marino, a millionaire investor from New York, get into partnership with the Altamira family and",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}