{
  "id": 26904,
  "type": "tv",
  "title": "Трасса смерти",
  "releaseDate": "2017-04-17",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/106/265585.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/106/265585.jpg",
  "overview": "The plot of the series Трасса смерти (Highway of Death) is based on real events that took place on the highway M4 ( \"Dawn\") in 2014. According to the plot of the series on the highway of federal significance brutal gang of road killers commit daring crimes. Acting maximum boldly, killer scatter on the section of road spikes of nails, then quenched transportation and coolly kill drivers from firearms and then disappear enigmatic. Moreover the newspapers have already called them \"gang GTA» because their crimes are similar to a computer game of the same name. To investigate a series of brutal crimes investigators charge Zvonareva (role played Andrew Merzlikin) from the local police department and Melnikov (the role played Sergey Makovetskii) of the Investigative Committee for disclosure of particularly serious crimes. These detectives are completely different Stuff work and get on them first in one team is very difficult. However, they have one goal to reveal the identity of the perpetrators and prevent new crimes. Will the experienced investigators out on the trail of daring criminals and prevent new crimes? The answers to these questions viewers learn watching the entire series pictures \"route of death.\" Production of 10-series serial formed film company «Motor Film Studio». In the director's chair crime drama sent Denis Neymand known audience for such works as \"Tin\", \"Uppercut for Hitler,\" \"special purpose City\", and the script was written Andreem Zhitkovym ( \"Saboteur 2: End of the War\", \"Saboteur\", \" Landing Forces, \"\" Gangs \"). TV viewers in the TV series \"Highway of Death\" really expect a stellar cast in the film was attended by Sergey Makovetskii Andrew Merzlikin Agnes Kuznetsova, Alexander Luchinin, Artem Semakin Alexander Tyutin, Dmitriy Brauer and others. Premiere show of the series \"Highway of Death\" is scheduled for the channel NTV in spring 2017. So do not miss ... See our website for all the crime drama series \"Highway of Death\" in good quality HD.",
  "score": null,
  "genres": [
    "Thriller",
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}