{
  "id": 26849,
  "type": "tv",
  "title": "The Chefs' Line",
  "releaseDate": "2017-04-03",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/105/264353.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/105/264353.jpg",
  "overview": "The Chefs Line' will explore the heritage, history and diversity that drives Australia's food culture, with home cooks challenging an entire chefs' line from some of the best restaurants across the country.The series will be presented by SBS's resident food expert Maeve O'Meara. The dishes will be judged by three of Australia's hottest culinary stars; Executive Chef Dan Hong, renowned chef Mark Olive and leading food writer Melissa Leong.Each week, The Chefs' Line will celebrate a different cuisine and a new chefs' line will represent their restaurant. The home cooks must earn their stripes and cook their way up the ranks of the chefs' line. We'll see passion and personality go into every plate they produce and witness not just competition, but camaraderie as the home cooks learn and laugh with the professional chefs.In the ultimate food fight, four home cooks go up against the apprentice chef every Monday night. The home cooks with the best three plates on the pass progress through to the next night. On Tuesday, home cooks have moved a step up the chefs' line and cook against the station chef. Wednesdays is always the penultimate battle; home cooks take on the sous chef. Thursday night is the final night of the competition; the best home cook faces-off against the restaurant's head chef in the ultimate David vs Goliath battle.In a special episode each Friday, Maeve O'Meara gives a guided tour of the featured restaurant, the chefs share stories from the week and tantalise with delicious recipes.Can the passion of a home cook beat the skills of a professional? Who has what it takes to beat The Chefs' Line?",
  "score": null,
  "genres": [
    "Food"
  ],
  "screenshots": [],
  "systemRequirements": null
}