{
  "id": 27546,
  "type": "tv",
  "title": "The Zoo",
  "releaseDate": "2010-02-17",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/108/271753.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/108/271753.jpg",
  "overview": "Much-loved series The Zoo makes its anticipated return to RTÉ One on 2 April. The show will air in a new timeslot of 6.30pm on Sundays, making it perfect viewing for the whole family.Back for a seventh season, 'The Zoo' will once again showcase the passion and expertise the team at Dublin Zoo has for the animals in their care. This season, viewers will be able to follow the happenings at the Zoo over eight episodes during an incredibly exciting time for all involved there!This series there is great excitement at the Gorilla Rainforest when the keepers discover that Lena, the Western lowland gorilla, is pregnant. Viewers can see how her pregnancy progresses right up to the moment when she gives birth and feeds her new born baby for the first time. An impressive new habitat the Orangutan Forest, inspired by the natural environment of the Bornean orangutans, the tropical rainforests of Borneo, opens at the Zoo. Viewers can watch the Bornean orangutans take their first steps into their new habitat and meet their new neighbours, the siamang gibbons, who they will be sharing their home with.The new series will once again leave the Phoenix Park to follow the zookeepers as they visit some of the Irish and international conservation projects supported by Dublin Zoo. Helen Clarke-Bennett takes an incredible journey deep into the swamps and rainforests of the Republic of the Congo to visit a project dedicated to helping protect forest elephants and Western lowland gorillas. Closer to home the Dublin Zoo team will visit some fascinating Irish conservation projects, including protecting lapwing chicks in the Irish countryside and going out on call with Hedgehog Rescue Dublin.Other stories include a lion cub with an injured leg receiving attention from zoo keepers and a Sumatran tiger with a toothache requires a dental appointment with the veterinary team. Of course, there's plenty of time for fun too when we catch up with the progress of Dublin Zoo's eldest elephant calves Kavi, Ashoka and Samiya. Other species featured this season include meerkats, two-toed sloth, southern white rhinoceros, green tree python, Asian leaf turtle, red panda, red river hogs, African painted dogs, scimitar-horned oryx and many others.The Zoo is produced and directed by Shane Brennan and John Higgins of Moondance Productions for RTÉ One and is narrated by Tom Dunne.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}