{
  "id": 34424,
  "type": "tv",
  "title": "Расплата",
  "releaseDate": "2018-01-20",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/142/356975.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/142/356975.jpg",
  "overview": "Dramatic story of Larisa's life. A simple working woman who has never seen happiness, the husband constantly drinks, every day turns into a true nightmare. Standing on the threshold of her own house, she has no desire to enter it. The only salvation is a little daughter, who became a ray of sunshine in this nightmarish and dark world. But even here everything is not perfect, because of the persistent maladies of the baby, the mother can not restrain herself in any work, she always has to stay at home, because she can not even leave the baby. Her husband began drinking more and more often, things started to disappear from the house. During another drunken scandal, a neighbor decides to intervene. She decides to introduce Larissa to her cohabitants, the married couple Marina and Roman. A couple of shuttles sincerely sympathized with the woman, having taken her story to heart, invite her to go with them to their seaside town where they can provide her with work. Then it seemed like salvation, nothing else was needed, just to escape from this hell. But what started so sweetly ended very sadly. The couple takes away Larissa's passport, and sells it together with the child in slavery for debts. Now the main character with the child in her arms is forced to wander around the city and beg. Everyone knows about such a business, so there is nowhere to wait for help. But at some point, fate decides to change everything. Evil can not be unpunished, sooner or later punishment will come and then you should not ask for forgiveness. On the way of Larissa there is an assistant, as if sent by God, who helps her to get a ticket to a new happy life.",
  "score": null,
  "genres": [
    "Drama"
  ],
  "screenshots": [],
  "systemRequirements": null
}