{
  "id": 31776,
  "type": "tv",
  "title": "The Poseidon Adventure",
  "releaseDate": "2005-10-09",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/127/318334.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/127/318334.jpg",
  "overview": "Welcome aboard the majestic S.S. Poseidon--a virtual floating city--as it departs from Athens on a month-long cruise. Among the 2,500 hundred passengers is Mike Rogo, undercover agent for Homeland Security. Among the crew of 1,200 is Kasim Badawi, a terrorist conspiring to send an explosive message to the world. Acting on word of the impending danger, the Poseidon pushes its engine at full speed toward the nearest port, slicing through the churning waters of an escalating storm and directly into unavoidable catastrophe. Only minutes into the new year, the bomb detonates, leaving the shredded hull vulnerable to the roiling seas pouring into the wounded Poseidon. The 136,000-ton beast capsizes, leaving a chosen few underwater and terrified for their lives.It's hell upside down as the disparate survivors make their way up… to the bottom of the S.S. Poseidon: Richard Clarke, a husband and father torn between a mistress he must save and the family he can't live without; European pop star Aimee Bediér-Anderson, embarking on an American career and a new Hollywood marriage; Belle Rosen, a widow enduring in the name of her beloved late husband; and Rogo and his reviled prisoner Badawi, handcuffed together in a personal war of justice, sacrifice, and revenge. Through the twisted metal inferno of the inverted ship, they must outlast the inevitable as the Poseidon sinks deeper and deeper into darkness. From this nightmarish maze emerges a drama of human spirit and resilience, of life-and-death emotions and psychological terrors, and of the unyielding strength of the human will to survive against all odds.",
  "score": null,
  "genres": [
    "Drama",
    "Adventure",
    "Thriller"
  ],
  "screenshots": [],
  "systemRequirements": null
}