{
  "id": 36440,
  "type": "tv",
  "title": "Ordinace v růžové zahradě",
  "releaseDate": "2005-09-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/396/991411.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/396/991411.jpg",
  "overview": "Ordinace v růžové zahradě (Rose garden clinic)The most popular programme in the Czech Republic - it is broadcast twice a week in primetime, from eight in the evening. It wins awards every year in popularity surveys. The viewing figures in the target group range from 55% to 60%. It is a relationship serial set in a medical environment.During the first series, the serial was set primarily in a private gynaecological clinic, in the gynaecological-obstetrics department of a local hospital and in a paediatric clinic.Doctor Gita Petrová, her colleague Michal Šebek and nurse Kamila Váchová work in the gynaecological clinic, in a villa surrounded by rose beds, where most of the stories unfold over the first year. In the second year of the serial (still the first series) we continue in the stories from the gynaecological clinic, and another location is added: Paediatric Practice. The central characters in the main plot are joined by several new ones – mainly doctors – representing various interesting fates (Běla Páleníková, Prokop Hrubý, Marek Kroupa), and in other plots we follow up the fates of the characters shown in the last season (Gita Petrová, Čestmír Mázl).Rose Garden Clinic II. The setting of the gynaecological and paediatric clinic from the first series is replaced in the second one by the more dynamic surgical department of the Kamenice Hospital. A new plastic surgery department is opened in the hospital. The range of patients' stories now includes the topical issues of beauty and ugliness, modern trends in the perception of the human body, and identifying the borderline between mere whims and genuine misfortune. In further episodes we see the opening of another department, accident and emergency. In these episodes the doctors work with medical equipment worth several million crowns.It is certainly worth mentioning that for the entire duration of filming, \"our\" team of doctors works with real professionals, and they visit hospitals for research purposes to make their acting performance as convincing as possible.",
  "score": null,
  "genres": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}