{
  "id": 39209,
  "type": "tv",
  "title": "My Antonio",
  "releaseDate": "2009-08-16",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/172/430912.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/172/430912.jpg",
  "overview": "Actor, model, and one of Calvin Klein's most famous faces, Antonio Sabato Jr. was once the ultimate bachelor, desired by beautiful women all over the world. Now, Antonio is looking to settle down, open his heart and share his life with the woman of his dreams. Welcome to My Antonio, a reality-dating show that will find the one woman who can prove her inner flame burns as brightly as that of one of the most devastatingly handsome men in the world. These stunning and sophisticated beauties will gather by special invitation to compete for Antonio's heart. It's a ten episode reality show high-wire arc of true love search and rescue. Antonio's love quest is real. He's determined to settle down and find his soul mate, and he's looking for someone as serious about life and love as he is. Who will be that special all-around diamond of a mate: someone adventurous enough to go horseback riding on a windswept mountainside at a moment's notice...cultured enough to shine with sparkling wit and wisdom ... comfortable enough to travel with him all over the world? Who will be the one who has what it takes to share Antonio's heart ... forever? My Antonio begins with the women arriving at Antonio's tropical enclave -- on a sun drenched incredulously romantic resort on the Big Island of Hawaii. Antonio will greet our contestants as he sails up on his luxury sailing yacht, dives in and swims to the beach. Exiting the surf dripping wet, Antonio will introduce himself to each hopeful with a simple greeting and a kiss of their trembling hand. The story unfolds in a season long narrative arc akin to a nighttime soap opera -- complete with shocking plot twists and turns. From an overzealous matriarch (Antonio's momma, Yvonne) who cannot let go of her son, to a mysterious lover from Antonio's past who thrusts herself back into the competition to win back his heart, My Antonio will feel like \"Dallas\" or \"Dynasty\" -- except that it's real life. Antonio Sabato Jr. puts everything on the line to find his ultimate love.",
  "score": null,
  "genres": [
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}