{
  "id": 34474,
  "type": "tv",
  "title": "Mahakali – Anth hi Aarambh hai",
  "releaseDate": "2017-07-22",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/518/1296364.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/518/1296364.jpg",
  "overview": "If there is one goddess in our mythology who is feared for her Bhayankar swaroop and yet revered as a Maata, that is MAHAKAALI. However, in a culture seeped with symbolism and deeper meanings, why has a goddess been shown like this? Forever in an enraged and aggressive state, uncontrolled, untamed. What is this enigma, that we call MahaKaali? There is a saying that \"Shiva without Shakti is Shava\" which means that without the power of action (Shakti) that is Mahakaali, Shiva, the consciousness itself, is inactive. This is also the symbolic explanation for why she is standing on Shiva in a Shav state. Conversely, without the grounding of Shiv, Shakti is forever in a wild, unstable state. Like a ‘Bolt of Lightning.' That is why MahaKaali is always wild, aggressive and untamable. But then, why is this primordial SHAKTI shown in such a bhayankar state? (with dark skin, skull-garland etc.) Because Maa Kaali has a deep purpose often overlooked and scarcely understood. Mahakaali always helps us go beyond, see what we don't see. We see a lot in her that the conventions don't teach us to accept, and yet we call her MAA. We not only accept her but revere her looking beyond what we see. That's what Mahakaali does. She is the ULTIMATE DESTROYER. SHE DESTROYS LIMITATIONS. SHE DESTROYS SO WE CAN CREATE. She destroys the negative, so the positive can begin. Kyonki ye Jeevan-chakr hai… Aur Jeevan-Chakr mein… \"ANTH HI AARAMBH HAI.\" Now true to the nature of Mahakaali, her famous stories generally begin when the negativity is at its peak, so she comes in to destroy the negative and give birth to a new beginning. This story however, will also be about her personal life. Her journey from a mortal, to becoming Goddess Parvati, wife of Mahadev to becoming Mahakaali, the most feared one of them all. This will be a story about the unique love between Parvati and Mahadev. Not just about what she did, but also why she did it, and what led to that. We will discover what lead to her choosing to take the Mahakaali form. What lead to her placing her foot on her husband, her Aaradhya, Mahadev's chest and what happened once the creation found about the force that is MahaKaali. In the saga of Mahakaali, Parvati will have to be aware of her responsibility forever. She will often try to resist unleashing her MahaKaali form. But as they say: We often meet our destiny on the road we take to avoid it. MahaKaali has once been unleashed. And she will always find her way to the front. In this journey, many daemons will be slayed. We will learn about the creation and stories of Dasham-Mahavidya, the 10 forms emerging from MahaKaali. (Tara, Tripura Sundari, Bhuvaneshvari, Bhairavi, Chhinnamasta, Dhumavati, Bagalamukhi, Matangi and Kamala.) We will discover the deeper aspects of Navdurga… and Kaali's relation with the 9. (Siddhidatri, Kushmanda, Brahmacharini, Shailputri, Mahagauri, Chandraghanta, Skandmata, Katyayani and Kaalratri.) All this and the countless times that the FEMININE SHAKTI will destroy the negative to begin with the positive. MahaKaali's journey has begun… For the positive to begin the end has begun.",
  "score": 59,
  "genres": [
    "Drama",
    "Fantasy",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}