{
  "id": 39522,
  "type": "tv",
  "title": "Men, Women & Dogs",
  "releaseDate": "2001-10-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/173/434197.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/173/434197.jpg",
  "overview": "A relationship comedy about four guy friends in their twenties whose lives center around their girlfriends, their careers and their dogs - but not necessarily in that order.Jeremiah is a talented chef and consummate player with a penchant for seducing women with his irresistible charm and decadent chocolate cake. His theory is that if you can convince a girl to break her rule about skipping dessert, there are no rules left. Commitment-phobic to a fault, Jeremiah is closer to his dog Wolfgang than he has ever been to any woman.Jeremiah's best friend Clay vocally disapproves of how he objectifies women, and is mocked mercilessly for being just the opposite - a sensitive idealist nursing the wounds of his first broken heart.Easygoing surf bum Eric recently moved in with his girlfriend Michelle, who has issues about playing second fiddle to Eric's first love - his old and incontinent pooch, Betsy.Newest to the group, Royce is a study in unbridled, penny-pinching ambition that usually blows his chance at getting the girl. Royce doesn't actually have a dog; he just hangs out at the dog park holding a leash and a few scoops looking for fresh talent.More likely to know how to pamper their pets than how to treat a lady, these four friends occasionally succeed in shedding some light on each other's inadequacies and fallacies. Bound by their canine companions, the unlikely comrades fumble their way through life's little indignities on their search for love and happiness. Maybe with a little help from a dog's sixth sense and the tug of an extendable leash, they'll also learn how to meet - and, more importantly, keep - a woman for good.",
  "score": null,
  "genres": [
    "Comedy"
  ],
  "screenshots": [],
  "systemRequirements": null
}