{
  "id": 37297,
  "type": "tv",
  "title": "Marry Me",
  "releaseDate": "2004-04-21",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/159/398538.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/159/398538.jpg",
  "overview": "Marry Me is a story of how women in their thirties come to face with life and discover something new about their lives. 30 year-old spinster reporter Sin-Young was once called a \"troublemaker reporter\" but she clenched her teeth and kept digging into her work. Finally all of these efforts were rewarded with a prize for getting a scoop. As every dog has his day, she also gets hers and is offered an audition for news anchor. But again, her destiny doesn't leave her in peace and brings her the news of her long-time boyfriend's betrayal. He leaves her to marry a girl 12 years younger than Sin-Young. Soon-Ae, a 30-year-old stewardess, is the breadwinner of her family who supports her ailing father, a utterly hopeless widow aunt and another hopeless cousin. To her, her family comes first before anything else and this scares all the men away. There was one man who didn't leave her but he was only taking advantage of her company card that gives discounts to luxury goods. One day, she bumps right into her boyfriend with another woman on the very spot and in enormous rage, she beats him up. Very soon she's introduced as \"the Crazy Crew\" worldwide and she gets fired. Seung-Ri is renowned for her numerous love affairs. Hiding this splendid past, she marries a man of a plutocratic family and goes to New York. She proudly returns to Korea to give birth to her baby. Then, she shocks everyone when her baby turns out to be white. She gets kicked out from her husband's family as well as her own parents. The source of this misfortune goes back to when she tried to get back at her playboy husband by also having an affair. Though it was only a one night stand with an American guy, she now can't turn back the time. What's more, she hears that her baby died as soon as he was born. From then, she starts her life again in Seoul with her friends Sin-Young and Soon-Ae.",
  "score": null,
  "genres": [
    "Drama",
    "Family",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}