{
  "id": 38433,
  "type": "tv",
  "title": "Ultimate Ninja Challenge",
  "releaseDate": "2018-08-05",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/165/414379.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/165/414379.jpg",
  "overview": "In the brutal cold of the unforgiving Pacific Northwest wilderness, nine modern-day warriors take on a relentless, 24-day survival challenge based on the ancient laws of the Ninja. In Ultimate Ninja Challenge, eight grueling missions created by Jinichi Kawakami, the last known Ninja, will push each warrior's body, mind, and spirit to their breaking points. Those who complete the entire survival challenge will receive a final lesson from the master himself in Iga City, Japan, the legendary home of the Ninja – and prove that they can endure the Ultimate Ninja Challenge.Following in the footsteps of the ancient order, nine individuals each living their own interpretation of the life of a \"warrior\" will use their unique skills to attempt to survive challenges based on the sacred Kuji principles of the Ninja. These male and female warriors range from martial arts experts, a world-class survivalist, a UFC fighter, a veteran fireman and former military who all want to prove to themselves that they can endure any hardship when they take on the Ultimate Ninja Challenge.With limited food and water, the warriors endure harsh conditions and challenges that include trekking through a frigid swamp, surviving overnight on an icy glacier, crossing a raging river, escaping imprisonment, and more, all while enduring sleep deprivation and debilitating hunger. Failure to complete any mission will force them to leave the challenge, and only those with the strongest stamina and willpower will make it to Japan for the final challenge. This is not conventional survival – this is the Ultimate Ninja Challenge.",
  "score": null,
  "genres": [
    "Action"
  ],
  "screenshots": [],
  "systemRequirements": null
}