{
  "id": 39342,
  "type": "tv",
  "title": "The Springer Hustle",
  "releaseDate": "2007-04-15",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/376/942445.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/376/942445.jpg",
  "overview": "For 15 years, America has been riveted by the dysfunctional carnival side show that is the Jerry Springer Show. It's a show built on simple promises, like sisters dating brothers, mothers dating cousins and a transvestite hooker at the end of every marital confession. But the show on stage can be tame compared to life behind the scenes. Now, for the first time, backstage cameras capture life behind the curtain with VH1's new docu-soap, The Springer Hustle, an in-depth, insider's look at how America's most controversial television show is put together. The show focuses on the dedicated team of producers in the eye of the Springer hurricane; a tight-knit family charged with filling the show with the wildest real American stories possible. There's Selena, the beautiful and obsessively driven producer who will stop at nothing to make her shows shine. Toby, the staff clown whose recent run of bad luck has sent him into an emotional tailspin. Annette, one of the original producers who left the show for a few years, only to be drawn back by the day to day mayhem she couldn't find anywhere else. And all of them, practically working round the clock to impress their demanding boss Richard Dominick who is stingy with the compliments but loyal to the core. The Springer Show is a tough place to work. The office is far from glamorous. The daily grind of making the magic happen takes its toll. Yet, this devoted crew digs deep to present a rogues' gallery of the most outrageous people ever to sit down in front of a tv camera. At the center of it all, ringmaster Jerry Springer, the icon whose name has become synonymous with the never ending parade of human oddities we've come to know and love.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}