{
  "id": 37597,
  "type": "tv",
  "title": "The Apprentice Asia",
  "releaseDate": "2013-05-22",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/202/505767.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/202/505767.jpg",
  "overview": "Filmed in Singapore and Kuala Lumpur, this is the Asian adaptation of the US reality series. The face of the show is aviation tycoon, Tony Fernandes. 12 candidates from around Asia will vie for the honour of becoming Asia's very first Apprentice, with the winner walking away with the opportunity to work for Tony in one of his enterprises.Also on board are Mr. Fernandes' advisors – Tune Hotels' Group CEO, Mark Lankester and Expedia Asia's CEO, Kathleen Tan. AXN has searched the region for the best business entrepreneurs keen to work for Mr. Fernandes. Representing seven countries in the region (Singapore, Malaysia, China, India, Indonesia, Thailand and the Philippines), the top 12 come from an interesting myriad of backgrounds in entertainment, food &amp; beverage, hospitality, information technology and the legal and finance world. From ages 25 to 38, some are in their first jobs, some already own a thriving business where they are based; some have the gift of the gab from their years in showbiz and some have been recognized for their work in marketing and entrepreneurship in their respective countries.Throughout the season, the candidates will be tested on their skills in the areas of selling, negotiation, creativity, management, branding and leadership. At the start, the candidates are split into two teams based on gender.What makes the inaugural season of The Apprentice Asia so riveting is the drama that ensues from the onset. As can be expected when a group of extroverted, ambitious characters get together, strong wills clash, alliances are forged, and nerves are frayed during each boardroom session where one of them will go home, empty-handed. It's the survival of the fittest, and self preservation rules the day.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}