{
  "id": 30775,
  "type": "tv",
  "title": "Short Cuts to Glory: Matt Okine vs Food",
  "releaseDate": "2017-08-03",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/122/305856.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/122/305856.jpg",
  "overview": "Comedian Matt Okine visits Australia's top chefs to learn their tricks of the trade for cooking our favourite recipes. Over 10 episodes he visits the home kitchens of Australia's top chefs and food experts including Neil Perry, Jill Dupleix, Dan Hong, Christine Manfield, Colin Fassnidge, Katherine Sabbath and Stefano Manfredi.All of the guests teach Okine cooking techniques, tricks of the trade and share top tips for viewers, so whether you're a novice or a meal-making maestro, their tips will make life in the kitchen much easier.Short Cuts to Glory: Matt Okine vs Food is about bringing the café to your kitchen when you are too lazy to venture out, or impressing that special someone on a date night. It comes to the rescue when you don't know what to feed the hungry mouths in your family or when you have gone a bit too hyper on the dinner party invites. Plus, if you feel like treating yourself to something quick, simple and tasty when you are home alone or at the end of a massive day at work then this is the show for you. Starting with ‘the basics' each episode has a broad theme, others include ‘fit ‘n healthy', ‘cheap as', ‘family dinner', ‘date night' and ‘comfort food'. The recipes are intimidation free, and the easy to follow on screen instructions mean that no matter what your skills are in the kitchen you will learn quickly from the best in the business.Joining Matt in each episode is food educator and author, Alice Zaslavsky who'll be sharing her expert knowledge on everything from what to stock in your cupboards, how to slice and dice, what meat cuts should be used for what and how to keep fruit and veg fresh for as long as possible. Matt also heads out shopping to get advice on the best pans, knifes, pots, trays and a whole lot more.As a young comedian cutting his teeth on the stand-up circuit, Matt has done time on the breadline but now thanks to a few ‘proper' jobs he's splashing the cash on all things food. If he's not checking out the latest restaurant, he's at home trying to cook up a storm.",
  "score": null,
  "genres": [
    "Comedy",
    "Food"
  ],
  "screenshots": [],
  "systemRequirements": null
}