{
  "id": 30063,
  "type": "tv",
  "title": "Hero: 108",
  "releaseDate": "2010-03-01",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/119/297863.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/119/297863.jpg",
  "overview": "Many years ago in the Hidden Kingdom, animals and humans \n lived in perfect harmony until an evil trickster named HighRoller \narrived and fooled the animals into thinking humans were their enemies. \nChaos reigned in the Hidden Kingdom until Commander ApeTrully formed a \ntask force called Big Green to reunite the animals and humans while \nfighting the forces of High Roller and the Zebra Brothers.The storyline in a typical episode follows a formula, although the \nformula varies and several episodes depart from it: Commander ApeTrully \ngoes on a mission to the castle of an animal kingdom to make peace and \nask its inhabitants to join Big Green, bringing a gift of gold as a \ntoken of goodwill. The animals generally dismiss the gift, and usually \ncapture ApeTrully who calls for help from First Squad. Members of First \nSquad (usually everyone except Mr. No Hands, who does come along on \noccasion) deploy by descending through a maze of tubes and landing on \nturtles fitted with tank treads, and then are launched through a tunnel \nand out over the water. When they arrive where ApeTrully is being held, a\n battle or contest ensues, during which special talents or abilities of \nthe animals are revealed, often something based on their nature. After \nthe battle or contest, the animals usually concede to First Squad's \nskills saying through translation by ApeTruly (unless the animal rulers\n can talk) that they would be honored to join Big Green. After joining, \nthe animals often are assigned a particular duty at Big Green based on \ntheir demonstrated skills, which may help solve a problem introduced in a\n subplot.The show is very loosely based on ancient Chinese novel the Water Margin focusing on the exploits of First Squad and Second Squad.",
  "score": 76,
  "genres": [
    "Children"
  ],
  "screenshots": [],
  "systemRequirements": null
}