{
  "id": 38056,
  "type": "tv",
  "title": "Making His Band",
  "releaseDate": "2009-07-27",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/376/940676.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/376/940676.jpg",
  "overview": "Sean \"Diddy\" Combs is no stranger to the nationwide talent search. The producer/rapper/three-time Grammy Award winner has scoured the country for new and emerging artists four times on \"Making The Band\", expertly mentored the aspiring musicians into emerging superstars and created a veritable empire of burgeoning talent with hip-hop group Da Band, platinum-selling female pop group, Danity Kane, and award-winning male R&amp;B group, Day26. And on the eve of Diddy's sixth album release, the legendary rap mogul-turned-starmaker is teaming up with his talent scouts, choreographers and vocal coaches once again to welcome another new group into the Bad Boy family. Only this time, the search is personal. Diddy will be auditioning singers, drummers, guitarists, bassists and keyboardists to join him on stage and perform backup vocals and instrumentals on his \"Last Train To Paris\" tour. But the journey won't be easy. With the help of his judges (Laurie Ann Gibson, world renowned choreographer, Om'Mas Keith, producer and lyricist, Rob Lewis, songwriter to the the stars, Nisan Stewart, musical director/unofficial peacemaker, and Romeo, former vocal coach to Michael Jackson himself), Diddy will put his would-be collaborators through rounds of grueling auditions designed to weed out the wannabes from the future music legends and turn this talented team of rookies into the Bad Boy backup band of his dreams. And getting through the first cuts doesn't guarantee admission. Those who do make it through the early do-or-die rounds will still have endure scathing reviews, endless trials and constant critique in order to prove they've got the talent, drive and ambition to succeed. And although everyone will be pushed to their breaking point, only the best of the best will earn the right to share the stage with hip-hop's leading tastemaker.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}