{
  "id": 34306,
  "type": "tv",
  "title": "Amor à Vida",
  "releaseDate": "2013-05-20",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/425/1064317.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/425/1064317.jpg",
  "overview": "The plot revolves around siblings Paloma and Felix starting a dispute over the direction of a hospital that received the inheritance from his father, Caesar. Felix, as a means of reprimanding her sister will kidnap their newborn daughter and leave her in a dumpster. After losing his wife and child during childbirth, Bruno will find the baby and adopt it, recording it with his name, with the help of her eternal admirer Glauce and mother, the nurse Ordeal. Twelve years later, Paloma will find news about his daughter and will do anything to get it. She falls in love with Bruno, the man who adopted her daughter, and this novel could disrupt plans Felix. Felix is married to Edith, but it is not a gay-assumed. In the plot still see marriage stabilized Caesar with the parent Pilar be interrupted by the arrival of the new doctor's secretary, Aline, a girl unscrupulous and dubious character who will do everything to seduce the boss. In other cores still have a mother Pilar, Bernarda, a rich woman who falls for a street performer. At the core we have more tempered Marcia, an ex-chacrete who hates Rita Cadillac and trying at all costs to become rich with the help of his daughter Valdirene. Valdirene is a poor girl anyway and attempts to enrich trying to conceive of football players and pagodeiros. After all these failed attempts she will become an evangelical religion and will be a gospel singer. Another core is a butler who during the day works in family home evening and a DJ. He will relate to an older woman and later discover that she is married and a friend of his bosses.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}