{
  "id": 37396,
  "type": "tv",
  "title": "Boku dake no Madonna",
  "releaseDate": "2003-07-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/159/399011.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/159/399011.jpg",
  "overview": "Kyoichi Suzuki is an average college student in his junior year. Although he's not in one of the top universities, he's satisfied with his college life studying architecture. Kyoichi left home and is finally on his own, living in a beat-up apartment in Tokyo. However, this apartment building is home to some out-of-the-ordinary residents, who are always bugging Kyoichi. His next-door neighbor hits Kyoichi up for a loan when he finds out that Kyoichi just got paid. His other next- door neighbor who works at a nightclub, always calls Kyoichi, demanding him to come pick her up, because she's so drunk. Other than that, Kyoichi is satisfied with his normal life, until he meets a girl one day...Kyoichi comes home from his part-time job as a night-time security guard. He returns to his room to find a girl sleeping on his bed-a girl he has never seen before. She looks a bit older than Kyoichi, and is quite beautiful. Kyoichi can't believe his eyes.Kyoichi closes the door, and goes outside to the entrance of the apartment, to make sure he's in the right apartment and room. There's no mistake. He returns inside...but the girl is gone.There's nobody in his room. Was it just his imagination? Was he hallucinating? Kyoichi can't understand what just happened.Later, he discovers that something is missing from his grocery bag-the Chinese noodles he was looking forward to eating are gone...This is how Kyoichi first meets Surumi Kataoka. After they meet, Surumi continues living in Kyoichi's room.She points to an apartment visible from Kyoichi's room, and says that the guy living there dumped her for another girl. Surumi says that she's waiting to check out the girl she was dumped for. Kyoichi doesn't know if he ought to believe her or not.All Kyoichi knows is that while Surumi is such a charming girl, the expression on her face is sad at times.Kyoichi is not that disappointed about sharing his room with a cute girl. He starts to think that this lifestyle may go on forever, until one day, Surumi suddenly disappears-just like the day she suddenly appeared. All she leaves for Kyoichi are unanswered questions.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}