{
  "id": 44556,
  "type": "tv",
  "title": "HIStory3: Make Our Days Count",
  "releaseDate": "2019-10-16",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/216/540566.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/216/540566.jpg",
  "overview": "At first glance, high schoolers Xiang Hao Ting and Yu Xi Gu appear to be polar opposites: While Xiang Hao Ting is an outgoing, hot-headed extravert and some-time bully, Yu Xi Gu prefers to keep a low profile and focus on his schoolwork.They seem bound for totally different futures – the bookish Yu Xi Gu looks destined for academic success, while life is just a long popularity contest for Xiang Hao Ting. But a quirk of fate – and a crucial intervention by a female schoolmate – results in the two young men's paths crossing.But there is more to both young men than first meets the eye. Xiang Hao Ting was not always this way. He started out as a perfect student until he discovered the joys of going off the rails.And Yu Xi Gu has a reason for being so aloof and studious: His parents died in a traffic accident while he was younger, and he is being fostered by his aunt. As such, he works hard to get good grades in an effort to win a scholarship and ease the financial burden on his relatives.Yu Xi Gu also works part-time at a convenience store, where his manager Liu Zhi Gang has developed a crush on a man he has met at the gym.Back at school, meanwhile, Yu Xi Gu and Xiang Hao Ting find themselves drawn together, and passions ignite. The former notices that he has the unique ability to bring Xiang Hao Ting out of his shell – and becomes intent on melting his cold-as-ice exterior.What will happen when their two worlds collide? And can love be the catalyst that helps bring these two unlikely students together – as their high school days draw to a close?HIStory3: Make Our Days Count is a 2019 Taiwanese drama series directed by Tsai Mi Chieh. It is the latest in a continuing series of dramas – beginning with \"HIStory,\" which first aired in 2017.",
  "score": 78,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}