{
  "id": 44607,
  "type": "tv",
  "title": "Love Can't Wait",
  "releaseDate": "2006-01-02",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/216/541358.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/216/541358.jpg",
  "overview": "Does a high school senior only have to study? A naive high school girls big plan to get married! is a special love story of a high school senior at a girls school with an IQ of 98 but ranking first in looks in her school and of a poor college student studying law. Eun Min meets Tae Kyung, a college student, when she goes to the university library to run an errand for her sister. She instantly falls in love and lies to him about being a scenario writer and starts dating him. Tae-kyeong of course also falls in love with the charming Eun Min. However, Eun Min's lie doesnt last long. Eun Min and Tae Kyung meet each other again as private tutor and student… Tae Kyung tells Eun Min, who hates studying more than anything, that she should do something else if she doesnt want to go to college, and drags her to the HAJA Center. The reason she listened to him without any further worries is because she believed that he would not ask her to do something thats not right. She has faith in him. She thought that she would be able to live a different life if she were with him. Tae Kyung was the first thing that had ever been only hers. Therefore, Eun Min decides to get married to him! The marriage was her first accomplishment. The ten-million-won-leased room in the basement that the in-laws found for them has no windows. But why worry about not having a window? One can just draw windows on the wall, place a bucket under the leak in the ceiling and hold a rat-catching event with Tae Kyung in case there are rats! For some time at first, poverty was just a game for her…",
  "score": null,
  "genres": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}