{
  "id": 41710,
  "type": "tv",
  "title": "Čtvrtá hvězda",
  "releaseDate": "2014-01-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/191/478174.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/191/478174.jpg",
  "overview": "Štěpán got a job as a night receptionist in a three star Hotel Meteor on the periphery of Prague. He'd like to get along with the colleagues and not attract the attention of his superiors. But how is he supposed to do that, when he desperately falls in love with Pavlínka, who works as a day receptionist? They see each other only in the moment when the shifts change! On top of that, Pavlínka is not interested in Stepán but in the aggressive hotel maintenance man David. He is in turn interested in two things only: how has his beloved Sparta played and how to avoid the exhausting erotic interest of his superior, the ambitious hotel manager Tereza. Tereza does her best to improve the quality of the hotel and get the long-wished-for fourth star. This concern clashes with the selfishness, indolence, laziness, acquisitiveness and cunning of the subordinates. Of all the hotel employees, the fourth star is of the least interest to her ex-husband Theodor, the director of the hotel. His only interest is to perfect his skills in playing the Chinese game of mahjong. Tereza's efforts are being thwarted by the personal interests of other subordinates, too: the ambitious and treacherous cook Smutný craves the position of the chef, the melancholic chef Tichý struggles with losing his taste as a result of work accident, the day receptionist Frantisek deals with the underworld and consorts with the dangerous criminal Major, the hotel prostitute Libuska trains a junior lacrosse team, the hotel taxi driver Jindra is a gay man with a strong maternal instinct and Jirina the barmaid has a deficit.",
  "score": null,
  "genres": [
    "Drama",
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}