{
  "id": 42619,
  "type": "tv",
  "title": "Corazón Que Miente",
  "releaseDate": "2016-02-08",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/202/505307.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/202/505307.jpg",
  "overview": "Mariela Salvatierra will fight to reclaim what was malevolently stripped from her and, at one time, must choose between the stability that Leonardo offers to her and the passion she feels for Alonso, whom she has always regarded as the love of her life. She is an orphan and was only 11 when her grandfather Manuel died because of Demián Ferrer. Being left on her own, destiny pushed her to leave the country under the care of Leonardo Del Río. Leonardo has also left some unfinished business with Ferrer, who blamed him unjustly for murdering his wife, Lucía. 15 years have passed since they left, but now Mariela and Leonardo have returned to face Demián Ferrer. Mariela to avenge her grandfather, and Leonardo to clear his name. It won't be easy, though, as Demián is a fairly powerful and unscrupulous business man who doesn't even honor his own family. He disregards Santiago, his youngest son, and manipulates and deceives his oldest son, Alonso. This attitude affects Mariela too, since Alonso doesn't dare to turn his back on his father, which tinges their relationship with love and hatred at once. To make things worse, Renata, a luscious and dishonest girl, moves in to the Ferrer's home and becomes obsessed with Alonso, doing everything she can to separate him from Mariela and making her come closer to another man who is in love with her... and he is no other than Leonardo, who despite of trying hard not to see Mariela as a woman but as a ‘daughter', couldn't help falling in love with her over time, so he will make the most of her estrangement from Alonso to fight for her love. Alonso hates Leonardo ever since he saw him kissing his mother, but now their rivalry will grow bigger as both will be competing for the same woman. Nevertheless, it is Mariela who must decide carefully to avoid falling for the tricks of a Lying Heart.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}