{
  "id": 45936,
  "type": "tv",
  "title": "Say Yes to the Dress America",
  "releaseDate": "2020-01-04",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/332/831858.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/332/831858.jpg",
  "overview": "Randy Fenoli, Hayley Paige, Buddy Valastro, Lilliana Vazquez and Joe Zee will lend their talents to help 52 couples - one from every state, Washington, D.C. and Puerto Rico - tie the knot this summer in an extraordinary group wedding at a quintessential New York landmark: Central Park. Ten brides will be prominently featured throughout the 10-part series, culminating in a two-hour wedding special.A mainstay of Say Yes to the Dress, Randy Fenoli is taking on dual duties during the wedding extravaganza. In addition to overseeing the numerous dress appointments at Kleinfeld Bridal, Randy will also serve as the wedding officiant, marrying all 52 couples during the group ceremony. Fellow bridal designer Hayley Paige will take on the role of America's bridesmaid and focus on styling the brides on the day of the wedding; she also custom-designed bridal veils for the big day. The Cake Boss himself, Buddy Valastro, will create and hand deliver one of his unique and eponymous confectionary creations: a wedding cake fit for 104 newlyweds! Rounding out the wedding crew are Lilliana Vazquez, TV personality and style expert, and Joe Zee, renowned fashion stylist &amp; journalist, who will coordinate last-minute details with the brides and grooms, before serving as announcers and commentators as the brides debut their gowns during their walk down America's aisle.The 52 brides participating in Say Yes to the Dress America will represent their hometowns in a wedding experience like none other. Each bride will receive an all-expense paid trip to NYC, a private shopping event at Kleinfeld Bridal where they will be gifted a wedding gown from a curated selection and the group wedding at Central Park.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}