{
  "id": 47709,
  "type": "tv",
  "title": "Mister Maker Comes to Town",
  "releaseDate": "2010-10-25",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/254/636267.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/254/636267.jpg",
  "overview": "Mister Maker takes to the road in his magical Makermobile in search of Mini Makers.At the start of every show, Mister Maker uses various objects to make a Makermobile. He shrinks himself, then the episode starts. Tocky, the cuckoo clock, gives Mister Maker a \"mini maker message\", a child who needs help from Mister Maker. The child tells Mister Maker what they would like to do or make something out of old things. This inspires him to do something related to them. He collects the essential items from the Doodle drawers and makes them.When Mister Maker can't find what he needs, he honks the horn, summoning Scraps (a blue puppet with a scarf, a hat with straws and pipe cleaners on it, and googly eyes), who gives him what he wants. After they make it, Mister Maker tells us, \"it's brilliant being out and about in the Makermobile; there's always so much to see and do.\" Then he hears a noise, then he asks us \"What's that noise?\", then a quartet of shapes fly out and sing a silly song and dance, followed by a random shape (circle, triangle, square, or rectangle) to form a picture or find how many shapes there are.Tocky then appears on the Makervideophone for Minute Make Time, and Mister Maker goes to a place where he can make something in a minute—usually completing it just before the timer stops. Then the coloured kids ask Mister Maker from the videophone to guess what they would make with their colourful costumes.It is followed by A Big Surprise, where Mister Maker sees some kids who were not expecting him. The kids tell Mister Maker what they would like to do. Mister Maker tells the kids what they will do, which will give him an idea of what to do next. In the middle of making it, he wonders why not make a (insert thing related to what the Mini Makers are making here). The show ends with Tocky telling Mister Maker to go and then shows Mister Maker how to put the Makermobile back into the art box.",
  "score": null,
  "genres": [
    "Children"
  ],
  "screenshots": [],
  "systemRequirements": null
}