{
  "id": 40215,
  "type": "tv",
  "title": "Mr. Merman",
  "releaseDate": "2018-04-02",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/178/446732.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/178/446732.jpg",
  "overview": "Two scientists are trying to find evidence to prove that mer-people are real. The three male leads, who are all mermen, are trying to figure out whom the two scientists are and why they want to prove that mer-people are real, so they investigate. The main couple is Talay and Fahfon. There was a party on a yacht and Fahfon fell into the water and Talay jumped in to save her. While underwater he kissed her trying to breathe air into her mouth, but either way their lips touched causing a bright light kind of reaction. If a merman kisses someone on the lips, the person they kissed will turn into a mermaid. So Fahfon turns into a mermaid and Talay is in charge of her by helping her understand more about mer-people and making sure she doesn't expose their secret. Fahfon also finds out that since she was turned into a mermaid she only has a few months left until she turns into sea foam. The second couple is Payu and Pim/Khaofang. Payu and Pim were lovers, he accidentally kissed her causing her to turn into a mermaid. After some time Pim turned into seafoam, like she died/dissipated. On the day of the yacht party, Payu spotted someone who looked exactly like Pim. That person turned out to be Khaofang. Payu wanted to get closer to her and see if she's really Pim or not. Payu finds out that Khaofang is suffering from amnesia and tries to help her regain her lost memories, in hopes that she is really Pim. The third couple is Plangton and Ploysai. Out of the three male leads Plangton is the youngest. He owns a café and he's popular among the girls. Ploysai happens to be one of those girls who has her eyes on Plangton. She's older than him and makes it pretty obvious she likes him. Plangton on the other hand tries his best to not fall for her after Payu warned him. But nothing will stop Ploysai from making him fall for her.",
  "score": null,
  "genres": [
    "Drama",
    "Comedy",
    "Fantasy"
  ],
  "screenshots": [],
  "systemRequirements": null
}