{
  "id": 49431,
  "type": "tv",
  "title": "Lagardère",
  "releaseDate": "2005-04-11",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/267/667652.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/267/667652.jpg",
  "overview": "In France at the very beginning of the 18th century, Henri de Lagardère challenged Duke Philippe de Nevers to discover the secret of his famous boot, which makes him the finest blade of the kingdom of France. He loses, but Nevers, amused by this «gallant knight», cunning, funny and charming, takes him to his service. Since the Nevers and Caylus families were enemies, Duke Philippe de Nevers secretly married the beautiful Inès de Caylus, but the young woman's father later decided to marry his only daughter to Philippe de Gonzague, Nevers' own cousin, who then teaches Gonzague that the planned marriage is impossible, because Inès de Caylus is already married... to him, Nevers and he has a daughter. Gonzague then decides to get rid of his rival and Aurore de Nevers, the girl who has just been born from a secret wedding. Fearing Caylus's revenge if he were to discover the existence of his granddaughter, the Duke of Nevers decides to come and get Aurore at night to take her to his mansion. Jumping on the occasion, Gonzague and the mercenaries that Peyrolles, his damned soul, hired, attack Nevers in the ditches of Caylus Castle. Lagardère cannot prevent the murder of Nevers by his own cousin Philippe de Gonzague, but he manages to mark the hand of the masked assassin with his dagger, after which he swears to avenge the death of his friend and protect his friend's daughter, Aurore de Nevers. The young man raises Aurore in Spain with Cocardasse and Passepoil, his masters of arms, while hiding this dark story from the child. For seventeen years, Lagardère travelled throughout Europe, eliminating all mercenaries one by one. At the very end of his mission, he returns again to France and crosses the road to Gonzague, with whom he passes for a poor and old hunchback.",
  "score": null,
  "genres": [
    "Drama",
    "Adventure",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}