{
  "id": 44402,
  "type": "tv",
  "title": "Pariu cu viața",
  "releaseDate": "2011-09-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/467/1168576.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/467/1168576.jpg",
  "overview": "Pariu cu viața centers upon the love story between two teenagers Ioana Popa and Andrei Anghel whose destinies are switched at birth. Ioana and Andrei are students in their senior year at the National College of Arts. They are happily in love or at least this is what Ioana thinks until the moment she learns shes nothing but a bet Andrei made with Cristi, his best friend. What nobody knows is that Andrei has truly fallen for her. Disappointed, Ioana takes refuge in music, especially in LaLa Band, the modern music club created by the new music teacher at the college, Raluca. The 20 talented members of LaLa Band promise to insert new adrenaline into the post-Beatles music. They all have a great passion for music and big dreams to become international stars and have sold out concerts. Ioana was raised in a poor family by Gica Popa and Tantica together with her brother, Rafael and her sister, Gio. With plenty of humor and always looking for fun, the Popas live by the motto education is not important, only money matters. Andrei is a charismatic young guy who comes from a wealthy family that seems to be perfect. But the truth starts to come up when Anca, Andreis sister, is diagnosed with a severe kidney disease, inherited from Mara Anghels family. Her only chance of survival is a kidney transplant. After running the blood tests, Mara and Sandu Anghel have to face another shocking truth: Andrei is revealed as not being related to Anca or the family at all. Mara and Sandu Anghel realize their child was switched at birth in the tragic fire that occurred at the maternity hospital 17 years ago. And they begin the search of their real child the child that could save Anca's life as well as their own.",
  "score": null,
  "genres": [
    "Drama",
    "Comedy",
    "Music"
  ],
  "screenshots": [],
  "systemRequirements": null
}