{
  "id": 41536,
  "type": "tv",
  "title": "Школа экстрасенсов",
  "releaseDate": "2019-04-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/195/488616.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/195/488616.jpg",
  "overview": "\"School of Psychics\": a grand experiment of TNT Is it possible to teach superpowers and extrasensory perception? Is it possible to develop a gift in any person or should there be a predisposition to it? The TNT television channel is starting a new grandiose and unique experiment and opening the first television \"School of Psychics\"!Many people notice unusual abilities in themselves, but not everyone knows what to do with them. The gift of extrasensory perception is given from above, but its strengthening and development is a complex and closed process. The TNT television channel provides access to what is always hidden from prying eyes. In the \"School of Psychics\", people who feel psychic abilities will learn to develop them in order to stand on a par with famous clairvoyants.Two of the strongest psychics were invited as mentors to the school: the winner of the 17th season of the \"Battle,\" the mystic Swami Dashi, and the winner of the 18th season, the Alanian seer Konstantin Getsati. The mentors agreed to this experiment on one condition: the school's students must have a predisposition to superpowers. It is simply impossible to teach this subtle matter from scratch. The project will be hosted by skeptic Sergei Safronov.The mentors decided who would study at the \"School of Psychics\" and distributed the students into their teams. Now they face a difficult learning path, with lessons, master classes and exams. Each mentor has his own teaching methods and his own approach to esotericism. Every week one of the students leaves school. Which of them will reach the end, comprehend all the features of extrasensory perception and be able to compete with famous clairvoyants? Time will tell! And TNT: in the first television \"School of Psychics\".",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}