{
  "id": 42035,
  "type": "tv",
  "title": "Cuidado con el ángel",
  "releaseDate": "2008-06-09",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/194/485892.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/194/485892.jpg",
  "overview": "When Marichuy was born, her mother, believing she was dying, entrusted her baby to a priest, who took her to an orphanage. At age 14, Marichuy runs away and begins to live in the streets, doing her best to survive. Years go by and, one day, she is attacked by a drunk. This experience leaves her with a deep resentment against men, as well as terrible nightmares. Candelaria, a washer woman, takes her in and is like a mother to her. Marichuy does odd jobs to help Candelaria. One day, she has some trouble that lands her in court, where her own father happens to be the judge (though neither of them is aware of this). She is defended by a psychoanalyst, Juan Miguel San Roman. Marichuy is released into Juan Miguel's custody and he arranges for her to stay in his house. Juan Miguel is a widower. His mother-in-law makes Marichuy feel totally unwelcome, and to avoid problems, Juan Miguel finds her a new home with the Judge, Patricio Velarde, and his wife Cecilia (Marichuy's parents), who have also taken in Estefania, a cunning young woman who showed up claiming to be the daughter they abandoned. Juan Miguel and Marichuy fall in love and get married. However, the morning after the wedding, she discovers something about Juan Miguel's past, a secret that makes her leave him and refuse to ever see him again. Later, when she finds out that she is pregnant, she does not tell him. Instead, she leaves the city with Candelaria and ends up at the hacienda of a man called \"El Leopardo\" (the Leopard), who takes her in and falls in love with her. Marichuy gives birth and El Leopardo is willing to marry her and give the child his name. But she tells him that she is married, and cares for him only as a friend. Leopardo is not discouraged and slowly begins to win over her heart. Later on, he learns that Marichuy's husband is Juan Miguel, whom he has known since they were classmates. Both men will vie for Marichuy's love, but for her, the decision will not be an easy one to make. Marichuy's sweetness and beauty remind us of an angel, and there are those who might think that she will be easy to destroy. But they forget that an angel can defeat the devil himself. So... Don't mess with an Angel!",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}