{
  "id": 46978,
  "type": "tv",
  "title": "El amor no es como lo pintan",
  "releaseDate": "2000-08-28",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/248/622431.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/248/622431.jpg",
  "overview": "Alicia Ramírez is a young university student who lives very happily with her father Gerardo, her grandmother María Elena \"Mamá Nena\" and her little brother Juanito. Furthermore, she is the best student of her career. However, he has to deal with a big problem, his physical appearance.When Alicia decides to look for a job in different advertising agencies, she is rejected by the bosses, simply because she is ugly, despite having a great preparation. The same thing happens in Segovia, Segovia , where Alberto, the youngest son of Rolando Segovia, owner of the agency, does not want to hire her for the same reason. However, Rolando believes that Alicia has a great preparation and decides to hire her, regardless of the opinion of her son.In this story Rolando's older son and Alberto's brother, the dreamer César, also appears, who along with Javier, his best friend, try to succeed in the film business. César uses the stage name of Felipe Sabatié, as a tribute to his maternal grandfather. César is constantly harassed by his girlfriend Marisela, whom he plans to leave behind by a young woman he meets in a chat.César and his friend are movie fans, for that reason they call each other \"Cinefilo\" and \"Cinefila\", respectively, in the chat. César does not suspect that the \"Cinefila\" is actually Alicia and when she discovers that he is \"Cinefilo\" he is afraid that he will reject her for her appearance.Alicia reveals her identity to César and although at first she doesn't like the idea, she decides to give Alicia a chance. However, both will have to face the evils of Marisela, who plans to separate them to stay with Caesar. In addition, Alicia will have to endure Alberto's humiliations at the agency, but above all, she will have to deal with César and Alberto's mother, the ambitious Dunia, who believes that Alicia is the lover of her husband Rolando.",
  "score": null,
  "genres": [
    "Drama"
  ],
  "screenshots": [],
  "systemRequirements": null
}