{
  "id": 47763,
  "type": "tv",
  "title": "Race to Victory",
  "releaseDate": "2020-05-08",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/482/1206591.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/482/1206591.jpg",
  "overview": "The new six-part documentary series reveals how and why the central alliance between Great Britain, the United States and The Soviet Union was formed leading into World War II. The series paints an in-depth picture of the race to ultimate victory and post-war supremacy, concluding with VE day on 8th May 1945.  Race to Victory homes in on the personal battles between wartime leaders Winston Churchill, Franklin D. Roosevelt and Joseph Stalin, and illuminates the behind-the-scenes battles fought between the men – the war behind the war. The trio manoeuvred and grappled to exert their will over one another, to win the conflict on their terms and impose their competing ideologies on what was left of Europe. This relationship between the three leaders was, despite their allied opposition to Adolf Hitler's Nazi Germany, marked from the beginning by deception, suspicion and mistrust. World War II and its aftermath were shaped away from the battlefields, behind closed doors by a small number of men who could just as easily have been enemies based on their conflicting ideologies and beliefs.  Featuring former Head of the British Army, General Sir Michael Jackson, the series focuses on the critical moments and locations where World War II was won and lost. It was not only a race to defeat the fascist Axis Powers, but also to gain territory, to create alliances and to win the right to shape the post-war world. Each episode begins with a decisive moment in the war – sometimes a great victory, such as El Alamein and Stalingrad, sometimes a moment of horror or shame, such as the attack on Pearl Harbor or the massacre at Katyn – and then back-tracks to explore who was responsible, who rushed to take the credit and who managed to escape the blame. Expert interviews with today's historians, military personnel and political figures give the series a contemporary relevance. ",
  "score": null,
  "genres": [
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}