{
  "id": 45380,
  "type": "tv",
  "title": "Team Alpin",
  "releaseDate": "2018-11-01",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/230/576857.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/230/576857.jpg",
  "overview": "Adventure Mountains - Adventure Friendship: \"Team Alpin\" tells of unique mountain experiences and at the same time places the success of cohesion in the center. This is not about breaking records or storming one summit after another, but about overcoming your own limitations. Because mountains and nature are experienced as a challenge and enrichment. The three friends Martina, Uli and Rupert know about the power of nature and mountains. Already in their youth, they were out in every free minute, climbed, flown with dragons or bicycled down the trails with their bikes. Their paths had separated, but now all three meet again in their old home together. From an encounter with a visually impaired person, the idea of founding an alpine school arises, which individually meets the special wishes and needs of the customers. Thus, the outdoor event is an experience of its own kind, because it does not depend primarily on technical skills, but above all on teamwork. Outdoor activities are impressively staged and make you want mountains, nature and new experiences. Mountain biking, paragliding, rafting, climbing, snowboarding - the variety of mountain sports makes it possible to make new experiences with yourself. It takes courage to plunge into the depths and it takes courage to face his fears, conflicts and abysses. This is what the stories tell. Johanna von Gutzeit as Martina, Daniel Fritz as Uli and Daniel Gawlowski as his brother Rupert embody the three youth friends with power and great authenticity. Their friendship is extraordinary, because it is enduring and it carries each one individually - even over crises. They are a real \"Team Alpin\"",
  "score": null,
  "genres": [
    "Action",
    "Adventure"
  ],
  "screenshots": [],
  "systemRequirements": null
}