{
  "id": 59259,
  "type": "tv",
  "title": "The Eclipse",
  "releaseDate": "2022-08-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/417/1043466.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/417/1043466.jpg",
  "overview": "The Eclipse tells the story of the rule keeper who feels shaken by the rule breaker.Everything happens inside the walls of Suppalo School, the country's leading all-boys secondary school with highly strict discipline. There is even a rumor that students who break school regulations will be cursed and the curse gets more severe as a solar eclipse approaches...When there are rules, there are rule breakers. A group of students calling themselves \"The World Remembers\" unite with the idea that they will not follow obsolete school regulations and protest for their rights and justice. Akk, the student head prefect and the school's ideal kid, along with his fellow prefects Kanlong and Wasuwat, must constantly deal with these protesters. Then there is Ayan, a new student who seems to carry secrets with him everywhere he goes and regularly challenges the school norms. Akk, no doubt, needs to keep an eye on him. Ayan enrolls at this institution in the hopes of discovering why his uncle Dika committed suicide. His uncle's old journal, which claims the reason for his death was someone from this school, is the only evidence he has. Ayanis aware that he is being watched by Akk and always annoys him back. The two of them become close without realizing it. After spending a lot of time together, Akk develops a secret crush on Ayan but he keeps denying his feelings for this new student. However, when Ayan becomes especially close to Thuaphu, the school's top student, Akk gets jealous. Akk's crush on Ayan combines with curiosity. He notices Ayan has an old journal that he refuses to let anyone touch. Akkattempts to take the notebook in order to discover whyAyanhas joined his school and reports it to Chadok, the headmaster who instructs him to keep a close watch on Ayan. Despite the fact that all of the teachers are dissatisfied with their wayward kids, there is Sani, a visionary teacher who assists her students only from afar because she does not have enough power at school. Time passes. The students begin to doubt the curse and investigate who is causing the chaos in order to scare them away from breaching the rules. Every day, the protest becomes more intense. How will the relationship between Akk and Ayan play out? What is the truth behind the curse?",
  "score": 71,
  "genres": [
    "Drama",
    "Romance",
    "Supernatural"
  ],
  "screenshots": [],
  "systemRequirements": null
}