{
  "id": 53146,
  "type": "tv",
  "title": "Can't Get You Out of My Head",
  "releaseDate": "2021-02-11",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/331/828497.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/331/828497.jpg",
  "overview": "We are living through strange days.Across Britain, Europe and America societies have become split and polarised not just in politics but across the whole culture. There is anger at the inequality and the ever growing corruption - and a widespread distrust of the elites.And into this has come the pandemic that has brutally dramatised those divisions.But despite the chaos there is a paralysis - a sense that no one knows how to escape from this.This new series of films by Adam Curtis tell the story of how we got to this place. And why both those in power - and we - find it so difficult to move on.The films trace different forces across the world that have led to now, not just in the West, but in China and Russia as well.It covers a wide range - including the strange roots of modern conspiracy theories, the history of China, opium and opiods, the history of Artificial Intelligence, melancholy over the loss of empire and, love and power. And whether modern culture, despite its radicalism, is really part of the new system of power.And the films are told in a different way - they are an emotional history of what went on inside the heads of all kinds of people.Because in the age of the individual - what you felt and what you wanted and what you dreamed of were going to become the driving force across the world.What was forgotten in that age was that much of what we feel is also formed by the society around us. Above all by the power structures.And now those structures are decaying - everywhere - their weakness and uncertainty makes us feel empty and frightened of the future.That is what is paralysing us - and blocking us from imagining different kinds of societies and a better futureCan't Get You Out of My Head is an epic history that shows how and why that happened. How we made this particular world. And that it was not inevitable.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}