{
  "id": 52218,
  "type": "tv",
  "title": "F4 Thailand: Boys Over Flowers",
  "releaseDate": "2021-12-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/380/950424.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/380/950424.jpg",
  "overview": "F4 Thailand: Boys Over Flowers is a retelling of the classic story of a typical girl whose brain puts her in the prestigious school where the charismatic and influential leader of the school biggest bully group, F4, marks her as a target of his mean pranks. Her simple and quiet life will be turned upside down forever, and she may have fallen for him just a little bit. Gorya is a typical high school girl who works part time at a flower shop with her best friend Kaning to support her family's impoverished situation. And it seems her life is as simple and regular as that, until she passes the entrance exam of a prestigious, crazy expensive high school, turning her into the family's only hope out of poverty. But the elite high school life, to Gorya, is simply artificial and absolutely annoying. And for that, she decides she will be the most unremarkable nobody, an aspiration no one in this whole school strives to ever be.At this school, Thyme, Ren, Kavin, and MJ make up the notorious senior group known by the name F4. These handsome boys are heirs to the country's richest billionaires, and they sparkle with looks and influences. All eyes are on them at all times, even if these guys are secretly the school's biggest bullies who are ready to shove anyone they don't like around through aggressive pranks they call \"receiving the Red Card\". Nobody can stop them, worse still, the students even look up to them and their arrogance. It is as if the whole world is in the palm of their hands, and Gorya despises them for it.But as luck would have it, Gorya ends up getting involved with them. First, there is Thyme whose attention she somehow draws and with it come the mean pranks. And then there is Ren, the quiet charming member of the group that makes Gorya fall desperately in love with. Soon enough, Gorya will be at the centre of everything that happens. It's an entirely different world from her own that makes her realise just how difficult teenage life is. And it would have been easier, had Ren not fallen for Mira, a kind, well-to-do, beautiful older woman, that someone like Gorya can never compare to. It would have been easier, had Kaning not fallen for a player like Kavin who thinks every woman is just his plaything, let alone falls for someone as plain as Kaning. It would have been easier, had Thyme not been expected to an unrealistic standard by Rosarin, a strong businesswoman and his own mother, who will never let Thyme stray from the path she's laid for him, especially the path of love. But even despite all that, and oblivious of herself, Gorya slowly comes to develop feelings for Thyme.If youth is the brightest years of life, then this small girl is about to step into the most dazzling spotlight of a teenage life among the most striking guys. There will be obstacles to overcome, mistakes to make, friendships to form, encouragement, happiness, and bitterness to share. There will also be love, and the process of learning to accept it, before they all step into the real world called adulthood.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}