{
  "id": 58696,
  "type": "tv",
  "title": "Alguien te mira",
  "releaseDate": "2010-11-01",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/371/927851.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/371/927851.jpg",
  "overview": "Chicago (2005) Rodrigo Quintana, Piedad Estévez, Julián García and Benjamín Morandé are \"inseparable friends\". They all are idealists, studying medicine and dreaming of working together. Rodrigo is the most intelligent and has the most charm. He is the natural leader of the group. Because of his personality, Piedad falls in love with him. They share their lives and are passionately in love. In the meantime, Julián loves her silently but the rough life of Quintana and his drug and alcohol addiction end up breaking his relationship with Piedad. His actions take him to a point where he disappeared from his friends' lives after an incident that leaves a dead body and Piedad in a hospital room. After this incident Piedad was never the same person. Rodrigo Quintana left his friends and his studies to enter a rehabilitation clinic outside Chicago. Chicago (2010) Five years later, while Quintana opted for a good lifestyle in a rural clinic, his friends are partners in a plastic surgery clinic and have made a small fortune as plastic surgeons of well-to-do clients. Just when Benjamín, Julián and Piedad had forgotten about the past, the three doctors find out about Rodrigo Quintana's return after years in Europe. His return affects everyone's lives and breaks Piedad's daily routine, while realizing that Rodrigo is still the love of her life. Benjamín lives together with his wife Tatiana and her sister Camila (who also has a student apartment) and has two kids. Julián — divorced for a year from Matilde - becomes interested in Piedad again. However, he fears that the story could repeat all over again if Rodrigo takes away the love of his life. Piedad, Rodrigo and Piedad reconnect and she eventually becomes pregnant. Unfortunately, Rodrigo's addiction begins again. ",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}