{
  "id": 57373,
  "type": "tv",
  "title": "Muhammad Ali",
  "releaseDate": "2021-09-19",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/354/886659.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/354/886659.jpg",
  "overview": "Muhammad Ali was one of the best-known men of the 20th Century. This three-time heavyweight boxing champion captivated millions of fans throughout the world with his mesmerizing combination of speed, grace, and power in the ring and charm and playful boasting outside of it. At the height of his fame, he took American life—the racial prejudices, the religious biases, the role of celebrities, the role of sports in society—and refashioned it in his own image. Ali insisted on being himself unconditionally and became a global icon and inspiration to people everywhere.His brazen outspokenness and unsurpassed boxing skills made him a heroic symbol of black masculinity to African Americans across the country. Yet, at times he seemed to take pride in humiliating his black opponents. In an age of sit-ins and freedom rides aimed at ending segregation, his deep ties to the Nation of Islam, a black nationalist organization that preached separation, made him, for a time, among the most feared and reviled men in the country. At the peak of his ability, he bravely sacrificed his career by refusing to go to war in Vietnam – and though he was condemned for it, Muhammad Ali would later be celebrated as a principled pacifist.He was a faithful Muslim, an unfaithful husband, a proud father, and an adoring son. He was a fearsome warrior who vanquished nearly every opponent but was finally brought down by his stubborn refusal to quit. After boxing, when Parkinson's Syndrome had all but silenced him, he became an international hero, a saint, a symbol of freedom and courage. Today he is one of the most indelible and beloved men in history.",
  "score": null,
  "genres": [
    "Sports"
  ],
  "screenshots": [],
  "systemRequirements": null
}