{
  "id": 59252,
  "type": "tv",
  "title": "UMG",
  "releaseDate": "2023-03-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/448/1122307.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/448/1122307.jpg",
  "overview": "In UMG: Unidentified Mysterious Girlfriend a childhood girlfriend returns after being missing for 8 years, and there is something different about her. Mew, a boy who aspires to be an astronaut, finds his first love in Erng, his best friend. Erng, like Mew, is an odd girl with no other friends. They are always joined at the hip and do everything together, even establishing their own ‘secret base' in the woods. However, their childhood fun comes to an abrupt end when Erng vanishes without a trace.Eight years later, Mew is now a university student. He, still overcome with guilt, blames himself for Erng's disappearance. He has no social life because he is waiting for Erng to return. Jack, his childhood bully, is his only friend. One day, because of the faculty advisor, Mr. Kit, Mew and Jack join the \"Mystery Exploration Club\". Here, Mew meets new friends like O, a senior whose hobby is hunting monsters, and Fahsai, a beautiful girl who believes in the existence of extraterrestrial life. Mew begins to open up to new friends and the possibility of new love in this bizarre club... when, despite having been missing for 8 years, Erng suddenly reappears!The return of Erng is riddled with mysteries. Although she remembers Mew, she has no recollection of her disappearance. She also appears to have superhuman abilities. Oddities continue as 42, a mysterious alien creature, arrives in search of Erng! It's time for the Mystery Exploration Club members to band together and discover the truth. Is Erng, who reappears, the same person as Mew's first love, who vanished 8 years ago? Find out in UMG: Unidentified Mysterious Girlfriend.",
  "score": null,
  "genres": [
    "Romance",
    "Science-Fiction",
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}