{
  "id": 54606,
  "type": "tv",
  "title": "Life Coach",
  "releaseDate": "2021-03-10",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/304/761578.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/304/761578.jpg",
  "overview": "\"Ai or Irada\", an online seller who was successful from her own effort, only one thing that fell her was her boyfriend \"Fin\" who dreamed to be a superstar but had never been successful. After on-line market became highly competition and her online business was not good as before, Ai then decided to go for a course with Venus, a life coach who is the owner of the Daosuk Life Coach Academy. One day on the road to the institute, her bag was snatched. However, Chawin coincidentally came in time and was safe her from the robber. Since then both became a good friend. Ai registered to learn with Coach Venus at Daosuk Life Coach Academy. She had so much hope and faith in Venus. Little did she know that Venus operated life coach business as a cover for her scamming business. Later on, Venus met Fin and she liked him. Venus and Fin had secret affairs and she used her connection to help Fin to follow his dream to be an actor. On the other hand, Venus invited Ai to invest in new supplement business with Nont, Venus' assistant, and Chernkwan, a famous model. But Ai had no idea that the supplement used hazardous ingredients. Ai later found out that Fin and Venus had a secret relationship, she was heart-broken and slapped on Venus's face. Someone took the video and posted on social, many people blamed Irada and this effected to her business including supplement food. Venus left all responsibilities to Nont while Ai was very angry at Venus and Fin. She decided to cooperate with Chawin and Nont to disclose Venus's conspiracy until finally made her in jail. Ai and Chawin later became couple, they both supported each other businesses and lived happily together.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}