{
  "id": 52219,
  "type": "tv",
  "title": "46 Days",
  "releaseDate": "2021-07-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/562/1405634.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/562/1405634.jpg",
  "overview": "The series tells the story of \"Ying Ying\", an unpopular net idol who is about to seriously go down on her luck after being accidentally yet detrimentally caught a liar by her fans from a single video clip. She almost ends up with no more way to earn a living, so she tries all the ways to survive during the economic recession. Whenever she is about to start something new, her bad reputation haunts her like a life-long sin. Apart from helping herself to survive, she also needs to help her friend since \"Ying Ying\" is like a pillar of life for \"Noina\" who has been her best friend since they are young. Plus, she is now the creditor of Ying Ying who owns her debts. Their lives are encountering another change again when \"Noina\" meets her dream guy \"Doctor Korn\" who is flawlessly perfect with a handsome face and a great career life. An order from the heaven has been sent to \"Noina\" when she is whispered by a fortuneteller that she's definitely going to get married this year. Looking around, she finds \"Doctor Korn\" the one and only person who is suitable for her. The only problem is that in the next 46 days, \"Doctor Korn\" is going to get married to his well-known high-class girlfriend, \"Wisa\", a princess-like celebrity who treasures the numbers of views and her subscribers as much as the red blood cells that are nourishing her body. Both of them are better together! But it seems that this love can't be stopped because \"Ying Ying\" and \"Noina\" secretly find out that this fake bride - to - be is hiding a mystery behind. The mission to protect a good guy while setting him free from the devil-like bride to finally end up with an angel instead is ready to start. \"Ying Ying's\" bet is to be entirely free from all the debts she owns \"Noina\" without paying any money if the mission is successfully completed. However, there's not much time left while another obstacle, \"Doctor Phat\", Doctor Korn's close friend also shows up, suspiciously keeping his eyes on both girls in every move. Stay tuned to see whether this 46-day mission will successfully ruin the wedding in the end. Who is going to be caught lying!?",
  "score": null,
  "genres": [
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}