{
  "id": 56273,
  "type": "tv",
  "title": "Irresistible",
  "releaseDate": "2021-10-04",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/358/897479.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/358/897479.jpg",
  "overview": "Get ready for the ultimate thrill from GMMTV's latest drama series Irresistible starring Thanat ‘Lee' Loekhunnasombat and Sushar ‘Aom' Manaying. The drama depicts a story of a man taking revenge on the woman he used to love dearly and her brother to bring justice for the suspicious death of his sister. One year ago, Kimhan found the body of his sister, Wimonrat at her home. There was a gun wound on her body. Tada, Wimonrat's husband, was the killer. He staged the murder scene as suicide and ran away. Kimhan was devastated by his sister's death. He knew that Wimonrat was often arguing with Tada before her death. He was suspicious that Tada might be involved with his sister's death. But Tada strongly denied the allegation. Mookrin, Tada's sister and Kimhan's girlfriend, insisted that her brother was with her and he had nothing to do with Wimonrat's death. However, Kimhan believed that Mookrin was covering up for her brother's crime. So he planned to bring justice to his sister by taking revenge on Tada and Mookrin, the woman whom he loved the most but she hurt him badly.One year later, guests at the wedding of Kimhan and Mookrin witness an unexpected event when the bride appeared on the altar is Paktra, instead of Mookrin. Tada is furious that Kimhan is embarrassing his sister in front of everyone. Kimhan doesn't care and announces that this is the beginning of his revenge on Tada whom he believes to be the cause of his sister's death. How will Kimhan's revenge end? Will Tada's crime be revealed? Will Kimhan and Mookrin be able to overcome the resentment standing between their love? Find out in the Irresistible drama series.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}