{
  "id": 54988,
  "type": "tv",
  "title": "Záhada hlavolamu",
  "releaseDate": "1969-12-24",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/310/777159.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/310/777159.jpg",
  "overview": "Zahada hlavolamu (Mystery of the Conundrum) is one of the best Czech TV series for children and teenagers from the sixties. It is based on the novel of Jaroslav Foglar, legendary author of books for young boys and scout, whose books were forbidden for most of the communistic totality in Czechoslovakia. This TV series was also forbidden in seventies and eighties. Jaroslav Foglar wrote many books about the friendship, the truth, the adolescence. The most famous one is Zahada hlavolamu with the boy heroes - boy club Rychle Sipy (the Fast Arrows). These brave and clever boys really existed and Foglar realized many - both funny and serious - adventures in a form of comics. Zahada hlavolamu tells the fascinating story of the looking for the metal conundrum which contains a plan for \"flying bicycle\" by Jan Tleskac, young inventor. All the plot takes place in mysterious quarter Stinadla where the teenage boys call themselves \"Vontove\" (Vonts). They have their leader (the Great Vont), accurate structure and many rituals. The sign of the Great Vont is the conundrum called Jezek v kleci (the Caltrop in Cage), but it's in the hands of the phantom Sirokko. Rychle Sipy are not Vonts, but they are interesting in the mysteries of these events and try to help. Performances of children actors are great. They act very convincingly. The stylization of Stinadla is incredible and is emphasized by the black and white character of film. It is a place of shadows, dark walls, never-ending evening... Music of Jiri Sust in this film is the great work of this composer. ",
  "score": null,
  "genres": [
    "Adventure",
    "Family",
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}