{
  "id": 58204,
  "type": "tv",
  "title": "Oh! My Sunshine Night",
  "releaseDate": "2022-07-04",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/363/909950.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/363/909950.jpg",
  "overview": "The story of two brothers Rain and Kim, sons of Kacha and Oranee, from Kannakoon family—A family of one of the top real estate companies in Thailand. Rain, the older brother, a 4th year university student who excels in music and sports, along with amiable attitude which makes him beloved by many, unlike his younger brother, Kim. Kim is a 3rd year university student—who is quiet and reclusive—with passion for music, especially cello, and a dream to perform with his favorite artist. He also cherishes his childhood memory close to his heart. Also, there's Payoo, who's the same age as Rain. He's the only son of Butler Santi who serves Kannakoon household. Payoo is like a friend and bodyguard of both siblings since they grew up together with great deal of understanding one another, but Payoo is considered a misfit, for he's in a lower social class. However, Kannakoon family always takes good care of Payoo. Kim's world has changed since he met Sun, Rain's code-brother, who just transferred into this university at 3rd year. Sun is optimistic, lovely, amiable, and attentive to details. He practices playing guitar because he wants to get closed to what he loves. Sun was born with unfortunate coronary artery disease which makes his heart weak. Sun's parents had to give Sun to their cousins according to fortune-teller advice because they already had lost two kids when both kids were only two months old. That's why they chose to believe that advice, so that Sun could survive, and they had to leave Sun in Thailand and went abroad. Miraculously, Sun grew up well—although not that strong, he survives. Sun must undergo continuous treatment and needs to consume substance in apples to stimulate his treatment effect, along with cherished childhood memories that keep him alive. Sun tried to join the university classical band, but he missed the audition, and that made him disappointed in himself. Prof. Wannasingh then gave him another chance, and Sun passed the audition. Rain likes Sun's naïve and cute personality, so Rain always watch Sun from afar until the day of code-family gathering. Rain believes that Sun's quirkiness can change Kim and that Sun can take of Kim for him. As if stars aligned, Sun got to be a guitarist in classical band and practice together with Kim and develop some feelings towards Kim deep inside, but Kim put up a wall against this relationship. It's a story of fate and relationship between university students that is not easy between Kim and Sun. While their relationship is going great from being in the same band, Pie and Petch from fencing club started entangling in and it became a mess, and that made Oh—a friend in fencing club—needed to always help. Meanwhile, in the rugby club that Rain is a captain, Shun—who is a friend of Sun—joined the club as a staff and substitute. He's like a class clown of the club. Moreover, Baibua—a beautiful friend of Kim—falls in love with Payoo while complicating matters along with group of friends like Tony, Toy, and Euro. When Kannakoon family business had to face with a problem with partnership, nothing would be unforgettable without this unprecedented incident. What's worse is that Kim is in danger from the accident involved in his family problem. Believing that there must be a mastermind behind this, Butler Santi makes Payoo take Kim to hide in safehouse in valley where no one can easily access to protect Kim from lurking danger. Kim must live there alone with Payoo as a guardian. To make matters worse, Kim is about to lose his memories which he cherishes the most because it treasures all his good feelings. When life's already hard, revenge begins in Kannakoon family. While Kim is losing his memories in the blowing winter breeze, Sun tries his best to find Kim. Can Sun bring everything back to normal? How can revenge of Kannakoon family be stopped? That's what every character must go through, no matter how destiny will guide them… \"A moment of happiness in beautiful memory\" ….Good feeling will develop or fade away When the loneliness of winter breeze comes in…",
  "score": 77,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}