{
  "id": 59271,
  "type": "tv",
  "title": "Devil Sister",
  "releaseDate": "2022-04-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/402/1007273.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/402/1007273.jpg",
  "overview": "Irin, the it girl running Bannasorn Publishing House, is crowned \"the devil\" for her tempestuous and fearless demeanor. But what nobody knows is that it is all an act. The truth is Irin only puts up a mean front just so her 7-year-younger little sister, Inn, could stand out more and be adored by all. But no matter how well Irin puts on such a cattish act, she can never stop her younger next-door neighbor Namchafrom falling in love with her. In fact, Irin and Namcha used to date when they were students, but for some reason, Irin broke things off without an explanation and devastated Namcha in the process. Namcha is now a veterinarian working in a hospital, and since he's never forgotten his first love, he's ready to do whatever it takes this time around to get back together with the love of his life. Since Irin won't believe he is still in love with her, Namcha makes it his mission to prove her wrong. Unfortunately for them, this second chance at love is somehow full of obstacles because Inn has also been in love with Namcha for a long time and is working with none other than their family's lawyer Jinto sabotage her sister's relationship. Jin himself, through some elaborate schemes, is working to gain the trust of both Irin and her grandfather to take care of the family. And then comes Ploychan, the owner of a dog farm who's helping Namcha and his hospital with an ulterior motive by using her dog, Action, as a go-between man. Love should come easy for the two of them, but family, work, and even friends all seem to tear them apart. How will this love be for Irin and Namcha?",
  "score": null,
  "genres": [
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}