{
  "id": 50012,
  "type": "tv",
  "title": "Further Back in Time for Dinner",
  "releaseDate": "2020-09-01",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/445/1113205.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/445/1113205.jpg",
  "overview": "What happens when you take an ordinary 2020 family back in time 120 years to immerse themselves in five decades of Australian history? Over five episodes, join Annabel Crabb as she guides the Ferrone family back through history as they cook, eat, and live, from Australia's Federation (1901) to the 1940s.In 2018, Australia fell in love with the brave Ferrone family, who've returned to take on the time-travelling challenge once again. Peter, Carol, Julian, Sienna and Olivia, have already discovered the trials and joys of living through 60 years of Australian history from the 1950s right through to the present day and beyond in the hit series Back in Time for Dinner.Now, this average family of five, who are all comfortably accustomed to the perks of a very modern world, are back and have to source, cook and eat their way ‘Further Back in Time' – through a plague, a pandemic, two World Wars and the Great Depression. The Ferrones will encounter many parallels in history that we are currently experiencing in 2020.Along the way, the family will also meet remarkable people who have fascinating tales of the times or have played a part in our food revolution. Among the surprise guests at the dinner table are beloved cook Maggie Beer, former Foreign Minister Julie Bishop, our favourite green thumb Costa Georgiadis, historian and author Dr Clare Wright and comedian Steph Tisdell.With the visually compelling transformation of a house built in the 1900s, and extraordinary archival material, Further Back in Time for Dinner is rich with the pleasure of discovery as well as the gob-smacking disbelief at how we lived our lives as a fledgling nation. Further Back in Time for Dinner helps us understand our world today by looking into the past.",
  "score": null,
  "genres": [
    "Food",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}