{
  "id": 52234,
  "type": "tv",
  "title": "Baker Boys",
  "releaseDate": "2021-11-24",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/374/936537.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/374/936537.jpg",
  "overview": "Weir is a young handsome baker who constantly has bakery customers and owners fighting over him. When he loses his job yet again because of his charm, he applies to work at Sweet Day, a new luxurious pastry shop owned by Punn, a troublemaker son of a top billionaire. Punn has a past that makes him unable to eat sweets.  He only opens a bakery to surround himself with girl customers.Upon seeing Weir's profile, Punn hires him right away. But there's one big problem - Weir is scared of girls! Punn reluctantly hires Krathing, a former rising boxing star who has retired due to a medical condition, for help. Punn doesn't really like a nuisance like Krathing, but he has to give in because Krathing's great sense of taste for sweets is just what Weir is looking for.While Sweet Day starts attracting more customers, the shop faces bad reputation from news about a child's kidnapping. Apparently, the only evidence left by the kidnapper is a Sweet Day packaging. Famous online journalist Monetsnoops around the shop, as she believes the kidnapper is there. Monet finds a suspect wearing black sunglasses lurking in front of the shop, but he turns out to be Pooh, Punn's scary-looking but shy bodyguard who is there to keep watch and look after his young master. Later, Punn has no choice but to make Pooh his waiter to prevent any more misunderstanding.That's the beginning of their chaotic running of the bakery shop and mission to crack the case. They have to face many problems along the way, both work-related and matters of the heart. How will their messy relationship unfold? Tune in and root for them.",
  "score": 66,
  "genres": [
    "Drama",
    "Romance",
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}