{
  "id": 52370,
  "type": "tv",
  "title": "Nothing But Thirty",
  "releaseDate": "2020-07-17",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/491/1228269.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/491/1228269.jpg",
  "overview": "Three successful women – Wang Man Ni (Maggie Jiang), Gu Jia (Tong Yao), and Zhong Xiao Qin (Mao Xiao Tong) – experience a turbulent start to their thirties. Wang Man Ni has had a successful career so far – and hopes to enter into a marriage that will prove every bit as successful.   But after meeting a man she thinks will be her perfect match on a cruise, she discovers that he does not believe in marriage. Worse still, she discovers that she is not the only woman in his heart – he has a girlfriend of seven years, too! Meanwhile, Gu Jia was once happy to take a backseat role, playing the unseen hand and carefully guiding the career of her socially awkward and somewhat geeky husband. Her efforts paid dividends, with her spouse becoming his company's CEO. However, in an unexpected turn, her husband suddenly becomes involved with another woman. Will her happy home be broken up? Or will she find a solution to this nasty conundrum? Meanwhile, life is very different for the more carefree Zhong Xiao Qin. She is married to a faithful husband who works in a steady job. She also has a middling career.   After her divorce, she spends her free time writing novels.   She expects that nothing will ever come of her writing, which is basically little more than a hobby for her. But one day, the unthinkable happens – a book company comes across her manuscripts and offers a huge sum for the right to publish her work. Can the trio resolve their life and love dilemmas as the going gets tough? Nothing But Thirty is a 2020 Chinese drama series that was produced by Chen Fei and Xu Xiao Ou.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}