{
  "id": 54605,
  "type": "tv",
  "title": "Dong Phaya Yen",
  "releaseDate": "2021-02-03",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/304/761564.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/304/761564.jpg",
  "overview": "Phaya Yen is a mysterious jungle where many bandits assembled. This place has a story: in the deepest parts of the jungle, there's a deserted town where is full of golden treasure hidden named ‘Kwangtaburi'. Up until now, no one steps inside due to fear of mystery, fierce creatures and wicked bandits. And so the adventure story of Petch Phayaprai began. He came here just to seek for his father who got lost in this jungle and never returned. He studied the route to get inside and believed that his father might have gotten lost somewhere in Kwangtaburi. There he met a mysterious lady Sroi and grandmother Thong (who hid the secret that she could turn into a magic tiger), and saved them from their opponents. Petch later took them back to the village, without knowing that they were not just ordinary people. Robbery cases happened day by day in Phaya Yen jungle, making this place very dangerous. Deputy Jerd was assigned to beat all bandits but he got spelled by a creature and disappeared, leading to his arrogant daughter Chan and her fiancé Tadthep came to find him. They asked many guides to lead the way into the jungle but only Petch agreed to do this task, with the goal to find his own father as well. Along the journey, Chan found out that Petch was strong and dependable so she fell for him, and even treated Tadthep poorly. However, Petch loved Sroi whom he did not know was princess Sroisuda-dhevi of Kwangtaburi who escaped from the gangster of Garong. What will Petch decide when he finds out the true identity of Sroi? And will he defeat all the obstacles and save his father?",
  "score": null,
  "genres": [
    "Action",
    "Fantasy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}