{
  "id": 52237,
  "type": "tv",
  "title": "Bad Buddy",
  "releaseDate": "2021-10-29",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/366/916976.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/366/916976.jpg",
  "overview": "Pat is a playful and mischievous boy while Pran is a tidy, prince-like perfectionist. Even before they were born, these two boys were destined to detest each other. Their parents each own a hardware business next door to each other, and they fiercely compete by lowering prices and stealing each other's employees. Their parents hate one another to the core, which is why the boys have been placed in a competition since they were newborns. The parents compare their children in every way conceivable, who crawls first, who walks first, or even who says mama and papa first.When the boys reach the age of 12, their wall begins to break. Pat's little sister, Pa, accidentally rides her bicycle into a pond in the village. While Pat is still in a state of fear, Pran suddenly jumps into the water and helps Pa up. The incident turns the relationship between the two boys into a change. On the surface, they still appear to be enemies, but they no longer truly despise each other. In their ninth grade, the boys are assigned to be in the same music band and they become closer. At this point, Pran's feeling towards Pat gradually develops.Four years later, fate plays a game with the two of them once more. Pat becomes the first-year class president of the Faculty of Engineering while Pran is also the class president of the Faculty of Architecture, and these two faculties happen to be all-time rivals. Pran and Pat are forced to battle once more. When Pa finds out, she demands Pat not to do Pran any harm because he was the one who saved her life at a young age. Pat decides to come to see Pran to propose an agreement. Pat suggests they exchange information about their groups in order to prevent both faculties from warring. Pran, who prefers not to argue, agrees to the idea and their \"secret relationship\" starts from there. They are neither buddies nor enemies, but they can certainly steal the hearts of the audience. When will this friendship that grows in the midst of conflicts come to an end? When will their secret be exposed? Will they be accepted by their parents? Will the conflicts get resolved eventually? Hang tight to find out.",
  "score": 78,
  "genres": [
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}