{
  "id": 59270,
  "type": "tv",
  "title": "My School President",
  "releaseDate": "2022-12-02",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/431/1078963.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/431/1078963.jpg",
  "overview": "Tinn is a perfect 12th-grade student body president who is gorgeous, intellectual, athletic, has a mother who works as the school principal, and is everyone's favorite. Tinn has a dream. He wants \"to be with someone before finishing high school. \"It might sound simple for everyone else but, for Tinn, \"this is nearly mission impossible!!\"The first obstacle is that Tinn's crush is Gun, the head of the music club and the main singer of the \"Chinzilla\" band, which has a strict rule that says \"band members are not allowed to date until the Hot Wave Music Contest is over. \"Gun's band members include drummer Pat, keyboardist Por, bassist Win, and sucky guitarist Yo. They aren't even skilled enough to perform in front of a broad audience, let alone compete in the Hot Wave Music Contest.The second obstacle is that this institution is highly academic. The school principal, Tinn's mother, instructs Tinn to get rid of all clubs that do not bring glory to the school, among which the music club is number one on the list. Tinn is hence Gun's \"number one enemy.\" Meanwhile, Tinn will go to any length to keep his mother from discovering that her noble son has a crush on the head of the music club.The third obstacle is that the new guitarist at the music club Sound is incredibly skilled and attractive. He gets along great with Gun since they share a musical language. How can a love-inexperienced nerd like Tinn, who has Gun as his first love, compete with that?Though it's tough, there's nothing Tinn can't do. A year from now, he will do anything in his power as student body president to help Gun win the Hot Wave Music Contest, hoping that Gun will appreciate his effort and finally proclaim, \"...My boyfriend is the school president...\"",
  "score": 79,
  "genres": [
    "Comedy",
    "Music",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}