{
  "id": 52233,
  "type": "tv",
  "title": "Nabi, My Stepdarling",
  "releaseDate": "2021-02-22",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/296/740160.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/296/740160.jpg",
  "overview": "After her sister and former manager Sirin disappeared mysteriously, Nabi takes it upon herself to investigate by becoming the beautiful manager of Dubai Club. The club belongs to Phichetchai, a man whom Nabi respects as someone she's indebted to. Phichetchai is a married man. He and his wife, Waree, have a son, Kawin. But because Phichetchai trusts Sirin so much, Waree gets the wrong idea and thinks they are having an affair. The jealousy is incited by none other than Waree's own sister, Weeranat, who is in love with Phichetchai and wants him for herself. Waree becomes a paranoid wife, and one day she dies of a mysterious cause. During the same time, Sirin also disappears without a trace.Waree's death brings her only son home from studying abroad. Kawin now seeks the truth about his mother's passing, whether it was accidental or elaborate. Kawin, who was sent abroad as soon as he finished high school, knew and loved Nabi even before they met at the club, and had asked to go out with her. But Nabi refused. What Kawin didn't know was that she turned him down, not because she didn't love him, but because he was Phichetchai's son. Once Kawin is back, he asks to train at his father's club. Phichetchai places Kawin under Nabi's supervision, and the two get to rekindle their feelings for each other. Nabi, still suppressing her feelings for Kawin, asks her best friend Pongpop to play lovers to push Kawin away. Pongpop agrees to help, but under the condition that Nabi also helps him win his first love and ex-girlfriend who is now a doctor, Sandee, back.At the same time, Kawin is investigating the death of his mother. Unfortunately, every evidence leads to Sirin, Nabi's sister, just according to Weeranat's plan. Now that Phichetchai seems to adore Nabi, Weeranat is getting paranoid that Nabi may be trying to steal everything from her. Meanwhile, Phichetchai has found out a secret about Weeranat, and her grief and resentment make her want to get rid of Phichetchai. Worse still, Kawin misunderstands Nabi's intention with his father and thinks she wants to become his stepmother. Will these misunderstandings resolve? How will their complicated relationships end: in love or in pain?",
  "score": null,
  "genres": [
    "Drama",
    "Crime",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}