{
  "id": 59263,
  "type": "tv",
  "title": "10 Years Ticket",
  "releaseDate": "2022-12-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/432/1081667.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/432/1081667.jpg",
  "overview": "10 Years Ticket tells a story of Phukao who loses his good brother at the hands of a sister he once loved with his whole heart. Phukao grows up in a family who used to own an open air cinema business. He loses his wonderful older brother forever at the hands of the sister of Kongkwan on the night of 14 February 2013, the last day of airing and his family's beloved business. That day should have been one of their fond memories to look back on. Unfortunately, it has taken an unforgettable turn and left a scar on their hearts until today. The truth is Phukao's and Kongkwan's families used to love each other like siblings, neighbors, and friends. Also, young Kongkwan is like Phukao's first love. That loss completely tears Phukao's family apart. His parents go their separate ways, while his family's financial situation becomes increasingly worse. Even though Phukao grows into a handsome, talented man who is loved and admired by everyone for his generosity, his kindness is never extended to Kongkwan and her family. Phukao hates them with all his heart. No matter how many times they move houses to escape from him, Phukao always finds and harasses them. He makes sure that Kongkwan's family remembers and never forgets that they have ruined his family and his brother's life. In 2022, Phukao and Kongkwan can no longer run from each other. Kongkwan fights her way to get into the best high school in the city, which happens to be where Phukao is studying and full of memories of their brother and sister. In this reunion, neither Phukao nor Kongkwan is willing to give in to the other. Each of them is ready to fight for their own family and older sibling. Once childhood sweethearts and now enemies, will they find their way back into love?",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}