{
  "id": 61795,
  "type": "tv",
  "title": "The U.S. and the Holocaust",
  "releaseDate": "2022-09-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/417/1044993.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/417/1044993.jpg",
  "overview": "The U.S. and the Holocaust explores America's response to one of the greatest humanitarian crises in history. It is partly inspired by the United States Holocaust Memorial Museum's \"Americans and the Holocaust\" exhibition and supported by its historical resources. The film examines the rise of Hitler and Nazism in Germany in the context of global antisemitism and racism, the eugenics movement in the United States, and race laws in the American south. The series sheds light on what the U.S. government and American people knew and did as the catastrophe unfolded in Europe.Americans consider themselves a \"nation of immigrants.\" Still, as the catastrophe of the Holocaust unfolded in Europe, the United States proved unwilling to open its doors to more than a fraction of the hundreds of thousands of desperate people seeking refuge. Through riveting firsthand testimony of witnesses and survivors who, as children, endured persecution, violence, and flight as their families tried to escape Hitler, this series delves deeply into the tragic human consequences of public indifference, bureaucratic red tape, and restrictive quota laws in America. Did the nation fail to live up to its ideals? This is a history with which to be reckoned.Combining the first-person accounts of Holocaust witnesses and survivors and interviews with leading historians and writers, this series dispels competing myths that Americans either were ignorant of the unspeakable persecution that Jews and other targeted minorities faced in Europe or that they looked on with callous indifference. The film tackles a range of questions that remain essential to our society today, including how racism influences policies related to immigration and refugees, as well as how governments and people respond to the rise of authoritarian states that manipulate history and facts to consolidate power.",
  "score": 90,
  "genres": [
    "War",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}