{
  "id": 64176,
  "type": "tv",
  "title": "Chains of Heart",
  "releaseDate": "2023-02-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/446/1117307.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/446/1117307.jpg",
  "overview": "Ken survived an incident in which Din, his lover, was shot dead in front of him by Nok and his men in the middle of a forest in Uttaradit. After that, Ken manages to escape and settle down as an assistant chef at a 3- Michelin-starred Chinese restaurant with Pa, Ken's father in Chinatown in Singapore for nearly two years. Ken has been stuck with that nightmare and deeply hope that Din is still alive. Ken becomes more withdrawn and does not communicate with anyone in Thailand at all. He prepares and intends to return to take revenge for Din. Inpha, a person with great power and influence in Uttaradit revered by the Din family for a long time, is behind the death of Din. Although Ken is heartbroken and DD, a young Thai student, keeps courting him and taking care of him, Ken feels strangely trembled when he meets Lu, a young Taiwanese businessman who saves him from the attack of teenage gangsters. After that, Lu begins to create a relationship with him and DD always acts like a dog in manger to keep Lu away from Ken. But then, Ken's deep hope that Din is still alive somewhere is immediately collapsed when an insane couple, Phayu, Ken's best friend, and Hin, Din's elder brother, tells him that Din's body is found and Din's parents will hold a funeral for Din in Uttaradit. Although Ken desperately wants to go back to see his lover's body for the last time, Pa is renting a new building to open a Thai restaurant for Ken which he has been dreamed of. So, Ken refuses to go back and attend Din's funeral. That night, Ken is assassinated by a villain. DD comes to the rescue and get near-death injured. A mysterious man in black saves Ken and DD's lives in time, so the villain can escape. Ken is unconscious and awake at an illicit clinic. Unknowingly who saved his life, there is only a written message warning him not to return to Thailand. Ken is surprised and to analyze the cause of all incidents. Who is the man in black??",
  "score": 71,
  "genres": [
    "Drama",
    "Action",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}