{
  "id": 68699,
  "type": "tv",
  "title": "LEGO DREAMZzz",
  "releaseDate": "2023-05-15",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/460/1152147.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/460/1152147.jpg",
  "overview": "Our story focuses on a group of middle schoolers who, after one fateful night, uncover the ancient secret that the dream world exists.Yes, perhaps the most important thing to know about LEGO DREAMZzz is that the dream world is real. It's a place consisting of diverse realms waiting to be explored, from the futuristic Cyber Realm to the super-sweet Candy Realm.Each is teeming with incredible creatures that only the boundlessness of dreams could create. And everything you've ever dreamed, whether you remember it or not, actually exists in that world. Which is great news!However, as with any good story, there are also bad guys. The dream world is being threatened by the Nightmare King and his Grimspawn Army, who are corrupting the dreams of sleeping kids. They are the nightmares who want to take over the dream world… and the waking world too...But back to our heroes...By day, they live out the same trials and tribulations as every other kid. Hallway dramas, friendship issues, homework deadlines – the kind of problems every kid will recognize from their lives.At night, their concerns could not be less typical. Mateo, Izzie and their friends must save innocent dreamers and take on the Nightmare King by mastering the power of dream crafting while in the dream world. This ability requires creators to focus all their inspiration to conjure up objects, tools, vehicles, companions – anything you can imagine – while dreaming.It's a process that requires the kids to put faith in their skills and overcome their individual limitations. Like Izzie's impulsiveness, Cooper's perfectionism, or Mateo's fear of judgement.And of course, as the kids all grow as crafters and creators in the dream world, so do they grow as people in the real world.",
  "score": null,
  "genres": [
    "Adventure",
    "Children"
  ],
  "screenshots": [],
  "systemRequirements": null
}