{
  "id": 68812,
  "type": "tv",
  "title": "Story of Kunning Palace",
  "releaseDate": "2023-11-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/463/1159846.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/463/1159846.jpg",
  "overview": "Chinese drama Granting You a Dreamlike Life is adapted from Shi Jing's novel A Lady's Tranquility. It is directed by Zhu Ruibin (Ashes of Love), starring Bai Lu (Ordinary Greatness, One and Only), Zhang Linghe (Love Between Fairy and Devil, Flourish in Time), and Wang Xingyue (Delicacies Destiny). Jiang Xue Ning (played by Bai Lu) had gone to great lengths to become empress, but was forced to commit suicide during a palace mutiny. Now, Jiang Xue Ning's dream is to get away from power and have control over her own life. However, by mistake, she has joined the palace as a tutor and becomes a student of the imperial master Xie Gui (played by Zhang Linghe). While receiving Xie Gui's teachings, Jiang Xue Ning secretly plans to stop Yan Lin's (played by Zhou Junwei) upcoming \"Blood Crown Ceremony.\" With Jiang Xue Ning and Xie Gui's plan, the Yan family's lives were saved. After the \"Blood Crown Ceremony,\" Jiang Xue Ning is inadvertently involved in the imperial court's plan to eliminate those rebels against Pingnan King, and infiltrates into the enemy camp with Zhang Jie (played by Wang Xingyue). When the enemy country Yue comes to invade, the Princess Shen Zhi Yi (played by Liu Juning) resolutely embarks on the road to peace. In order to save her friend Shen Zhi Yi, Jiang Xue Ning goes north with Xie Gu to invade Yue. In the midst of many crises, Xie Gu protects Jiang Xue Ning even at the risk of hurting himself, and the two of them grow to love each other. However, a bigger conspiracy gradually surfaced, which pointed to the truth of the Pingnan King incident twenty years ago. In the end, Jiang Xue Ning and Xie Gui teamed up to uncover the truth of that year, Jiang Xue Ning also used love to convert Xie Gui, and the two finally became a couple. The drama will be broadcasted online on iQIYI's international site (iq.com).",
  "score": null,
  "genres": [
    "Drama",
    "Romance",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}