{
  "id": 67463,
  "type": "tv",
  "title": "Five Kings of Thieves",
  "releaseDate": "2024-03-23",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/509/1274790.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/509/1274790.jpg",
  "overview": "In the early years of the Republic of China, as Western knowledge spread to the East, various natural science research institutions emerged. Among them, the Five Great Families, with their long-standing and prestigious origins, divide responsibilities based on industry characteristics, geographical locations, emphasis on traditional culture, and family resources. They collaborate and coordinate their efforts according to their corresponding Five Elements. Legend has it that the Supreme King Ding of the Five Elements seals a mysterious power within it. Whoever obtains this power can command the martial arts world and unify it. The Ding has always been guarded by the Five Great Families, who use a unique secret method to seal the opening instruction inside the Jade Embryo Bead. At the end of the Qing Dynasty, after a fierce battle, the whereabouts of the Supreme King Ding became unknown. Twenty years later in Fengtian, the Jade Embryo Bead appears, and various forces are stirred into action. Huo Xiaoxie, a street orphan, is exploited and becomes involved unexpectedly. He watches helplessly as his master and poor brothers are successively harmed by Fourth Master Zhang and others, unable to do anything. In a critical moment, Huo Xiaoxie is fortunate to receive help from the Water King's daughter, Shui Yao'er, and the head of the Fire Family, Yan Jingtian, among others. They risk their lives repeatedly, engaging in battles of wit and bravery against evil forces. Though Huo Xiaoxie hails from humble origins and faces numerous hardships, he remains resilient. Even in the midst of a chaotic era full of deception and confusion, he still exerts all efforts to save his friends with whom he shares joys and sorrows. While on the run, Huo Xiaoxie and Shui Yao'er develop feelings for each other. With Shui Yao'er's assistance, Huo Xiaoxie obtains the Blackstone Fire Token to participate in the selection of the Five Great Families which allows him to compete against various extraordinary contestants. In the end, the Supreme King Ding chooses its master and Huo Xiaoxie narrowly passes the test, exchanging his passion and street wisdom for a chance of survival and a bright future. Amidst this chaotic era, he finds his path of righteousness and discovers love.",
  "score": null,
  "genres": [
    "Adventure",
    "Fantasy"
  ],
  "screenshots": [],
  "systemRequirements": null
}