{
  "id": 67950,
  "type": "tv",
  "title": "My Lord Don't Want It",
  "releaseDate": "2023-04-03",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/455/1139218.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/455/1139218.jpg",
  "overview": "Zhu Hongxiao, a small Internet celebrity in the 21st century, mainly focuses on eating, broadcasting and tourism. During a trip to the Forbidden City, because of the audience's request to take pictures in the well, he was knocked into the well and traveled to ancient times. The vermilion gauze that traveled back to ancient times was the jewel in the palm of the emperor, and the three princesses of the dynasty Zhu Hong gauze. When Zhu Hongxiao sorted out her thoughts and began to look forward to her life as a princess, she was coaxed and taken to the Jin Mansion in a remote city, preparing to complete her marriage contract with Prince Jin. The uneasy Zhu Hongxiao accidentally found the female \"corpse\" lying in the backyard. Panicked, Zhu Hongxiao alarmed the Jin Wang Ye who was taking a bath, and had a sweet first meeting with the Jin Wang Ye. During the conversation between the two, the King of Jin resolved his misunderstanding of \"killing\" and Zhu Hongxiao also revealed that he did not want to consider marriage for the time being. He stayed for a long time, and assigned Xiaoxi, the female corpse in that courtyard, to Zhu Hongxiao as a maid. During the period of becoming the younger sister of Prince Jin, Zhu Hongxiao got to know many friends of Prince Jin, such as Yingchun Sword Yingying, wealthy son Ning Xiaobai, Taomian layman Wen Renfeng. After a brief happy time, the emperor's confidant General Yin came here to visit Prince Jin, and Prince Jin and Zhu Hongxiao had to pretend to be husband and wife to hide the fact that they were not married to General Yin.When General Yin was about to expose the disguise of the two, a red-haired weirdo (Ning Wujing in the original) attacked the Jin Mansion. Ning Wuzong's target is Zhu Hongxiao, the emperor's daughter. For Ning Wuzong, all people with surnames are his enemies of subjugation, but under Zhu Hongxiao's strong words, Ning Wuzong temporarily gave up killing Zhu Hong. With Xiao's thoughts, the two started a short hijacking tour, and finally because Ning Wuzong was seriously injured by General Yin, he was stranded in the temple. King Jin rescued the two in plain clothes and sent them to a safe brothel. During the few days hidden in the brothel, King Jin discovered Zhu Hongxiao's secret.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}