{
  "id": 68149,
  "type": "tv",
  "title": "Ju Hua Zui",
  "releaseDate": "2023-04-13",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/457/1143055.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/457/1143055.jpg",
  "overview": "During the Xianfeng period, the export of tea from the Qing Dynasty caused the Sino-British trade to be in deficit for a long time, which greatly damaged the interests of Britain. In order to reverse the situation, Queen Victoria specially ordered the Marquess of Dalhousie, the British governor in India, to send botanist McKinnon to sneak into China to steal tea tree seedlings and tea tree seeds and recruit Chinese tea planters. At this time, the Taiping Army was booming, Guangdong and Guangxi were in shock, and the court was in chaos. Hu Ying, the young owner of Tianquan Tea House, a Hunan tea giant, and his brother Hu Jiabao returned from Beijing to their hometown in Anhua, Hunan to celebrate their father's birthday. Because of the traitor's trick by mistake, on the day of the birthday banquet, the whole family was in distress, and Hu Ying accidentally saved his life. McKinnon learned of Hu Ying's whereabouts from the British Consulate General in Shanghai, rescued him through untold hardships, and took him and tea tree seedlings to smuggle out to sea, to the Asa Valley in India at the southern foot of the Himalayas, and hired Hu Ying as The general comprador of tea. Hu Ying used his unique skills to help the British grow tea with great success. But Hu Ying was not angry that the British Royal Cavalry bullied his compatriots, so he killed the British and fled back to Xinjiang. Therefore, around a battle between Chinese and British tea merchants, Hu Ying paved the way to seek revenge and explore secrets. The country's hatred, the family's distress, and the world's hatred and the sea are all in one. From the shore of Dongting Lake to the foot of Kunlun Mountain, scenes of tragedies and comedies of love and hatred that are rare in the world are staged.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}