{
  "id": 60932,
  "type": "tv",
  "title": "Oriento Kyuko Satsujin Jiken",
  "releaseDate": "2015-01-11",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/399/997957.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/399/997957.jpg",
  "overview": "In February 1933 (Showa 8), there is a lone man of small stature at Shimonoseki Port. He is Suguro Takeru, a famous sleuth who immediately became a household name when he solved the ABC Murder that rocked the entire nation. Headed for Shimonoseki Station after solving a murder that occurred at a military facility in Kokura, Suguro is about to board the Orient Express which connects Shimonoseki and Tokyo. The ultra-luxurious and sophisticated Orient Express is Japan's first limited express train with sleeping berths. Even palace insiders and high-level government officials use the Orient Express. However, its sleeping berths are fully occupied even in February. Suguro gets one secured through the help of Baku, an official of the Ministry of Railways, whom he happened to meet again in Shimonoseki. The Orient Express departs Shimonoseki in the morning and will arrive in Tokyo the next morning. In the dining car, Suguro is asked by the industrialist Todo Osamu to be his personal bodyguard. However, Suguro is put out by his patronising attitude and turns down the offer. The next morning, the train is stuck in the vicinity of Sekigahara because of heavy snow. Amid this, Todo is found murdered inside a passenger cabin. Baku asks for Suguro's assistance. Having determined from the circumstantial evidence that the murderer is among the passengers, Suguro promises to solve the case by the time the tracks are restored. He deduces that the criminal's motive is revenge which started with the tragedy which happened to the Goriki family five years earlier. It was a misfortune which struck Colonel Goriki, his wife Soneko and their maid Sayuri. With Baku and the doctor Suda as his aides, Suguro makes use of the conductor Miki Buichi, and starts to question each of the 12 passengers on the train. The 12 are people of completely different status and occupations: Todo's secretary Makuuchi Heita, the butler Masuda, the loud-mouth Madam Hatori, Kureta Sonoko who works in a church, the Marchioness Todoroki, the diplomat Count Ando, his wife Countess Ando, the army colonel Noto, a fountain pen salesman Hazama Saisuke, the Hakata imported car salesman Hotoda Tamio, the governess Baba Maiko and the marchioness' maid Hirudegawa Sumiko. The criminal must be among them. Police assistance is strikingly absent. This is also no the age of forensic science. Suguro gradually starts to get close to the truth by relying only on the statements of the suspects. After the long interrogation ends, he arrives at an answer. It is astounding conclusion that no one could have imagined. Then the case is studied again, this time from the perspective of the criminal. This is the story of an unspeakable revenge backed by a carefully planned crime.",
  "score": null,
  "genres": [
    "Crime",
    "Mystery",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}