{
  "id": 68084,
  "type": "tv",
  "title": "Polowanie na cmy",
  "releaseDate": "2023-03-19",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/456/1141430.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/456/1141430.jpg",
  "overview": "Warsaw, May 1905. A young girl entangled in pro-independence activities is unexpectedly released from prison. It turns out that she was bought out by Black, a pimp who deals in human goods. It is to be sent to Argentina. Due to the beauty of the girl, it is more profitable for Czarne to put her on interest in the most luxurious Warsaw brothel of Franciszka Szlimakowska. On the same day, a bomb detonated by the PPS explodes near Szlimakowska's shrine. This is another explosion directed against the Russians. Szlimakowska, captivated by the girl's beauty and refinement, hires her to work in her establishment and names her Yvette. Yvette, having nowhere to go, looks for accommodation with Szczerb, an independence activist and friend of her fiancé, Józef, whom she has not seen since her arrest. Yvette decides to earn money to find her fiancé. Meanwhile, at Szczerba's, he meets Marcel, a PPS courier who was delivering the bomb and was injured during the explosion. The same events are seen from a different perspective by Nastazja Jurina, a Russian woman from St. Petersburg, a policeman's wife, lost in a strange Warsaw and in an arranged marriage after a sex scandal. The church is her only place of escape from her husband, who has been dreaming of a promotion and a child for a long time without success. The head of the Warsaw Okhrana, Margrafski, blames Jurin (Nastazja's husband) for another bomb explosion in his district, which again rules out his chances for promotion. Szlimakowska's accidental meeting with Jurina in a dress shop is the beginning of an ambiguous acquaintance between a Polish woman and a Russian woman. Szlimakowska dreams of selling the brothel and leaving Warsaw forever for Biarritz, but the matter is difficult because the place belongs to her husband, who abandoned Franciszka many years ago. The woman meets with attorney Piotrowski, who represents a merchant who is ready to buy Szlimakowska's shrine despite the complicated legal status. Wiktor Grun, on the one hand, a clerk in the tsarist police, stands on Szlimakowska's road, and on the other hand, a mafioso collecting protection money. He dreams of a career in Okhrana, and at the same time he deals with the trade of women with the Black man.",
  "score": null,
  "genres": [
    "Drama",
    "War",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}