{
  "id": 68115,
  "type": "tv",
  "title": "Take Us Home",
  "releaseDate": "2023-04-15",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/456/1142455.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/456/1142455.jpg",
  "overview": "The three cousins of the Zheng family have been just like siblings since birth. Zheng Dongni is rebellious and flamboyant because of her parents' relationship. She yearned for a foreign country and married to Germany. Zheng Xijue was brought up by his third uncle and three aunts because his parents died when he was young, and he stayed in Longcheng wholeheartedly to repay his kindness to the big family. Xi Jue helps his uncle who has suffered injustice to change his life, but he himself suffers from an unforgettable lovelorn. Fortunately, Dongni's best friend Jiang Yi shows up at the right time, and the two gradually establish a relationship. The marriage between Zheng Dongni and her husband Fang Jinghui, a doctor, turned into a bloody mess. A divorce war went from abroad to Longcheng. The aggressive Dongni was exhausted after her father fell ill and her mother passed away, so she relied on Xi Jue to take care of her. The last cousin, Zheng Nanyin, had a perfect family since she was a child. She was protected by her elder brother and sister. In order to resist her mother's restraint, she got married as soon as she entered university. Unexpectedly, the couple on campus broke up and she had to go back to the big family to recuperate from time to time. However, Jiang Yi wanted Xijue to leave Longcheng, and the relationship between the two was on the verge of being broken... The three brothers and sisters walked out of their original families, but new setbacks continued to appear, and finally they understood the \"uselessness of the warmth.\" It is this seemingly useless care and watch that is the true meaning of home and the source of growth.Adapted from the novel series \"Memory in the City of Dragon\" (龙城三部曲) by Di An (笛安）",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}