{
  "id": 62447,
  "type": "tv",
  "title": "Mongkut Karma",
  "releaseDate": "2022-06-08",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/412/1030987.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/412/1030987.jpg",
  "overview": "Chan was forced into marriage to Tee who owns a minibus business for paying her father's gambling debt although being in love with Ying, a factory worker. They had 5 children, the eldest is Hong, the second is Kla, the third is Ma, and the youngest is a twin boy and girl, Muay and Montri. Meanwhile, Ying had a chance to move in with a general who is the father of Dao. He started to study, and still maintained contact with Chan through letters which provide her comfort. After graduation, he became a Deputy district chief with the help of Dao's father. He also finally got married to her. They have an only daughter from their marriage, Ning. Tee eventually began to have an affair, leaving his wife and children in poverty. But not before assaulting her when he found out about her connection with Ying. In despair, Chan decided to bring her children except for Montri out of Tee's house. On the other hand, Dao was also furious upon discovering that her husband kept in contact with his ex-girlfriend Chan. Life for a single mother is hardly ever beautiful. In order to keep her children fed, Chan worked hard. It even led her to move into Millionaire Kong's house as a maid and mistress. However, that did not last long because soon Kong attempted to rape her eldest daughter, Hong, and when failing to do so chased them out of his home. One day, Chan helped a kind millionaire, Jit, who owns an orchard from a thief. To thank her, Jit helps Chan out. Eventually, Chan leaves the life of misery and is able to own a canned fruit factory. Nonetheless, happily ever after is nowhere near. ",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}