{
  "id": 65347,
  "type": "tv",
  "title": "Find Yourself",
  "releaseDate": "2023-12-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/490/1226757.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/490/1226757.jpg",
  "overview": "Whenever Yin,a stunning and perfect MD, goes on a date, she dreams of meeting a love at first sight and falling in love with him as soon as they start talking, but her dream hasn't come true yet. It's rumored that she hasn't moved on from the love she once had for her university senior, but that was so long ago that she has already forgotten about it. One day, when her fate is probably looking for something fun, she meets Shane, a handsome university intern who takes such amazing care of her. One night, the relationship between Yin and Shane accidentally goes too far because she is totally wasted. If anyone knows about this, Yin must end up in trouble, butShane,who is supposed to be the one being taken advantage of, instead begs Yin to develop this relationship seriously. While deciding whether to make or break, Yin meets Ray, an established businessman in his prime who openly hits on her. Ray suggests Yin try opening up her mind to date someone for a short time, like a probation. In fact, Ray says that to her because he hopes Yin will choose to date him. However, this makes Yin decide to try dating Shane, who doesn't give up on her at all. They agree to try being in a relationship for three months! To a single woman like Yin, love doesn't involve only her but also her subordinates and colleagues, including Sandyand Champ, who keep pairing her with guys. At the same time, her parents are also rooting for Yin to get married finally. The most mischievous one goes toYang, her younger brother, who is a matchmaker, arranging blind dates for her. However, his own love life isn't a bed of roses either, asYangfinds himself having feelings for Mint, his student from a different faculty. During these three months, Yin must find the answer for her heart on whether she likes Ray,a perfect choice, completely meant for her in the eyes of those around her, or Shane, who doesn't seem good enough to others but is always by her side, caring for her and doing everything to show that he loves her more than anyone else. Stay tuned to find out who will be her final choice. ",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}