{
  "id": 63095,
  "type": "tv",
  "title": "Mental Coach Je Gal Gil",
  "releaseDate": "2022-09-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/418/1047103.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/418/1047103.jpg",
  "overview": "A sports drama about a former national athlete who quit sports after an accident helps players in the slumps, heal retired old veterans and plays a real game against the absurd world of winner-take-all.A sports drama about a former national athlete who quits sports after causing a scandal and becomes a mental coach to help former professional athletes who have retired and current athletes who have fallen into a slump. Je Gal Gil is a former national Taekwondo athlete who is known for his hard work and dorky charms. After he causes an unprecedented accident in the athlete's village, Je Gal Gil is permanently expelled and coined the unlucky Taekwondo prodigy. Once he overcomes his past trauma and regains his mental health, Je Gal Gil returns to the athlete's village as a mental coach. Cha Ga Eul is a former world-class short track speed skating gold medalist who has fallen into a slump. With her pretty poker face, she's known as the up-and-coming \"Ice Princess,\" but she faces the danger of fading out when she falls into a slump. Unable to confide in anyone, Cha Ga Eul begins to beat herself up until she meets mental coach Je Gal Gil. Gu Tae Man is the director of the Human Rights Center in the Korean Olympic Committee. The former Taekwondo Olympic gold medalist has a strong desire for power and is the reason Je Gal Gil's life was transformed overnight. With the belief that anything can be covered as long as he is No. 1, Gu Tae Min does everything he can for the top position. Park Seung Ha is a part of the mental health support team in the athlete's village. She is the perfect example of \"a kind daughter who was raised well\" but endures an unexpected hardship after meeting Je Gal Gil as her first patient. Park Seung Ha ends up leaving the hospital and applying to the athlete's village instead where she surprisingly reunites with Je Gal Gil, this time as advisor partners.  ",
  "score": null,
  "genres": [
    "Drama",
    "Sports"
  ],
  "screenshots": [],
  "systemRequirements": null
}