{
  "id": 67172,
  "type": "tv",
  "title": "FBI True",
  "releaseDate": "2023-02-28",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/501/1253255.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/501/1253255.jpg",
  "overview": "Each edition of FBI True focuses on dynamic insider conversations between agents when they meet at the FBI's favorite bar, the Arts &amp; Crafts Beer Parlor, just down the block from their New York headquarters. It's a hallowed place where law enforcement colleagues talk frankly about the triumphs, tragedies and real truths of their jobs. In this relaxed setting, they share hair-raising stories of dangerous missions carried out by the FBI in the United States and worldwide. With everything on the line, what choices did they make? How did they keep their cool with a kidnapped child's life on the line, or with a bomb ticking in an unknown location, or a terrorist on the loose?FBI True features never-before-seen surveillance video, interrogations with hostage takers and terrorists, and personal photos from the agents' collections. This is the FBI like you've never seen, as agents disclose what happened, and how they felt while working on some of the biggest and most compelling crimes of our time, revealing their fears and exulting in their victories. Viewers will get a spine-tingling look inside the manhunt for a bomber responsible for injuring 30 people in Manhattan; the desperate search to find Hannah Anderson, a high school cheerleader kidnapped in California; the command center at Waco as agents helplessly watched women and children consumed by fire as the David Koresh's cult compound ignited; the complex search for the Beltway snipers in Washington, DC; the frustrating effort to find the terrorists who attacked the U.S. mission in Benghazi killing the ambassador; and the search for the brutal Boston mob leader Whitey Bulger.",
  "score": 70,
  "genres": [
    "Crime"
  ],
  "screenshots": [],
  "systemRequirements": null
}