{
  "id": 68845,
  "type": "tv",
  "title": "My Talented Husband",
  "releaseDate": "2023-05-22",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/462/1155475.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/462/1155475.jpg",
  "overview": "The modern and humble son-in-law, Li You, arrived at the Xujiang County of the Daning Dynasty and took on the role of a yamen runner, following in his father's footsteps. Being mocked as a lowly yamen runner, Li You, filled with anger, presented a poem as a gift to Li Huan, a songstress who had also been humiliated. Unexpectedly, the poem gained great fame, making him a talented official and catching the attention of the county magistrate. Li You's path to success was opening up, but little did he know that being a talented young man could also be dangerous. He found himself caught in a marriage dispute between the martial officer Liu and the wealthy merchant Guan, becoming a son-in-law of both families due to a twist of fate. To his surprise, even after changing time and space, he remained a son-in-law and even upgraded to being a double son-in-law! Fortunately, Li You was clever and established a three-year agreement, but he was caught in a dilemma between Liu Xinyu's and Guan Xiuxiu's advances. In order to gain freedom, Li You worked hard and gained fame in the literary world, earning the title of the \"Lyric Saint of Jiangnan.\" He also steadily rose through the ranks in the county yamen, solving extraordinary cases, and achieved great success in the business world. His sense of justice made him fearless against the evil forces of the wealthy Yan family and the county prefect, and he became renowned for advocating for the people, gaining fame across the dynasty. However, he did not expect that he would become more and more dazzling, and both the Guan and Liu families found it increasingly difficult to let go of this exceptional son-in-law. How will this three-year agreement ultimately unfold?",
  "score": null,
  "genres": [
    "Comedy"
  ],
  "screenshots": [],
  "systemRequirements": null
}