{
  "id": 64216,
  "type": "tv",
  "title": "Hit Bite Love",
  "releaseDate": "2023-01-21",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/422/1057044.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/422/1057044.jpg",
  "overview": "Love vs Make Love: Ken and Shokun are secretly dating but they must keep it a secret. After a long time, Shokun—who yearns for status—becomes dissatisfied and desperately wants to disclose their relationship publicly. They finally break up. Soon, Shokun starts a new relationship with school president Matteo. Matteo agrees to reveal their relationship, but Shokun is surprised to discover Matteo is into BDSM and Shokun is the vanilla type. With their sexual desires in conflict, will the two continue dating? Furthermore, what will happen when Ken is ready to resume their relationship in the open? Like vs Be Liked: Burger and King are classmates. One day, sitting at their desks side by side, King finds he's forgotten a book, so Burger offers to share his. Unexpectedly, King sees a drawing of himself in Burger's book and assumes Burger likes him. After a long day, King feels good about being liked by him and he asks Burger out. However, it was a misunderstanding; Burger doesn't like King. With one party hurt, can the two continue studying in the same room? Hurt vs Hell: When Hida's mother remarried Saint's father, Hida and Saint became siblings not related by blood. Both are siblings who lack the warmth of their families. When they're together, however, they feel each other's feelings, making them closer than blood siblings. Saint begins seeing Pin, a student famous for her beauty, which makes Hida feel estranged from Saint. It hurts like hell. Hida tries to find a way to make Saint end the relationship, but he doesn't know the hell of their sibling relationship has just begun to increase. ",
  "score": 66,
  "genres": [
    "Comedy",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}