{
  "id": 69152,
  "type": "tv",
  "title": "Mysterious Lotus Casebook",
  "releaseDate": "2023-07-23",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/477/1193171.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/477/1193171.jpg",
  "overview": "\"Mysterious Lotus Casebook\" is a costume martial arts mystery drama directed by Guo Hu (\"Immortal Samsara: Part 1\") and Ren Haitao (\"Love and Destiny\"). It stars Cheng Yi (\"Immortal Samsara: Part 1\"), Joseph Zeng (\"Meet Yourself\"), and Xiao Shunyao (\"Till the End of the Moon\") in the leading roles. The series is adapted from the novel \"The Auspicious Lotus Tower\" by Feng Ping. It tells the story of Li Xiangyi, the renowned leader of the Sigu School in the martial arts world, who is severely injured in a major battle. He retreats from the martial arts world and becomes a humble physician named Li Lianhua. However, his peaceful life is disrupted when he encounters Fang Duobing, a new friend plagued by illness, and his old enemy Di Feisheng. Li Xiangyi is once again drawn into the world of martial arts. Ten years ago, Li Xiangyi (played by Cheng Yi), as the head of the Sigu School, was hailed as the unparalleled master of the Xiangyi Sword, shining as a symbol of righteousness in the martial arts world. However, during a battle with Di Feisheng, the leader of the Jinyuan League, the two formidable warriors disappeared without a trace in the vast sea. Both the Sigu School and the Jinyuan League suffered heavy losses and gradually vanished from the martial arts world. Ten years later, Li Lianhua (played by Cheng Yi), a wandering country doctor, travels with a Lotus Tower, unintentionally gaining the reputation of a renowned physician. Although he initially had no intention of getting involved in the martial arts world, he becomes entangled in it. Fang Duobing (played by Joseph Zeng), a young man who dreams of becoming a righteous hero, realizes that Li Lianhua is not ordinary and vows to expose his true identity as a fake doctor. Meanwhile, Di Feisheng, who has always regarded Li Xiangyi as his formidable rival, recognizes the inconspicuous country doctor Li Lianhua as Li Xiangyi. He refuses to let him go easily.",
  "score": null,
  "genres": [
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}