{
  "id": 64089,
  "type": "tv",
  "title": "Khun Chai",
  "releaseDate": "2022-10-03",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/422/1055077.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/422/1055077.jpg",
  "overview": "This is a story of a family's heir, carrying hope of family on the shoulders. His life has already been designed and there are rules to follow. He can't do what he wants and he can't love who he wants either.  Tian and Yang are sons of Song Family, a member of Five Dragons Group. Tian is a son of Li, the first wife. And Yang is a son of Chan, a second wife. Tian was born first so he is appointed to be the heir of the family. Tian is a polite and gentle boy. He likes to study, paint and watch Chinese opera. On the other hand, Yang is a playful boy. The outsiders see Yang as good-for-nothing type of person. In fact, Yang has no interest to compete with his brother because Tian saved his life in the past. In return, Yang promises Tian that he will take his brother to see every Chinese opera that he wants to.There is a secret behind a perfect life of an heir. The only persons know about this secret are Li and Jia, a servant who see Tian wraps his head with a scarf and sings, pretending to be Chinese opera performers. Li can't take it so Tian is asked to stop this behavior and she has to cover up his secret.20 years has passed, Tian is working for his family business while Yang is still playing around. Yang still keeps his promise to take Tian to see Chinese operas constantly. One day, Tian meets Jiu, a fondant seller, that he likes.Li still has a hope that Tian will become a straight man. But Tian has no interest in women. People seem to be curious about this and Li needs to stop people's curiosity. She tries to find a fiancée for him and speed up the marriage. Yang knows the truth and he feels sorry for his brother. He helps his brother to delay the wedding date as much as possible. In the meantime, relationship of Tian and Jiu starts to grow strongly.No matter how hard Li tries to cover up Tian's secret, the head of Song Family eventually knows about this. He wants Tian to be the heir of the family and maintain family's name. He doesn't want his sons to suffer so he asks Tian to hand over everything to Yang. Tian feels such a big relief and he agrees on this. But Li disapproves this plan. Before the announcement, Li poisons the head of Song Family until he is paralyzed, and Tian continues to be the one and only heir. Chan knows about this so Li murders her and bury Chan's body under the ground.Tian can't escape from this loop. Will he eventually get out of this loop?",
  "score": 63,
  "genres": [
    "Drama",
    "Romance",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}