{
  "id": 62505,
  "type": "tv",
  "title": "Alexander Armstrong in South Korea",
  "releaseDate": "2022-11-08",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/429/1074591.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/429/1074591.jpg",
  "overview": "Gangnam Style… Squid Games…K-Pop. South Korea is one of those places that's always somewhere in our consciousness, but most people know little about this extraordinary country. Divided into the distinct countries of North and South since 1953, the course of Korean history has been strongly influenced by the country's location between its two mighty neighbours - China and Japan. But despite this, unique Korean culture has retained a distinctive quality of its own. Alexander heads off to one of the most dynamic nations on earth to find out more. South Korea is a nation of contrasts, smaller than England but can feel like another planet entirely. Alexander's mission is getting to the heart of what makes the nation tick is. South Korea is a country that is deeply traditional but also fast-paced, future tech savy and forward thinking. How is it that a faraway country packs such a punch? What will Alexander find as he heads into the future in one of the liveliest, at times strangest, and proudest nations on earth? During his travels Alexander will explore much of what the country has to offer from a K-Pop makeover, the awesome Gyeonbokgung Palace, and ultra-hi-tech cities where robots serve chicken in restaurants.  He'll also visit the ‘poo café' where everything including the teacups is toilet inspired.  He'll also explore the fad of Mukbang – madly eating online, and visit stunning landscapes paragliding over the mountains, and visit Seoul's Death Experience School and the Healing Sleep café.  In the wider country a holy Shamen advises him, and he joins in the original squid games on the streets.   ",
  "score": null,
  "genres": [
    "Adventure",
    "Travel"
  ],
  "screenshots": [],
  "systemRequirements": null
}