{
  "id": 75238,
  "type": "tv",
  "title": "The 1980s Supermarket",
  "releaseDate": "2024-03-27",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/510/1276317.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/510/1276317.jpg",
  "overview": "Hot on the heels of the The 1970s Supermarket, embark on a thrilling voyage back in time to the vibrant aisles of Britain's 1980s supermarkets, where the battle for retail supremacy was as intense as the flavours on the shelves. This is a tale of not just expansion, but a cultural shift that forever changed the British palate and the very way we shop. The 1980s Supermarket peels back the nostalgic wrapper to reveal the seismic changes that turned grocery shopping into a retail revolution.This is an immersive experience that will stir the senses and the memories. Tighten your grip on your trolley - we're about to take you through the sliding doors into a world where every turn down the aisle is a trip down memory lane, and every product on the shelf has a story. Welcome to the golden age of grocery.As we venture into the past, we'll unveil how titanic brands such as Tesco and Iceland reshaped the retail landscape, eclipsing small-town favourites with a mix of strategic prowess and relentless efficiency. Witness the rise of Sainsbury's epic Savacentres and the birth of the BOGOF era, where the mantra was \"bigger is better\" and convenience was king.But this journey is about more than the rise of the supermarkets; it's about the food that defined a decade. We'll explore the phenomenon of Potato Waffles, whose catchy jingles still echo in our ears, and see first-hand the science that keeps them perfectly crisp, courtesy of Dr Chris Clarke in the lab. It's a story peppered with culinary icons, from the advent of pre-packed sandwiches, which sprang from the surplus of a Marks and Spencer in-store café, to the luxurious slices of Viennetta that graced dinner tables across the country.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}