{
  "id": 72750,
  "type": "tv",
  "title": "Born in Synanon",
  "releaseDate": "2023-12-12",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/491/1229396.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/491/1229396.jpg",
  "overview": "Born in Synanon chronicles one woman's journey to discover the truth about Synanon, the experimental community that turned into a full-blown cult. Cassidy Arkin was born into Synanon. Her earliest memories are of a happy place with extended family, a portrait that stands in stark contrast to the abusive hierarchical society into which it evolved and that her peers vividly recall.What began as a successful drug-and-alcohol treatment program would become a fully established, racially inclusive utopian community. But in 1974, the year Cassidy was born, the community's leaders embarked on a relentless descent into extremism, forging a path characterized by unparalleled control. They mandated uniforms, shaved members' heads, required vasectomies and even ordered the changing of partners to break up marriages - all while acquiring a large cache of weapons and training a military-like cadre. Tensions escalated within the community as its members increasingly became isolated from the law and order of the outside world, which created a crack in the utopian armor driven by the vision of its charismatic founder Chuck Dederich. While initially forming Synanon to combat alcoholism, Dederich eventually succumbed to his own struggles with substance abuse and unchecked bipolar disorder.Over four episodes, Cassidy and her mother Sandra Rogers-Hare go on a quest to understand the nature of Synanon – both the good and the bad. They reconnect with former members and share deeply personal experiences, revealing a vast trove of never-before-seen archival footage. The truth is shocking, leaving Cassidy unprepared for the startling discoveries that she soon would uncover.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}