{
  "id": 73258,
  "type": "tv",
  "title": "Amor Real",
  "releaseDate": "2003-06-09",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/559/1398325.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/559/1398325.jpg",
  "overview": "In the mid-19th century, in a time of Victorian morality, challenging the rules of the aristocracy to which she belongs, Matilde Peñalver Beristáin, falls in love with Adolfo Solís, an army soldier with no fortune; trusting that her father, Hilario – a fair and kind man – will let her marry him. But her mother, Augusta, is determined to force Matilde to marry a rich man to save the family from bankruptcy. Manuel Fuentes Guerra is the perfect candidate. He is an honourable and handsome young man who has just inherited a vast fortune. Augusta ignores the fact that Manuel is the illegitimate son of Joaquín Fuentes Guerra, a powerful landlord who raped a native girl, and who only recognised Manuel as his heir on his deathbed.Using all kinds of intrigues, Augusta and her son Humberto send Adolfo to prison and convince Matilde to believe that he is married and has children. Overwhelmed and in despair, Matilde surrenders to her mother's pressure and agrees to marry Manuel, especially after she learns that he has paid the family's debts. Adolfo escapes from jail and immediately goes to look for his beloved Matilde, who has just married Manuel. Desperate, Adolfo manages to secretly speak with Matilde to clarify the misunderstandings. Swearing they will love each other forever, they decide to run away, but Manuel discovers them. Deeply hurt, Manuel is not willing to give her up. He forces her to leave with him, despite her love for Adolfo. After arriving at Manuel's hacienda, Matilde has to put up with Antonia, the former administrator's daughter, who is in love with Manuel.Meanwhile, Adolfo, after an intense and frantic search finds Matilde and, intending to bring her back, poses as Manuel's new administrator. Manuel, unaware of Adolfo's real identity, sympathises with him and gives him a special, friendly treatment. In spite of the situation, Adolfo has to admit that Manuel is a noble, fair man. At that point, Manuel and Matilde discover that they have been victims of Augusta and Humberto's deceit. As time goes by, the subtle attention and Manuel's avid desire end up conquering Matilde's heart. Suddenly one day, she realises that the love she felt for Adolfo has disappeared and that she's fallen in love with Manuel. Matilde tells Adolfo the truth and urges him to leave.Heartbroken, Adolfo accepts his reality and leaves the ranch the same day, that Matilde announces to her husband that she's pregnant. The couple's happiness does not last long. Manuel discovers who his new administrator was and, in an instant, everything falls apart. Matilde's pleas and explanations cannot convince Manuel, he feels betrayed once again and cannot forgive her. Driven by anger, Manuel doubts his paternity and throws Matilde out of the hacienda. Soon after that, he starts a compromising relationship with Antonia that will later make his reconciliation with Matilde more difficult. Manuel and Matilde's relationship will suffer and prosper during times of civil unrest, political and societal intrigue, and subterfuge. Only time will tell whether or not they find 'Real Love' with each other or with someone new.",
  "score": null,
  "genres": [
    "Drama",
    "Romance",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}