{
  "id": 79510,
  "type": "tv",
  "title": "Elizabeth Taylor: Rebel Superstar",
  "releaseDate": "2024-09-27",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/538/1346957.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/538/1346957.jpg",
  "overview": "For too long the story of Elizabeth Taylor has been told as a soap opera. The eight marriages, the diamonds, the addictions. This series gives Elizabeth Taylor the significance she richly deserves, in all her incarnations: as an actor, rebel, business mogul, and activist – to reveal how Taylor created the blueprint for modern celebrity.The series will take a deep dive into Taylor's craft and technique as an actor – one who mesmerised cinemagoers, but also changed the relationship between audiences and stars. We'll see how she reinvented the nature of fame, even as she smashed the glass ceiling in Hollywood, before going on to become a billion-dollar businesswoman, activist and advocate.We'll draw on never-before-heard audio tapes, interviews, and unseen TV footage, alongside rich archive of her movies. The series will also feature interviews with a range of high-profile stars who knew Taylor personally - including Kim Kardashian, who conducted the last interview with her before she died, Dame Joan Collins, a friend and Hollywood contemporary who competed with Elizabeth for the role of Cleopatra, Margaret O'Brien, who went to school with her on the MGM backlot, close friend Carole Bayer Sager, leading scientist Dr. Anthony Fauci who worked alongside Elizabeth in the fight against AIDS, and others. Each has a unique insight into a different aspect of Taylor's story.This definitive three-part series will reveal the life and times of a superstar who transformed not just Hollywood but fame itself, as she went from child star to highest-paid actress in the world.Each episode will examine how she broke down barriers in every part of her life – and the price she paid for defying convention.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}