{
  "id": 77007,
  "type": "tv",
  "title": "Nečista krv",
  "releaseDate": "2021-12-04",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/520/1301434.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/520/1301434.jpg",
  "overview": "Voja Nanovič, the original screenwriter, connected the action of the series as a sublimation of all the novels and short stories of Bora Stankovič into one family saga covering a period of 40 years from the end of the 19th century. Through three generations, Unclean Blood tells the story of the financial, moral and physical decline of a family. The story begins with Hadži Trifun, Sofka's grandfather, and ends with Sofka, i.e. all the characters from Tašana, Paraputa and other works are connected through that one family and people who lived in Vranje.Tryphon, a wealthy leader of the Christian minority in the Turkish Empire, represents the first generation of the family. He tries to meet the moral standards of society and preserve his wealth and his family's reputation, while at the same time fighting against his erotic urges. In order to maintain his power, Tryphon sets in motion a series of events that will have dire consequences for his family members.The second generation of the family is represented by Mita, Tryfun's son, who does not want to be part of his father's dirty business empire. Mita belongs to a group of old aristocrats, whose resources are drying up and who are opposed by new, rich profiteers, uneducated and vulgar. After losing all his wealth and possessions, Mita is forced to marry his most beautiful daughter, Sofka, to a rich man in order to survive.Sofka represents the third generation of the family, which is under complete financial and spiritual decline. Despite being marked by the blood and actions of her ancestors, Sofka tries to rise above the social and historical circumstances of the time in which she lives.",
  "score": null,
  "genres": [
    "Drama",
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}