{
  "id": 75418,
  "type": "tv",
  "title": "Roof of the World",
  "releaseDate": "2015-04-24",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/509/1273046.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/509/1273046.jpg",
  "overview": "The Third Pole (Roof of the World) shows us how Tibetan people live in harmony with nature in an extreme environment, immersing us in the unique charms of Tibet. What we are trying to depict for you are here is the relationship between people living in Tibetan Plateau and nature. We will focus on the incredible and unique nature state, continuous and erect snow mountains, rich and productive land steps, cyclical and round streams, soil and nature, animals, plants, and men coexisting and surviving together on earth.The documentary series The Third Pole (Roof of the World) is China's first documentary about Tibetans living in harmony with nature on the Qinghai-Tibet Plateau. With nature as the backdrop and human activities as the core, it also reflects the inheritance of traditional Tibetan culture, the continuation of traditional lifestyles, and the way the natural environment is being protected. It was released to wide international acclaim and has been regarded as a Chinese TV documentary that has gained significant international recognition. TV and Internet broadcasts have spurred wide interest in the documentary. We find The Third Pole significantly different from previous documentaries about Tibet through its strenuous efforts to gain insights into Tibet, leading to a \"rediscovery\" of this land and its people. The Third Pole provides insightful depictions of Tibetan people's everyday life, showing situations in which common Tibetan people attend to their daily business and capturing their stories with sensitivity. The sweep of this documentary's camera presents viewers with authentic pictures of Tibet's natural and human environment and specific individuals living therein. A striking feature of this documentary lies in its faithful representation of ordinary people's lifestyles at the \"Third Pole,\" which is the Qinghai-Tibet Plateau as seen through an anthropological lens. In Tibet's extreme environment, people have settled on an optimal lifestyle that this documentary shows in an ordinary yet amazing way, opening a space wherein the audience can admire the sublimity of human life in this world. It is a song of humanity; it is a song of nature.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}