{
  "id": 70664,
  "type": "tv",
  "title": "Legend of the Undercover Chef",
  "releaseDate": "2023-08-18",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/539/1349449.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/539/1349449.jpg",
  "overview": "At the end of some dynasty, wokou pirates run amuck and the eunuchs had the imperial power in their hands. Eunuch Cao of the Eastern Bureau colludes with the wokou pirates to slaughter the people of the Chinese martial arts world and plot a rebellion. Changhai is known as the leader of the Magpie Saber Sect and actually a member of a secret anti-wokou-pirate organization. Apart from wiping out the wokou pirates, his other important task is to discover the officials who collude with the wokou pirates. Meanwhile, Eunuch Cao also finds that some martial artists are opposing him, so he secretly assigns his people to monitor all sects. To conceal his identity and proceed with his secret task, Ximen Changhai finds his twin brother, Ximen Changzai, who is living in their hometown, and asks the latter to disguise him. Twins as they are, Ximen Changhai and Ximen Changzai are utterly distinctive in character and choice of life. Ximen Changzai is a vigilant hero while Ximen Changhai is a timid cook. Facing his brother's daring request, Ximen Changzai doesn't agree at first but allured by Changhai's promise to get him a wife, Ximen Changzai still agrees to disguise himself as his brother. As such, Ximen Changzai becomes a leader of a sect and breaks into the thrilling martial arts world. To disguise himself as his brother, the first hurdle Ximen Changzai has to face is his brother's family, aka, Hao Meng, the eldest disciple who is dull and staid, Ms. Ye, who is extremely passionate, Zhao Dezhu, the second disciple, who is reckless and impulsive, and Ximen Rou, the daughter of Ximen Changhai, the most difficult one. Ximen Changzai meant to muddle through in a low key. However, trouble keeps knocking at the door. Gao Damao, the leader of the Celestial Pool Gang, the sovereign of the Five Poison Sect and others all come to him. Most dangerously, Ximen Changzai arouses the attention and suspicion of Eunuch Cao!",
  "score": null,
  "genres": [
    "Comedy"
  ],
  "screenshots": [],
  "systemRequirements": null
}