{
  "id": 74392,
  "type": "tv",
  "title": "Vivo por Elena",
  "releaseDate": "1998-04-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/559/1398313.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/559/1398313.jpg",
  "overview": "Elena (Victoria Ruffo) is a poor young woman who while attending university to gain a degree in psychology, meets a rich young man named Ernesto (Sebastián Ligarde) whose only goal is to be with as many women as possible, through deception and on more than one occasion, drugs.After this Elena refuses to see Ernesto again, and swears off ever falling in love again because she believes herself to be damaged because of Ernesto. Elena then focuses solely on her education and graduating so that she can work and help support her two sisters, Chelo (Cecilia Gabriela) and Talita (Anahi).Chelo is her older sister who was forced to work in a cabaret to support her two younger sisters, Elena and Talita. After graduating she goes to interview at the house of the judge Juan Alberto Montiel (Saúl Lisazo) for the position of particular tutor for Juan Alberto's son who in the absence of his mother Silvia (Ana Patricia Rojo) has become unruly and disrespectful.Upon first interviewing she is turned down because Juan Alberto believes her too young and inexperienced to properly care for his son. Juan Alberto's adopted mother is Rebeca (Julieta Bracho), who coincidentally is the mother of Ernesto, and therefore Ernesto and Juan Alberto are like brothers in the sense that they grew up together.Rebeca believing that Juanito (Imanol), Juan Alberto's son, has been too unruly goes to Elena's house to ask her to take the job because no one else has been interested. Elena arrives at the big house and almost immediately has a profound effect on Juanito and little by little Juan Alberto begins to see a change in his son and realizes that it's all thanks to Elena.Slowly the two, Elena and Juan Alberto, begin to fall in love and as in usual telenovela style there are a whole host of characters that seem adamant in ensuring that the two will not be happy together.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}