{
  "id": 77295,
  "type": "tv",
  "title": "The Princess's Gambit",
  "releaseDate": "2025-06-25",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/539/1349454.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/539/1349454.jpg",
  "overview": " The story is set during a time when the world is divided into three kingdoms. The Wei Kingdom is powerful but embroiled in a fierce struggle for the throne; the Wu Kingdom is focused on development and strategic planning; and the Zhao Kingdom is in turmoil, with Empress Lu controlling the court, putting the country in jeopardy.Princess Jiang Taohua of Zhao, ambitious and determined, seeks to escape Empress Lu's control by arranging a political marriage with Wei. However, upon arriving in Wei, she is attacked by wolves and later wakes up to find herself accused of an affair with Chancellor Shen Zaiye. To stay in Wei, she offers to become Shen Zaiye's concubine, making her a thorn in his side. Despite this, Jiang Taohua, who is poisoned, must fulfill Empress Lu's task to bring down the Crown Prince.Shen Zaiye, while known as a tough and unyielding official, secretly desires to support a wise ruler and strengthen Wei. However, he falls into a trap while investigating palace smuggling, leading to his unintended entanglement with Jiang Taohua. Although Shen sets a deadly trap to remove her, Jiang's willingness to risk her life earns his respect.Forced to live in Shen's household, Jiang faces challenges from Shen's wives and concubines, as well as his combative sister. But having grown up in Zhao's treacherous palace, Jiang easily handles the internal household conflicts. Desperate to complete her mission and get the antidote for her poison, Jiang sneaks out of the estate to seek help, even as Shen keeps a close watch on her.As they clash and outwit each other, mutual feelings start to develop. Jiang soon discovers that the Crown Prince is also Shen's political enemy, and offers to help him take the prince down, along with the various wives and concubines planted by political forces around Shen. The two form an alliance, and as they work together, they manage to expose the prince's crimes to the emperor, causing the fall of the Eastern Palace. However, the struggle for the throne only intensifies from there.",
  "score": null,
  "genres": [
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}