{
  "id": 77824,
  "type": "tv",
  "title": "The Secret Path",
  "releaseDate": "2025-04-28",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/528/1321115.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/528/1321115.jpg",
  "overview": "Yang Guang, Deputy Director of the Third Division of National Security, is caught up in a conspiracy involving an international spy organization during a mission. As a series of unexpected incidents unfold, Yang Guang and his team realize they are facing a crisis that threatens the leakage of national secrets. Sensing an earth-shattering conspiracy lurking behind these events, Yang Guang leads his division to investigate. Amid the escalating crisis, a woman named Zhao Yani becomes the focal point of the investigation. Her identity and actions are shrouded in mystery. At times, she appears to obstruct the uncovering of the truth, making her a prime suspect; at other times, she seems to secretly push events forward, leaving everyone guessing about her true intentions. Faced with carefully laid traps by the enemy, Yang Guang refuses to retreat. Instead, he bravely infiltrates the heart of danger. As the situation intensifies, Yang Guang and Zhao Yani, seemingly from opposing camps, are drawn into a complex vortex where the lines between friend and foe blur. Meanwhile, the real enemy hides in the shadows, waiting to strike. Through trials and relentless battles, Yang Guang remains steadfast in his mission. Thanks to a series of daring moves and sharp decisions, he successfully uncovers and thwarts the enemy's conspiracy, preventing the theft of vital national secrets. Only at the story's end does Yang Guang finally uncover Zhao Yani's unique and mysterious identity, and their long conversation becomes a secret between them. Behind the triumph lies profound personal sacrifice and intense moral struggles. Though the immediate threat has been neutralized, Yang Guang and his team know that in a world full of shifting dangers, new threats are always lurking just around the corner.",
  "score": null,
  "genres": [
    "Drama",
    "Crime"
  ],
  "screenshots": [],
  "systemRequirements": null
}