{
  "id": 79805,
  "type": "tv",
  "title": "Dual Love",
  "releaseDate": "2024-09-27",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/537/1342501.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/537/1342501.jpg",
  "overview": "The \"martial arts alliance's leader\" Xie Mingyuan plans to marry his only daughter Xie Tianba, the \"number one beauty of the martial world,\" to Ningyuan Marquis, the \"dynasty's biggest traitor,\" as a concubine. In a fit of anger, Xie Tianba leaves her home at Mount Yanhua for the first time to survive in the martial world, which she knows nothing about. She runs into Storm Sect's leader Mo Haoran, who saves her from a predicament. Xie Tianba, who carries on the legacy of her mother from Medicinal Sect, immediately detects the strange poison Jialanxiang in Mo Haoran's body. Out of gratitude and pity, she repeatedly relieves him of his poison pains, and the two slowly fall in love. When the righteous sects gather to suppress the evil sect, Xie Tianba realizes her father is actually the so-called unparalleled villain: the evil sect's leader! To protect Mount Yanhua, Xie Tianba hangs around the martial arts alliance to gather intel. But Mo Haoran makes use of her trust to trick her into leading the righteous sects to attack Mount Yanhua. Xie Tianba would rather die than surrender, and exhausts her powers to protect her juniors, while Mo Haoran fights desperately to save her. Xie Mingyuan, who has evacuated early, tells Xie Tianba that Mo Haoran is Shen Wugui, the Ningyuan Marquis. Five years ago, to save the 13-year-old young emperor, Ningyuan Marquis was poisoned with Jialanxiang. His powerful uncle also recruited righteous sects to form the \"Blood Buddha\" to assassinate loyal courtiers. Thus, Ningyuan Marquis changed his name to Mo Haoran and teamed up with the \"evil sect's leader\" Xie Mingyuan along with Storm Sect to set the stage. Ultimately, he defeats the sects behind the \"Blood Buddha\". Peace is restored in the martial world and the government, and Ningyuan Marquis dies of poisoning despite his outstanding achievements; However, Storm Sect's leader Mo Haoran is saved by Medicinal Sect's descendant, and the two of them live happily ever after.",
  "score": null,
  "genres": [
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}