{
  "id": 77366,
  "type": "tv",
  "title": "Kard Chuek",
  "releaseDate": "2015-01-29",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/521/1302833.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/521/1302833.jpg",
  "overview": "Pho, the only district in the central basin, is controlled by Thongkam. He's a rich and influential man who gained his wealth through illegal activities. No one dares to fight him; even authorities are scared of him. However, one day a young and fearless stranger called Thanu appeared. He has the kind of Kard Chuek skills that have never been seen before. He becomes a threat to Thongkam. Lamai and Lamian are sisters. They inherited a big market in Pho after their parents died. Although sisters, the two girls have extremely different personalities. Lamai, the oldest, is arrogant and values money over everything, but deep down she's a good person. Lamian has a strong personality with a bad temper and constantly pesters her sister to break up with her boyfriend Thongdee, son of Thongkam. Lamian knows they're not good people but Lamai refuses to believe her. Boonsom is a hot headed and aggressive young man. He's one of the most skillful Kard Chuek fighters in Pho, which makes both Thongkam and Thongdee see him as a threat. Thongkam frames him for murder and Boonsom's mother falls ill after seeing her son getting arrested. Lamai takes care of her despite her dislike for Boonsom. Thanu is interested in Lamai, but she doesn't hide her hatred for him. She only has eyes for Thongdee. Everyone thinks that her parents' death was an accident, but they were actually murdered by Thongdee. This is because he learned the parents were upset at Lamai's relationship with him. Boonsom is released from jail and works hard to become a police officer. His relationship with Lamian changes over time. Thanu and Boonsom join forces to fight against Thongdee and Thongkam.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}