{
  "id": 74771,
  "type": "tv",
  "title": "Brocade Odyssey",
  "releaseDate": "2024-11-30",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/545/1364196.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/545/1364196.jpg",
  "overview": "\"Brocade Odyssey\" tells a courageous and determined tale of overcoming challenges. It follows the legendary journey of Ji Yingying, a fiery and spirited woman from Shu, as she grows from a young girl at a dyehouse into a master craftswoman. During the Tang Dynasty, the beauty of Shu brocade was renowned worldwide. Nobles and the rich coveted it, and the military even used brocade as a form of payment. Under the thriving brocade industry in Yizhou, unseen tensions developed beneath the surface. The Ji family's Shu Red Silk, renowned for its unparalleled quality, was so highly sought after that it earned the saying, \"Shu Red outshines all reds.\" Yet, this very reputation led to tragedy. The Ji family became caught in a fake brocade scandal, resulting in the unjust death of Ji Yingying's father and the family's overnight downfall. From a young age, Ji Yingying demonstrated intelligence and a passion for dyeing silk. Her natural talent grew, and she vowed to restore the glory of the Ji family's brocade business and clear her father's name. However, her journey was filled with obstacles, particularly from Zhao Xiuyuan, the son of the prominent Zhao family, whose unrequited love for her turned into hostility. Yang Jinglan, the illegitimate son of the prestigious Brocade Master family, returned to Yizhou after years of study abroad. Despite his reputation as a frivolous and short-lived official, he patiently navigated through court and society to uncover the truth behind the long-buried mystery. His path crossed with Ji Yingying, the spirited girl who had left an indelible impression on him during childhood. Together, they tackled crises and challenges that threaten the brocade industry. Ji Yingying's innovative dyeing techniques earned her fame across Shu, drawing the attention of Sheng Fengze, the king of Nanzhao State, who had long coveted the secrets of various brocade houses. As Nanzhao's aggressive tactics put Yizhou in peril, Ji Yingying took risks to protect her fellow artisans. Meanwhile, Yang Jinglan ventured into Nanzhao, joining forces with Ji Yingying to negotiate and safeguard the brocade trade. Their collaboration revived the brocade industry and left behind a timeless tale of Shu brocade's legacy.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}