{
  "id": 76589,
  "type": "tv",
  "title": "An Actor's Rhapsody",
  "releaseDate": "2023-04-28",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/527/1317587.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/527/1317587.jpg",
  "overview": "This is a story about a wildly imaginative capitalist who fully finances a production team to fulfill his various dreams of being the male lead in historical dramas. His crazed rewriting of the script results in a disjointed storylines. The lowly and poor screenwriter is powerless to resist, desperately trying to fill in the gaps and inconsistencies despite their impending hair loss. The result is a complete departure from the original style, with character development constantly not working out. From palace harem to suspense, from suspense to fantasy, from fantasy to martial arts, from martial arts to palace life, and from palace life to time travel... breaking through the dimensional wall. All types of historical dramas gather together, diverging into a melting pot of themes. With their efforts, the fantasy genre will be introduced to geographical continental plates for the first time; the cold-faced male lead's soul is actually a piece of ancient ice that has existed for thousands of years; the palace harem is unusually harmonious, with deep sisterly bonds; the case-solving suspense of the imperial guards is full of suspense but the murderer is never found throughout the show; a scholar on the road to the imperial exam is unexpectedly crowned the champion of the martial world through a rich girl's investment; the male fox, who is both good and evil, and the female demon-hunter, who switches personalities frequently, are unable to resist temptation and become enemies due to love. Even the protagonist's friend's dog, brought on set during a visit, is turned into a spirit to add to the story, with a romantic subplot added... However, behind all the absurdity, you will discover that he is an actor pursuing his dreams and redemption with unbridled passion.",
  "score": null,
  "genres": [
    "Comedy"
  ],
  "screenshots": [],
  "systemRequirements": null
}