{
  "id": 77029,
  "type": "tv",
  "title": "Momposina",
  "releaseDate": "1994-05-20",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/519/1298203.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/519/1298203.jpg",
  "overview": "This series that initially takes place in 1920 tells the story of the deep and eternal love between Rosa Lenoit \"La Momposina\" and Alejandro Molinares, as well as the confrontation between their two cities, Santa Cruz de Mompos and Nuestra Señora de La Candelaria del Banco, both located on the banks of the Magdalena River in the Colombian tropics. Without meeting Alejandro yet, in Mompos, Rosa is pressured by her parents to accept Captain Rito Perilla as a boyfriend, a man much older than her who is truly in love and has also promised the girl's father, General Trinidad Lenoit, settle in this port with his steamboat company if she becomes his wife.On the other hand, at the Bank, Alejandro's father, \"El Galeno\" Molinares, a man with great vision, insists on turning his population into the most advanced of his time in the country, always wanting to overshadow the successes of the Lenoit family. To this end, he builds a theater to represent opera, and associates with the German Hindenbur to bring a seaplane and thus inaugurate the first aviation company in the country. Alejandro, for his part, only observes the activities of his father without paying much attention to them. His job is to make all the women of the town fall in love and go from party to party with his friends. But one day his life changes when he meets Coralina, the beautiful dancer who comes to town with a French opera company and with whom he flees the town to marry. But one day, after each one has formalized their relationship, fate unites Rosa and Alejandro. Together they know love. From this moment on, all the conflicts that will confront the cities of Santa Cruz de Mompos and Nuestra Señora de La Candelaria del Banco appear, and separate the protagonists.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}