{
  "id": 72334,
  "type": "tv",
  "title": "The Justice",
  "releaseDate": "2023-10-30",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/484/1210266.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/484/1210266.jpg",
  "overview": "The Justice' is a realistic television drama with significant legal and social significance. The series revolves around Qi Heng, the newly appointed deputy chief judge of the Intermediate People's Court in Qizhou City, who upholds the principle of fairness and justice above all else. With an extremely responsible attitude towards society, he takes on the 'fishing boat murder case' as a starting point and works in cooperation with the police and procuratorate to overcome pressure and interference from corrupt businessmen like Luo Huaigong, and delivering fair judgments in a series of complex cases. Throughout the process, Qi Heng's noble character and deep sense of compassion deeply affect his brother-in-law, Guo Lun, ultimately untangling the emotional entanglement that Guo Lun had held onto since Qi Heng sent him to prison years ago for upholding justice. With Guo Lun's assistance, and based on the investigations into the 'fishing boat murder case' and the 'chemical plant pollution case in Jiang County', Qi Heng gradually uncovers the truth behind his wife Guo Nian's disappearance five years earlier, bringing all the suspects to justice. The series aims to help Chinese audiences understand the country's judicial system and legal concepts, and to strengthen faith in the rule of law and culture. It mainly showcases the tremendous progress made in judicial reform over the past few decades, extolling the honesty and impartiality of the nation's judges. It firmly underscores that any endeavors by influential financial powers to manipulate society or subvert the law will be met with resistance and judgment by a cadre of ethical and upright judges, who wield the might of the law. These judges remain uncorrupted and unswayed, resolutely upholding the sanctity and integrity of the legal system.",
  "score": null,
  "genres": [
    "Crime",
    "Legal"
  ],
  "screenshots": [],
  "systemRequirements": null
}