{
  "id": 71952,
  "type": "tv",
  "title": "Stay Young Stay Passion",
  "releaseDate": "2023-10-15",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/481/1203222.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/481/1203222.jpg",
  "overview": "The story opens with the failed uprising in 1927. Foshan Communist Party members Chen and his wife died tragically to provide cover for their comrades. Years later, their three children go on to make spectacular achievements in the field of Cantonese medicine, cuisine and opera to earn fame in all of Guangzhou, staying true to their intentions even in wartime.Due to the drastic countermeasures against the revolutionaries in Guangzhou on April 15, 1927, CCP underground members Chen and his wife died heroically and their three children were adopted by ordinary people. The eldest son Chen Shan He becomes an apprentice of medicine, the second son Chen Qing Wei becomes a chef, and the youngest daughter Chen Li Xia becomes an opera performer. Under the tutelage of their respective masters, they become legends in their own fields.Just as they are about to take revenge on the enemy who killed their parents, war breaks out in Guangzhou causing the fates of the three individuals to also change dramatically. Chen Shan He engages in a seven-year struggle with Japanese merchants to protect the secrets of traditional Chinese medicine. He also devotes everything in the deadly fight against Japan's biological weapons.Chen Qing Wei refuses to betray his country so he leaves for Hong Kong to promote Cantonese cuisine. He returns to Guangzhou with a successful career and helps his brother in their efforts to save the people. Chen Li Xia leads the performance troupe during the war, continuing to improve her craft and learning to find a balance between their harsh reality and the beautiful world of opera. The three siblings adhere to their national integrity amidst the severe trials of war to pass on their respective skills.",
  "score": null,
  "genres": [
    "Drama"
  ],
  "screenshots": [],
  "systemRequirements": null
}