{
  "id": 71680,
  "type": "tv",
  "title": "Navajo Police: Class 57",
  "releaseDate": "2023-10-17",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/481/1204483.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/481/1204483.jpg",
  "overview": "Navajo Police: Class 57 Set against the sweeping backdrop of the Navajo Nation,NAVAJO POLICE: CLASS 57 is a three-part documentary series following a group of recruits over the course of one year, as they fight their way through the Navajo Police Training Academy and out into the field, where they must contend with rising crime and centuries of neglect to hold their community together. For this cadre, known as Class 57, the pressure is fierce, and the stakes are high as the survival of their sovereign nation depends in part on the success of this academy.The Navajo Nation is the largest Indian reservation in the United States, with a landmass the size of West Virginia and a population of over 190,000 people. Yet, the Navajo Police Department (NPD) has just 180 police officers. With pressure on the department to increase numbers, the NPD has become the only tribal law enforcement agency in the country with its own Police Academy. All of the recruits are Navajo and drawn from the community, but with an attrition rate of over 50%, the training officers have their work cut out for them. NAVAJO POLICE: CLASS 57 follows the officers and recruits through the rigorous training, the physical challenges, and the self-doubt, delving into their backstories to reveal an overview of life on the reservation and the motivations that drew them to the force. While the turbulent stories of Class 57 unfold in real time, the series provides an ever-widening portrait of the Navajo Nation at large. The Nation's deep sense of kinship grounds efforts to address a range of social issues police encounter on the job – alcoholism, drugs, violence, and domestic abuse – issues that many of the recruits have to deal with in their own extended families, leading to dramatic intersections of the personal and the professional, the past and the present. In this unique social and cultural context, the NPD stands as a microcosm of the Navajo Nation itself, revealing its history, uncertain future, and its resiliency.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}