{
  "id": 74390,
  "type": "tv",
  "title": "Fighting for Love",
  "releaseDate": "2024-01-31",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/502/1255381.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/502/1255381.jpg",
  "overview": "The story follows Amai, a female general of the founding era of the Southern Xia dynasty, who discards her feminine attire and dons battle armor, enduring hardships to become a legendary female warrior. Amai (Zhang Tianai), the daughter of the Duke of Jingguo in Southern Xia, witnesses her entire family being killed by her childhood friend Chen Qi. Years later, Amai, now a young girl, disguises herself as a man and roams the martial world, seeking revenge against Chen Qi. Through a series of coincidences, Amai saves Shang Yizhi (Zhang Haowei), the son of the Grand Princess, and subsequently helps him escape from dangerous situations multiple times, intertwining their destinies. As war breaks out, Amai sheds her feminine attire and joins the military, becoming an infantry soldier. With her exceptional military talents, she achieves remarkable feats and rises to the rank of General Mai. Alongside this, she assists Shang Yizhi, who is hunted and faces difficulties, in finding his true self and accomplishing great deeds. On the battlefield, Amai repeatedly clashes with General Chang Yuqing (Wang Ruichang) from the enemy forces. Despite their confrontations, they unintentionally go through life-and-death situations together, developing a mutual understanding and respect. However, faced with the brutality of war, Amai willingly sets aside personal attachments and uses her youth and fervor to defend her army. Eventually, after the war's victory, Amai leaves the military, returns to her female identity, retreats from the world, and ultimately finds her own happiness.",
  "score": null,
  "genres": [
    "Action",
    "Romance",
    "War"
  ],
  "screenshots": [],
  "systemRequirements": null
}