{
  "id": 74525,
  "type": "tv",
  "title": "Secrets of a Murder Detective",
  "releaseDate": "2024-03-20",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/515/1287964.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/515/1287964.jpg",
  "overview": "The series, presented by former Scotland Yard Homicide Detective Inspector Steve Keogh, invites viewers into the intriguing realm of crime solving. With 30 years of experience under his belt including twelve years of service as a murder detective at the Metropolitan Police, Steve is opening up his contact books for the first time to reveal the secrets of what it really takes to be a murder detective on the frontline.Each episode unfolds as a gripping narrative, with Steve setting the scene and tone of each murder case. The series takes viewers on an immersive journey through the crime and  its investigation, from the beginning to the pivotal breakthrough leading to conviction. Steve provides unique and authentic insights into the intricate workings of investigations and the minds of detectives, bringing viewers into the heart of each case.In the series, we'll see Steve in conversation with leading officers on each case, as they share personal  memories of the investigations. Additionally, viewers will also hear from key experts and family members for each case, as the investigation's timeline is followed. Another key focus of the series is the use of modern investigative techniques and tools and the innovative ways experts on each case use these to solve the murders.Cases include the story of soap actress Sian Blake and her two sons, who were murdered by her partner in 2015 and how the investigation evolved from a mid-risk missing person case to a homicide one. The series also explores the 2013 murder of 17-years-old Champion Ganda, who was a victim of a knife crime in East London. The episode gives viewers first-hand insight by Steve and other investigators who worked on the case, into the difficulties of similar cases with lack of leads and suspects. In another episode, viewers will learn more about Dena Thompson, known in the British press as ‘The Black Widow' and the investigation into the deaths of her previous partners.Secrets of a Murder Detective offers a riveting blend of suspense, education and celebration of exceptional detective work, providing viewers with a unique behind-the-scenes look at recent cases.",
  "score": null,
  "genres": [
    "Crime"
  ],
  "screenshots": [],
  "systemRequirements": null
}