{
  "id": 79076,
  "type": "tv",
  "title": "WISE GUY David Chase and The Sopranos",
  "releaseDate": "2024-09-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/534/1335643.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/534/1335643.jpg",
  "overview": "25 years after the show first debuted, HBO's paradigm-shifting series \"The Sopranos\" remains a cultural phenomenon and a touchstone for prestige television. In WISE GUY David Chase and The Sopranos, acclaimed filmmaker Alex Gibney delves deep into the psyche of renowned \"Sopranos\" creator and writer, David Chase, to illuminate his life and career while offering a unique window into his unparalleled work on the iconic program.On a replica set of Dr. Melfi's psychiatrist's office, Gibney flips the script on David Chase, excavating and analyzing the origins of \"The Sopranos,\" his creative process, and the intimate connections between his own life and many of his characters. Joined by show writers, producers, executives, and actors, including Lorraine Bracco, Edie Falco, and Michael Imperioli, the documentary offers insight and inspiration along with a stunning array of clips from the show, early audition videos from many of the cast members, and behind-the-scenes footage to take the viewer into the vibrant \"Sopranos\" world. From his own upbringing in an Italian American family in north New Jersey, with a complicated mother and a fascination with cinema, Chase details his entrée into Hollywood, where he wrote for a multitude of television shows, and his relationship with HBO as he pitched and developed his anti-hero mobster Tony Soprano. With candor and self-reflection, Chase digs into the challenges of running a successful show, the inevitable \"deaths\" of some of the show's favorite characters, and his creative working relationship with the late James Gandolfini. WISE GUY David Chase and The Sopranos takes us into the writers' room, from the inspirational pilot to the controversial final episode, demonstrating how a show about a multi-layered mob boss became a cultural milestone, a beloved fan-favorite, and a revolutionary television sensation.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}