{
  "id": 76426,
  "type": "tv",
  "title": "Hard Noble Lady",
  "releaseDate": "2024-08-15",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/531/1328800.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/531/1328800.jpg",
  "overview": "The young and successful CEO Liu Xi is a capitalist at work and a playboy in his personal life. He often belittles women, causing much distress and harm to the women around him, yet remains unaware of his behavior. One day, an unexpected accident occurs, and Liu Xi's soul is transported into the strict household of a marquis, where he becomes Liu Xizhao, a young lady who is bullied by various forces within the household due to her high-status marriage. Liu Xizhao's husband is Lu Shaoyang, the frivolous fourth son of the Changping Marquis household. When Liu Xizhao, with his modern scoundrel mindset, clashes with the ancient playboy Lu Shaoyang, the two are completely incompatible. Liu Xizhao shocks Lu Shaoyang with his bold and unconventional actions. Before Liu Xizhao can adjust to his new identity, his mother-in-law drags him off to learn the household rules. Unable to accept the constraints of traditional female roles, he becomes desperate to escape. In his eagerness to return, Liu Xizhao defies the marquis household's rules, leading to his house arrest. Trapped in the back courtyard, Liu Xizhao is forced to endure the oppressive patriarchal customs and begins to understand the difficulties of being a woman. He is judged by traditional moral standards, finally grasping what it means to be indoctrinated and morally constrained. To protect his friends and himself from harm, Liu Xizhao embarks on a journey of leveling up and battling adversaries. He becomes proficient in the intricacies of household scheming, power struggles, and business warfare. Armed with his unique worldview and modern business acumen, he blazes an unstoppable path to victory.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}