{
  "id": 74071,
  "type": "tv",
  "title": "Bring the Drama",
  "releaseDate": "2024-02-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/503/1259763.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/503/1259763.jpg",
  "overview": "Bring the Drama is the new six-part series from BBC Arts and Wall to Wall Media for BBC Two and iPlayer opening up the world of screen drama to eight people who have always dreamt of becoming professional actors but have never had the opportunity.Hosted by actor and comedian Bill Bailey, the eight aspiring actors are mentored over six weeks by renowned casting director Kelly Valentine Hendry, who has cast shows including Bridgerton, Gangs of London, Ghosts and Broadchurch. In each episode, the aspiring actors are welcomed onto some of the real-life sets from celebrated UK dramas such as Peaky Blinders, EastEnders and Silent Witness and tasked with working together to recreate iconic scenes with the real scripts, real cameras and the real time pressures that professional actors face. As they gain experience in different forms of screen acting they are given advice and guidance from a host of established actors including Natalie Cassidy (EastEnders); Genesis Lynea (Silent Witness, Champion); Charles Venn (Casualty, Dream Team); Ed Speelers (Downton Abbey, You) and Rochenda Sandall (Line of Duty, The Rig), as well as working with industry experts from the Peaky Blinders fight co-ordinator to the intimacy co-ordinator from Sex Education.As the eight discover, the job of a screen actor is far from easy - and each production provides new challenges and opportunities for the actors to learn and find out whether they have the talent and skills needed to take the next step into the professional industry. At the end of the intense learning process, casting director Kelly selects three actors she feels are industry-ready to present their showreel at a major industry showcase for the chance to secure representation from a leading agent.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}