{
  "id": 86043,
  "type": "tv",
  "title": "Keibuho Yabe Kenzo: Zunou vs Zumou",
  "releaseDate": "2017-03-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/579/1447814.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/579/1447814.jpg",
  "overview": "The arrogant Yabe Kenzo, who has been unwittingly solving difficult cases thanks to a combination of good luck and mix-ups around him, returns with his subordinate Akiba Harando, the computer nerd. Although the submissive Akiba does not shrink back from Yabe's treatment, something unusual arises in their relationship this time. Yabe finds himself squaring off against his strongest rival to date. Genius scientist Deep Manabu, who has invented \"God Eye Joe\", artificial intelligence customized for criminal investigations, has been solving successive cases that even the FBI and Scotland Yard have given up on. He announces that he will use it to catch a murderer called the \"referee of the dark\", whom the Japanese police are helpless against. With no room to maneuver, the police commissioner assigns Yabe to be the full-time investigator in order to shift responsibility. Unaware of this, Yabe heads to a hot spring area with eyewitness sightings of the \"referee of the dark\" in high spirits. There is a landslide, and an inn is cut off like a remote island. Then, a company president who is a guest at the inn is murdered. Under Yabe's supervision, the proprietress of the inn, Yamakawa Tamao and her guests split into groups to search the surroundings for clues. The murderer's personal effects are discovered in the direction of the woods, and Yabe gives chase with Akiba. Meanwhile, Deep Manabu has been at work on analyzing the case. A fierce battle of wits is about to unfold between the man with the wig and the man who uses artificial intelligence in the investigation of this bloodthirsty killer.",
  "score": null,
  "genres": [
    "Comedy",
    "Thriller",
    "Mystery"
  ],
  "screenshots": [],
  "systemRequirements": null
}