{
  "id": 86363,
  "type": "tv",
  "title": "Can Bağı",
  "releaseDate": "2025-08-07",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/582/1455576.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/582/1455576.jpg",
  "overview": "Mahinur Kılıçtan, a hard-working mother, lives in a cordial, traditional neighbourhood with her daughter, Bade and her deceitful husband, Kenan. For some time now, Bade has been frequently falling ill, forcing Mahinur to leave her job as a cleaner at one of the Yılmazer Holding hospitals. Now, she bears the entire responsibility of providing for her family by taking on temporary cleaning jobs.Aras Yılmazer, Mahinur's former employer, lives in a family mansion that has been passed down through generations, sharing the grand residence with his daughter Derin, his mother Selvihan, his aunt Leyla, and his cousin Ejder. Aras's wife, Banu, tragically passed away due to certain complications during their daughter's birth. After her death, although Aras refrained from pursuing a new relationship for some time, he eventually became engaged to Pelin—a woman from a similarly prominent family and now a management executive at the hospital—to provide Derin with a stable family life.When fate reveals the heart-wrenching truth that Mahinur and Aras's daughters, Bade and Derin, were switched at birth, a devoted mother and a businessman find their worlds colliding in unimaginable ways. Bound by the desperate need to save the life of Bade, who was diagnosed with hemolytic anaemia, they enter into a marriage of convenience to bring a sibling into the world, who can become a stem cell donor. Yet, as they navigate the delicate threads of secrets, sacrifices, and a carefully crafted facade, an unexpected love begins to blossom—turning their unlikely union into a tale of redemption, healing, and the power of the heartstrings.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}