{
  "id": 86444,
  "type": "tv",
  "title": "Fall in You",
  "releaseDate": "2025-08-16",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/583/1457580.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/583/1457580.jpg",
  "overview": "Qiao Yan's life is turned upside down when her parents are suddenly killed in a car accident. Overnight, she goes from being their beloved little princess to a lonely orphan. Soon after, Gu Changfeng, the chairman of the Gu Corporation and a man claiming to be her biological grandfather, appears and insists on bringing her back to China. Though reluctant to return to the Gu family, Qiao Yan is troubled by the many suspicious details surrounding her parents' deaths. Determined to uncover the truth, she agrees to go back and begins to approach her so-called \"uncle,\" Gu Jingyuan, the adopted son of the Gu patriarch. At the Gu household, she plays the part of a meek and pitiful orphan, trying to win over Gu Jingyuan. But he remains cold and indifferent, unmoved by her act. A hidden battle begins between the two, each equally matched in wit and will. Just as Qiao Yan becomes convinced that Gu Jingyuan is the one behind her parents' murder, he risks his life to save her from a raging fire, and confesses his desire to protect both her and the Gu family. Shaken, Qiao Yan begins to understand his pain, and in that understanding, falls deeply in love with him. Their forbidden love weathers countless trials. But just as they finally decide to defy Gu patriarch's opposition and walk into marriage with open hearts, a far greater conspiracy crashes down upon them. To protect each other, they are forced to hide their true feelings, caught in a storm of searing love and bitter suffering. Amidst the chaos, they use their own flesh and blood to shield each other from the oncoming storm.",
  "score": null,
  "genres": [
    "Drama",
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}