{
  "id": 80540,
  "type": "tv",
  "title": "Artist of the Year: Masterclass",
  "releaseDate": "2024-12-02",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/546/1366247.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/546/1366247.jpg",
  "overview": "Sky Arts' much-loved Artist of the Year franchise has added another brushstroke to its canvas with a brand new series of Masterclasses launching later this year. Artist of the Year: Masterclass will feature live tutorials from a host of talented artists who have taken part in Portrait Artist of the Year or Landscape Artist of the Year, as they demonstrate easy-to learn techniques for budding artists at home. Series judge, Tai-Shan Schierenberg, will also take to his easel to teach masterclasses of his own, showing the nation how he approaches an all-important portrait. The new Sky Original series follows the roaring success of Portrait Artist of the Year, the eleventh series of which launched to its biggest audience ever last month. Millions of viewers also tuned in to Portrait Artist of the Week in 2020, which saw celebrities sit live for their portraits during the Covid-19 lockdown. The series went on to break the Guinness World Record last year for the most people painting a portrait at one time as thousands of avid artists painted national treasure, Sir Lenny Henry, to celebrate Portrait Artist of the Year's tenth anniversary.Artists giving masterclasses alongside Tai-Shan Schierenberg include: Gareth Reid, who was crowned Portrait Artist of the Decade last year, Adebanji Alade, Wendy Barratt, Morag Caister, Finn Campbell-Notman, Phoebe Hicks, Christian Hook, Clare Lord, Sara Reeve and Fujiko Rose. Each masterclass will focus on a different subject or technique to help audiences understand the basics of painting and drawing, with classes covering everything from exploring tone and Alla Prima painting to composing a landscape, botanical flowers and even animal portraiture.  ",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}