{
  "id": 83705,
  "type": "tv",
  "title": "The Man Who Wanted to Change the World",
  "releaseDate": "2025-03-25",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/561/1404199.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/561/1404199.jpg",
  "overview": "This series is designed for viewers who know Mauro Rostagno and especially for the many who know nothing about him. Dedicated to all is this passionate journey around the prism of this extraordinary figure, to that existence of his that was capable of transforming itself into many different lives crossing different eras and forms of struggle, with its charisma and its need to change without, however, ceasing to obey the same guiding principle: the constant desire to heal himself and the world.It is a journey that culminates with his murder and the years of research that were necessary to obtain truth and justice, in the labyrinth of incompetence, concealment of evidence, and disinformation.Rostagno was a ray of light that shone in Italian history for 20 years, from 1968 to 1988, spanning the youth struggles of 1968, his experience at the top of the far-left political group Lotta Continua, the founding of the Milanese social center for political activism and creative expression Macondo, his membership in Osho's ashram in Pune or the creation of his Sicilian ashram, transformed into a rehabilitation center for drug addicts, Saman. He has always been part of something, without allowing that something to swallow him up, label him, steal his invincible originality and uncomfortableness. After Rostagno's murder on September 26, 1988, the investigation was lost in a thousand directions: was it a crime of passion, a family crime, an internal settling of accounts within his own community, a revenge by his former comrades in Lotta Continua, or perhaps the 'elimination of an inconvenient and unwilling witness to dangerous clandestine arms trafficking, in which Freemasonry and Italian secret services were involved? A long painful, exhausting slalom before ascertaining the truth: that it was the Mafia that killed Mauro, which Rostagno was stubbornly investigating, which he was fighting against with his fierce irony and indefatigable intelligence.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}