{
  "id": 84858,
  "type": "tv",
  "title": "1983",
  "releaseDate": "2023-11-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/569/1424981.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/569/1424981.jpg",
  "overview": "Elizaveta Listova's documentary is dedicated to one of the most tense and least known periods of the Cold War. Unlike the Cuban Missile Crisis, when the world stood on the brink of nuclear war in front of everyone's eyes, the events of 1983 developed in such a spontaneous way that humanity could perish without even realizing what had actually happened.In 1983, at the peak of a zealous political battle with its salvos of the main propaganda calibers, a whole series of random events occurs, each of which only miraculously does not become the beginning of the end of civilization.On the night of September 1, 1983, a foreign plane was shot down by the Soviet military off the Far Eastern coast, having penetrated more than 500 kilometers into the country's airspace. By all indications, the plane was an American reconnaissance aircraft - such aircraft often flew along the coast of the USSR, but it turned out to be a civilian aircraft of Korean Airlines, which for unknown reasons had deviated from its usual course.Almost a month later, at the command post of the space echelon of the missile attack warning system, an alert was triggered about the launch of nuclear missiles by the Americans towards the USSR. The entire political background spoke of the regularity of this event. But in the few minutes that were given to the combat crew to analyze the situation, the commander of this crew figured out that the alert was false, a malfunction of the system itself, and interrupted the chain of information that would inevitably lead to the command to launch nuclear missiles in response.But a month later, the strategic forces of the Soviet Union were put on heightened combat readiness. Because, according to the Soviet military, the American strategic forces were put on readiness No. 1 - \"a nuclear war is inevitable.\" It took titanic operational efforts by the intelligence services of the USSR and the GDR to understand that the highest combat readiness declared by the Americans was a training exercise. NATO countries were conducting large-scale exercises to practice launching nuclear missiles with new codes and a radio silence regime that left their opponents no chance to distinguish the exercises from reality. This could have been another point of no return. And the Americans did not immediately learn about the Soviet Union's hyperreaction. And when they did, they did not immediately believe that the Union seriously feared that the United States would use nuclear weapons first.Both of these potentially fatal incidents were never public knowledge. But they are the ones that bring the most important player to the field of political games - chance. The documentary film \"1983\" will be devoted to the role of chance in history.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}