{
  "id": 83694,
  "type": "tv",
  "title": "The Piano",
  "releaseDate": "2025-05-04",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/563/1409461.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/563/1409461.jpg",
  "overview": "To celebrate World Piano Day, the ABC is pleased to announce the highly anticipated new series, The Piano will premiereSunday 4 May at 7.30pm on ABC TV, with all episodes available to watch same day on ABC iview.Hosted by Amanda Keller, the heartwarming six-part arts series will explore how the piano has the power to transform the lives of everyday Australians, creating refuge, joy and friendship via the touch of a key. Invited to perform at unique locations around the country, this series offers Australians the chance to showcase their piano playing talents. These pianists will turn public spaces into hubs of musical brilliance, captivating shoppers, commuters, and passersby as they pause in awe of the performances.But all is not what it seems. What the pianists don't know, is that they are being observed by two renowned expert musicians, multi-award-winning musical powerhouse Harry Connick, Jr. and one of Australia's greatest classical concert pianists, Andrea Lam.Hidden away during each performance and watching every note played, they've been tasked with choosing a pianist from each location to mentor. They will then prepare them for a life changing performance at one of Australia's most revered stages, the Sydney City Recital Hall.  Performing Bach to Beethoven, INXS hits to Taylor Swift's ‘Love Story', these extraordinary pianists from all walks of life will take audiences on an unforgettable piano playing journey.Set to share their passion for the piano, these everyday Aussies will also share deeply personal stories about their favourite instrument and how it has shaped their lives. ",
  "score": null,
  "genres": [
    "Music"
  ],
  "screenshots": [],
  "systemRequirements": null
}