{
  "id": 86761,
  "type": "tv",
  "title": "Rise of the Dictators",
  "releaseDate": "2024-10-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/584/1461886.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/584/1461886.jpg",
  "overview": "Dictator, despot, authoritarian or strong man, whatever you call them they all have one thing in common – the pursuit of absolute power. ‘Rise of the Dictators' is the story of the Führer, Adolf Hitler; il Duce, Benito Mussolini and the Vozhd Josef Stalin. How did these men take absolute power? How did they use it? What did they say? And what did they do?But there is much more if we are to comprehend the dictators – their support, their power, their legacy of destruction. By telling their story we also look at the way in which they have influenced the strong men, autocrats and dictators that followed Augusto Pinochet, Muammar Gaddafi, Nicolae Ceaușescu, Mobutu Sese Seko, the Kim dynasty of North Korea; the list of those who followed in the footsteps of Hitler, Stalin and Mussolini is both shocking and diverse. The uniting feature of all these men is how they built upon the lessons learnt from these pivotal dictators of the 20th century.Told through six themed episodes ‘Rise of the Dictators' explores how dictators rise to power, the personality cults used to foster support, the money required to support their regime, the repression employed to maintain control, the desire to extend their reach beyond their own borders and finally what happens when a dictators reign ends. Dictators are not forged in isolation. They are, in many ways, a reflection of the society that allows them to flourish. Using revealing film archive and imagery, expert interview, animation and graphics, ‘The Rise of the Dictators' provides a compelling insight into the fragility of democracy, and the frightening resilience of authoritarianism.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}