{
  "id": 84409,
  "type": "tv",
  "title": "The Secret Headliner",
  "releaseDate": "2025-05-11",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/566/1416208.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/566/1416208.jpg",
  "overview": "In each episode, one of Ireland's biggest musical acts will offer the opportunity of a lifetime to an up-and-coming artist – a chance to share the stage as their Support Act. As the Secret Headliner returns to their roots to play a secret gig in a small venue that was central to their journey to success, they have the chance to \"give back\" by offering support and mentorship to an emerging act who dares to dream.Each episode features the origin story of the Secret Headliner, charting their rise from small venues to hit albums, diamond status streaming, and sold-out arenas and international tours.Hundreds of emerging artists provide a demo song or short set on video for consideration. The Secret Headliner selects their pick and delivers this exciting news personally to their chosen Support Act. The Support Act is now one of the very few people who know the identity of the Secret Headliner.The Secret Headliner selects the venue, a small space that was central to their journey to stardom – it might be the venue where a particular gig led to their record deal, or where they had their first ticketed show – where only 50 people turned up … and half of them were family and friends!Everything then builds to the Secret Headliner gig. The Support Act hones their set, reacts to this huge opportunity, and talks of their hopes and dreams. The identity of the established artist remains a secret to the attending audience until they walk on stage at the Secret Headliner gig. Meanwhile, the event publicist gets the Support Act in front of the press to help raise their profile, build a buzz, and drive an audience for the big show. The tension builds as the Support Act's nerves kick in. The audience begins to queue outside, as soundchecks are completed. Doors open and it's showtime - the biggest gig for the Support Act, a return to the most intimate of performances for The Secret Headliner.The Secret Headliners include Picture This, Cian Ducrot and Belters Only, with the Support Acts being: Simple Things from Kerry, Paddy Keyes from Sligo, and Groveline from Leitrim.",
  "score": null,
  "genres": [
    "Music"
  ],
  "screenshots": [],
  "systemRequirements": null
}