{
  "id": 84641,
  "type": "tv",
  "title": "The Lowdown",
  "releaseDate": "2025-09-23",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/584/1461549.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/584/1461549.jpg",
  "overview": "The Lowdown follows the gritty exploits of citizen journalist Lee Raybon, a self-proclaimed Tulsa \"truthstorian\" whose obsession with the truth is always getting him into trouble. Lee lives and works in a rare bookstore tucked in the heart of Tulsa - a local refuge and unofficial community hub. While Lee's no idealist, he's fiercely committed to exposing corruption and unearthing the city's hidden rot, even when it puts him at risk. His constant sleuthing pulls him deep into Tulsa's underbelly - and often away from his 14-year-old daughter Francis, a precocious kid who's inherited his curiosity and longs to join him on his adventures. His ex Samantha is exasperated by Lee's endless digging, but still sees the good in him - especially when it comes to Francis, the one thing they've never stopped showing up for. When the publication of Lee's latest exposé - a deep dive into the powerful Washberg family - is immediately followed by the suspicious suicide of Dale Washberg, the black sheep of the family, Lee knows he's stumbled onto something big. Following a trail of breadcrumbs Dale has left behind, urging someone to dig deeper into the circumstances surrounding his death, Lee does just that. What Lee finds is that Betty Jo, the grieving widow, seems to be more interested in her brother-in-law Donald Washberg, a gubernatorial candidate, than in her dearly departed. And powerful forces want to prevent Lee from learning anything more. Lee has also gained the attention of a mysterious stranger who seems to appear whenever Lee least expects it: refined and suave, Marty shares Lee's appreciation of great literary minds, and seems unusually interested in his investigation into the Washberg family.",
  "score": null,
  "genres": [
    "Drama",
    "Crime"
  ],
  "screenshots": [],
  "systemRequirements": null
}