{
  "id": 81676,
  "type": "tv",
  "title": "Great Migrations: A People on the Move",
  "releaseDate": "2025-01-28",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/548/1372482.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/548/1372482.jpg",
  "overview": "Great Migrations: A People on the Move tells the story of African American movement over the 20th and 21st centuries, and how it has shaped our nation by exploring the meaning behind those movements. What political or economic pressures inspire people to move? Is it more often inspired by hope or fear? Is there even such a thing as a promised land? Human beings have always moved en masse. Since the beginning of human existence, movement has defined how we evolved and created identities, communities, and nations-states. Migration is not unique to any single ethnicity or group, but it is a deeply profound aspect of the modern African American experience simply because Black people were denied movement for so long. Theirs was a forced migration from Africa, followed by centuries of enslavement that kept them in place. In being denied movement, they were denied their humanity. After emancipation, the migratory spirit took hold in this new space of freedom, and many African Americans uprooted themselves from all that was familiar to move to northern cities (sometimes stopping first in southern cities) to build entirely new lives – a decision that dramatically changed the fabric of American culture and society. It was an epic migration of people that began in the late 19th century when it was clear that the early promises of Reconstruction would not be fulfilled, and accelerated as the century progressed. Underlying this courageous act was the abiding belief in American opportunity, as well as a belief in their own capacity to better their lives, and the lives of their children. In some ways, it has never really ended. ",
  "score": null,
  "genres": [
    "History"
  ],
  "screenshots": [],
  "systemRequirements": null
}