{
  "id": 82012,
  "type": "tv",
  "title": "She Rides the Wind",
  "releaseDate": "2025-01-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/551/1379441.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/551/1379441.jpg",
  "overview": "The soon-to-be CEO of the Qin Corporation, Qin Nan, unexpectedly discovers her husband, Luo Sen, having an illicit affair with her father's secretary, Tong Qian. This betrayal drives her to the brink of despair. After being reborn, she resolves to uncover the truth behind the Qin Corporation's precarious situation. To solidify her position in the company, Qin Nan hires Fu Yunlan, the Chief Technology Officer of Simulation Cabin. With Fu Yunlan's help, she repeatedly thwarts the traps set by Tong Qian and Luo Sen. Amid the turmoil, an unexpected romance begins to blossom.Qin Nan uncovers evidence of Tong Qian's embezzlement and successfully forces her out, compelling Luo Sen, her accomplice, to flee in disgrace. However, she soon discovers the real reason Fu Yunlan joined the company: to investigate the truth behind his sister Fu Yunya's tragic death.Through their joint efforts, the criminal schemes of Zhao Zicheng, a business partner of the Qin Corporation, come to light. It is revealed that he sexually assaulted Fu Yunya, ultimately driving her to take her own life. Fu Yunlan's quest for revenge places him in grave danger, prompting Qin Nan to risk her life to save him. Together, they bring Zhao Zicheng to justice.Just when it seems everything has finally settled, Qin Nan is betrayed and imprisoned by her best friend, Xue Minmin, who is revealed to have been part of Tong Qian's long-laid schemes. In a life-and-death confrontation, Fu Yunlan takes a desperate risk, thwarting Tong Qian and Xue Minmin's plans but vanishing from Qin Nan's life in the process.Where did he go? After Qin Nan's countless fruitless searches, one quiet afternoon, he reappears before her once more...",
  "score": null,
  "genres": [
    "Romance"
  ],
  "screenshots": [],
  "systemRequirements": null
}