{
  "id": 82540,
  "type": "tv",
  "title": "Сеанс с Кашпировским",
  "releaseDate": "2009-09-20",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/555/1388787.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/555/1388787.jpg",
  "overview": "1987. On the air of the program \"Vzglyad\", in front of the whole country, journalist Vadim Belozerov has his arm pierced with a long \"Gypsy\" needle. At the same time, he continues to host the program as if nothing had happened. Not only TV viewers are surprised: Belozerov's colleagues know that the journalist is deathly afraid of any injections and cannot stand even the slightest pain. Belozerov explains: he was anesthetized remotely, with a look, by a guest in the studio, psychotherapist Anatoly Kashpirovsky. A few months later, in March 1988, on the air of the same \"Vzglyad\", Dr. Kashpirovsky will conduct a unique teleconference: he will anesthetize a woman who is on the operating table many kilometers away, in Kyiv. The experiment will be repeated in 1989, this time with two patients at once. And on October 9, 1989, the first \"Kashpirovsky Session\" was broadcast. Today it seems that these sessions lasted for several years, but in fact, there were only 8 episodes. This was enough for them to become iconic, and the doctor's phrases, for example, \"I give the order!\" - winged. Kashpirovsky himself remained one of the most famous, mysterious and controversial figures of the perestroika era. In the program, Anatoly Kashpirovsky appears in a new capacity: now he is not only a psychotherapist, capable of making you forget about pain with his gaze or giving a \"order for good\". He is the chief judge and expert in the field of the unknown and inexplicable, everything that goes beyond human understanding. Psychics, telepathy and telekinesis, ghosts, dream mysteries, damage and the evil eye, signs of fate - all these topics excite many, but cannot always be explained by modern science. In each episode of the program, the doctor, having chosen one of these topics, will conduct a comprehensive investigation. Mysterious stories, eyewitness accounts and witnesses of incredible events flock to the mobile headquarters of Anatoly Kashpirovsky. He studies them, evaluates their veracity and tries to separate the facts from harmless fiction or disguised fraud. It is not easy to make the doctor believe: he rejects many stories that are convincing to the uninitiated right away, while others he goes to study personally. On the instructions of Anatoly Kashpirovsky, unique experiments are carried out in real time in front of TV viewers, and he himself takes direct part in some of them.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}