{
  "id": 84662,
  "type": "tv",
  "title": "The Kingdom",
  "releaseDate": "2025-08-14",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/583/1459102.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/583/1459102.jpg",
  "overview": "The Kingdom was filmed over the course of the 2024 season and includes unprecedented access into the players' lives on and off the field – details the Chiefs' journey as the club completed a franchise-record 15-win regular season, captured a third-consecutive Lamar Hunt Trophy as AFC champions, and made a third-straight Super Bowl appearance in New Orleans. The remarkable run builds upon nearly a decade of tremendous success, during which the team made the playoffs every year (2015-24), won the AFC West Division title nine years running (2016-24), appeared in the AFC Championship Game seven years in a row (2018-24), and ultimately made five Super Bowl appearances over the past six years, raising the hallowed Vince Lombardi Trophy three times.  Told through the lens of current-day players, coaches, and executive leaders, following them both on and off the field all season long, the series will also weave together tales of the team's long and celebrated history, its proud culture, as well as the Chiefs' deeply ingrained place in the Kansas City community and the wider sports landscape.Along the way, the series will spotlight the 65-year history of the Chiefs franchise dating back to its earliest days in Dallas, Texas, when the team was founded by the legendary sports innovator Lamar Hunt. It will explore the many highs and lows of the club's iconic path to modern-day dynasty, detailed by countless untold stories and behind-the-scenes moments that have shaped its legacy. With exclusive access to the organization's extensive and rarely seen photo and video archives, coupled with intimate interviews with players, coaches, and other key figures, the series will offer a fascinating look at the team's long path to the pinnacle of the sports world. ",
  "score": null,
  "genres": [
    "Sports"
  ],
  "screenshots": [],
  "systemRequirements": null
}