{
  "id": 81499,
  "type": "tv",
  "title": "Michael Lynn - The Fugitive",
  "releaseDate": "2025-01-06",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/550/1376703.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/550/1376703.jpg",
  "overview": "New RTÉ Documentary Michael Lynn: The Fugitive asks where did the money go?One of the loose ends that still exists with the Michael Lynn story is the question of what happened with the money. Virtually none of which has been recovered. When solicitor Michael Lynn fled Ireland in December 2007, he'd clocked up €80m in loans from high street banks, much of them fraudulently secured via multiple mortgages. And he owed another €12m to private investors who had paid out for unbuilt apartments abroad.A new two-part documentary series beginning on RTÉ One and RTÉ Player tonight, highlights new links involving a Bulgarian business associate of Michael Lynn's setting up companies in Ireland relating to property development, and those company accounts being accessed by Mr Lynn's wife, Brid Murphy withdrawing cash in the last year. Michael Lynn: The Fugitive reveals the true story of an epic hunt to bring one of Ireland's most notorious fugitives to justice told directly by the reporter who tracked him down, his victims, and former employees. The two-part series is directed by Trevor Birney and produced by Fine Point Films for RTÉ.Irish Mail on Sunday Journalist Michael O'Farrell and photographer Sean Dwyer ended up hunting Michael Lynn down all over the world, from Portugal to Bulgaria to a hellhole prison in Brazil. Michael Lynn was facing serious questions about his fraudulent actions in Ireland when he fled to Portugal. They spotted someone tearing up documents and leaving them outside Lynn's offices in Portugal one night. When they got them back to the hotel and pieced them together, it was a treasure trove of information on Lynn. They had discovered a cache of discarded documents in Portugal which led them deeper into Lynn's labyrinth of lies.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}