{
  "id": 81765,
  "type": "tv",
  "title": "Island Echoes With Nornie Bero",
  "releaseDate": "2025-01-08",
  "posterImage": "https://static.tvmaze.com/uploads/images/original_untouched/549/1374009.jpg",
  "backdropImage": "https://static.tvmaze.com/uploads/images/original_untouched/549/1374009.jpg",
  "overview": "This January, join acclaimed Torres Strait Islander chef and cultural ambassador Nornie Bero on a vibrant journey through the breathtaking landscapes and rich traditions of her homeland in her brand-new series, Island Echoes with Nornie Bero. Nornie explores the unique stories, flavours and histories of the Torres Strait Islands, showcasing the diverse cultures that thrive in this remote paradise.Known for her passion for Indigenous cuisine and storytelling, Nornie invites viewers into her world as she cooks traditional dishes using locally sourced ingredients, while also sharing the customs of her Ancestors. From fishing with local communities to participating in traditional ceremonies, Nornie connects the past with the present, highlighting the resilience and creativity of the Torres Strait people.Island Echoes with Nornie Bero is not just a cooking show; it's a celebration of culture, community, and connection to the land. Each episode includes a feast, where Nornie and her guests reflect on the importance of heritage, sustainability, and the power of food to bring people together.In the series, Nornie returns to her roots on Mer Island, a place steeped in cultural significance and personal memories, where she reflects on her journey as a chef and cultural advocate while reconnecting with the vibrant community that shaped her.Throughout the journey, discover traditions that have been passed down through generations and explore many incredible locations and recipes of the Torres Strait including island scallops with ocean seasoning in Badu Island, musu steak with wattle seed in Moa and a delicious fresh Masig seafood platter in Masig.In Island Echoes, discover the echoes of the past that resonate through the vibrant culture of the Torres Strait Islands and be inspired to cherish and celebrate the stories that shape our world.",
  "score": null,
  "genres": [],
  "screenshots": [],
  "systemRequirements": null
}